{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 143, "word_counts": "{\"hola\": 3, \"hey\": 1, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"como\": 15, \"estas\": 2, \"que\": 61, \"tal\": 4, \"saludos\": 1, \"hi\": 1, \"tu\": 5, \"dia\": 2, \"te\": 3, \"encuentras\": 1, \"todo\": 6, \"va\": 2, \"has\": 1, \"hecho\": 1, \"bien\": 7, \"me\": 6, \"cuentas\": 1, \"hay\": 2, \"de\": 21, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"y\": 3, \"perfecto\": 1, \"bastante\": 1, \"por\": 3, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adios\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 1, \"manana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 1, \"tiempo\": 1, \"se\": 3, \"agradece\": 1, \"es\": 21, \"la\": 4, \"programacion\": 5, \"define\": 2, \"en\": 8, \"terminos\": 2, \"creacion\": 1, \"software\": 1, \"describe\": 1, \"tecnicos\": 1, \"relaciona\": 1, \"con\": 5, \"el\": 6, \"hardware\": 1, \"una\": 17, \"variable\": 4, \"hace\": 6, \"valor\": 2, \"puede\": 1, \"cambiar\": 1, \"para\": 7, \"utiliza\": 1, \"un\": 13, \"condicional\": 1, \"if\": 3, \"tipo\": 1, \"instruccion\": 1, \"hacen\": 1, \"los\": 7, \"condicionales\": 1, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"ayudan\": 1, \"ciclos\": 2, \"aplicacion\": 1, \"importancia\": 2, \"tienen\": 2, \"programa\": 1, \"condiciones\": 1, \"debe\": 1, \"cumplir\": 1, \"ejecutarse\": 1, \"funcion\": 3, \"metodo\": 2, \"devuelve\": 1, \"diferencia\": 1, \"entre\": 1, \"las\": 2, \"funciones\": 1, \"metodos\": 1, \"oop\": 4, \"cuales\": 3, \"son\": 5, \"caracteristicas\": 1, \"del\": 1, \"recomendable\": 1, \"usar\": 1, \"tan\": 1, \"popular\": 3, \"genero\": 1, \"peliculas\": 1, \"mas\": 3, \"cual\": 3, \"costo\": 1, \"promedio\": 1, \"hacer\": 3, \"pelicula\": 7, \"accion\": 1, \"recomendarias\": 1, \"este\": 1, \"ano\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"tienes\": 2, \"algun\": 2, \"bueno\": 1, \"di\": 2, \"algo\": 3, \"gracioso\": 1, \"recomiendas\": 1, \"alguna\": 3, \"actividad\": 2, \"hoy\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 1, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 1, \"darme\": 1, \"dame\": 2, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"ganas\": 1, \"comer\": 2, \"sql\": 6, \"significa\": 7, \"definir\": 1, \"representa\": 1, \"tipos\": 4, \"bases\": 7, \"datos\": 3, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"tabla\": 4, \"sirve\": 3, \"table\": 1, \"select\": 4, \"funciona\": 5, \"consultas\": 1, \"where\": 4, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 5, \"comando\": 2, \"update\": 5, \"delete\": 3, \"elimino\": 2, \"registros\": 1, \"saldre\": 4, \"unos\": 1, \"amigos\": 4, \"a\": 3, \"tomar\": 1, \"concierto\": 1}", "word_docs": "{\"hola\": 3, \"hey\": 1, \"dias\": 1, \"buenos\": 1, \"tardes\": 1, \"buenas\": 2, \"noches\": 1, \"como\": 15, \"estas\": 2, \"tal\": 4, \"que\": 61, \"saludos\": 1, \"hi\": 1, \"dia\": 2, \"tu\": 5, \"encuentras\": 1, \"te\": 3, \"todo\": 6, \"va\": 2, \"has\": 1, \"hecho\": 1, \"bien\": 7, \"me\": 6, \"cuentas\": 1, \"nuevo\": 1, \"de\": 18, \"hay\": 2, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"y\": 3, \"perfecto\": 1, \"bastante\": 1, \"preguntar\": 1, \"por\": 3, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adios\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 1, \"manana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 1, \"tiempo\": 1, \"agradece\": 1, \"se\": 3, \"la\": 4, \"es\": 21, \"programacion\": 5, \"creacion\": 1, \"software\": 1, \"terminos\": 2, \"define\": 2, \"en\": 7, \"tecnicos\": 1, \"describe\": 1, \"relaciona\": 1, \"con\": 5, \"el\": 6, \"hardware\": 1, \"variable\": 4, \"una\": 16, \"hace\": 6, \"puede\": 1, \"valor\": 2, \"cambiar\": 1, \"utiliza\": 1, \"para\": 7, \"condicional\": 1, \"un\": 12, \"if\": 3, \"instruccion\": 1, \"tipo\": 1, \"condicionales\": 1, \"hacen\": 1, \"los\": 7, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"aplicacion\": 1, \"ciclos\": 2, \"ayudan\": 1, \"tienen\": 2, \"programa\": 1, \"importancia\": 2, \"cumplir\": 1, \"condiciones\": 1, \"debe\": 1, \"ejecutarse\": 1, \"funcion\": 3, \"metodo\": 2, \"devuelve\": 1, \"entre\": 1, \"diferencia\": 1, \"metodos\": 1, \"las\": 2, \"funciones\": 1, \"oop\": 4, \"son\": 5, \"del\": 1, \"caracteristicas\": 1, \"cuales\": 3, \"usar\": 1, \"recomendable\": 1, \"popular\": 3, \"tan\": 1, \"mas\": 3, \"genero\": 1, \"peliculas\": 1, \"cual\": 3, \"promedio\": 1, \"costo\": 1, \"hacer\": 3, \"pelicula\": 7, \"recomendarias\": 1, \"accion\": 1, \"este\": 1, \"ano\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"algun\": 2, \"bueno\": 1, \"tienes\": 2, \"algo\": 3, \"gracioso\": 1, \"di\": 2, \"hoy\": 2, \"recomiendas\": 1, \"actividad\": 2, \"alguna\": 3, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 1, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 1, \"darme\": 1, \"dame\": 2, \"frase\": 1, \"preparar\": 2, \"comida\": 3, \"recomiendame\": 1, \"pueda\": 1, \"ganas\": 1, \"comer\": 2, \"tengo\": 1, \"sql\": 6, \"significa\": 7, \"definir\": 1, \"representa\": 1, \"datos\": 3, \"existen\": 4, \"bases\": 7, \"tipos\": 4, \"modelos\": 1, \"clases\": 1, \"tabla\": 4, \"sirve\": 3, \"table\": 1, \"select\": 4, \"funciona\": 5, \"consultas\": 1, \"where\": 4, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 5, \"comando\": 2, \"update\": 5, \"delete\": 3, \"elimino\": 2, \"registros\": 1, \"unos\": 1, \"amigos\": 4, \"saldre\": 4, \"tomar\": 1, \"a\": 3, \"concierto\": 1}", "index_docs": "{\"40\": 3, \"93\": 1, \"95\": 1, \"94\": 1, \"96\": 1, \"62\": 2, \"97\": 1, \"6\": 15, \"63\": 2, \"28\": 4, \"2\": 61, \"98\": 1, \"99\": 1, \"64\": 2, \"21\": 5, \"100\": 1, \"41\": 3, \"16\": 6, \"65\": 2, \"101\": 1, \"102\": 1, \"9\": 7, \"17\": 6, \"103\": 1, \"104\": 1, \"3\": 18, \"66\": 2, \"10\": 7, \"67\": 2, \"105\": 1, \"42\": 3, \"106\": 1, \"107\": 1, \"108\": 1, \"43\": 3, \"109\": 1, \"110\": 1, \"111\": 1, \"112\": 1, \"44\": 3, \"68\": 2, \"69\": 2, \"70\": 2, \"113\": 1, \"114\": 1, \"115\": 1, \"116\": 1, \"117\": 1, \"118\": 1, \"119\": 1, \"120\": 1, \"121\": 1, \"122\": 1, \"123\": 1, \"124\": 1, \"125\": 1, \"126\": 1, \"127\": 1, \"128\": 1, \"45\": 3, \"29\": 4, \"4\": 21, \"22\": 5, \"129\": 1, \"130\": 1, \"72\": 2, \"71\": 2, \"8\": 7, \"132\": 1, \"131\": 1, \"133\": 1, \"23\": 5, \"18\": 6, \"134\": 1, \"30\": 4, \"5\": 16, \"19\": 6, \"135\": 1, \"73\": 2, \"136\": 1, \"137\": 1, \"11\": 7, \"138\": 1, \"7\": 12, \"46\": 3, \"140\": 1, \"139\": 1, \"142\": 1, \"141\": 1, \"12\": 7, \"143\": 1, \"144\": 1, \"74\": 2, \"146\": 1, \"75\": 2, \"145\": 1, \"77\": 2, \"147\": 1, \"76\": 2, \"150\": 1, \"148\": 1, \"149\": 1, \"151\": 1, \"47\": 3, \"78\": 2, \"152\": 1, \"154\": 1, \"153\": 1, \"156\": 1, \"79\": 2, \"155\": 1, \"31\": 4, \"24\": 5, \"158\": 1, \"157\": 1, \"48\": 3, \"160\": 1, \"159\": 1, \"49\": 3, \"161\": 1, \"50\": 3, \"162\": 1, \"163\": 1, \"51\": 3, \"165\": 1, \"164\": 1, \"52\": 3, \"13\": 7, \"167\": 1, \"166\": 1, \"168\": 1, \"169\": 1, \"170\": 1, \"53\": 3, \"80\": 2, \"82\": 2, \"171\": 1, \"81\": 2, \"54\": 3, \"172\": 1, \"83\": 2, \"85\": 2, \"173\": 1, \"84\": 2, \"55\": 3, \"32\": 4, \"86\": 2, \"174\": 1, \"175\": 1, \"176\": 1, \"56\": 3, \"177\": 1, \"178\": 1, \"87\": 2, \"179\": 1, \"88\": 2, \"57\": 3, \"180\": 1, \"181\": 1, \"183\": 1, \"89\": 2, \"182\": 1, \"20\": 6, \"14\": 7, \"184\": 1, \"185\": 1, \"58\": 3, \"34\": 4, \"15\": 7, \"33\": 4, \"186\": 1, \"187\": 1, \"35\": 4, \"59\": 3, \"188\": 1, \"36\": 4, \"25\": 5, \"189\": 1, \"37\": 4, \"190\": 1, \"90\": 2, \"191\": 1, \"192\": 1, \"26\": 5, \"91\": 2, \"27\": 5, \"60\": 3, \"92\": 2, \"193\": 1, \"194\": 1, \"39\": 4, \"38\": 4, \"195\": 1, \"61\": 3, \"196\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"que\", \"3\": \"de\", \"4\": \"es\", \"5\": \"una\", \"6\": \"como\", \"7\": \"un\", \"8\": \"en\", \"9\": \"bien\", \"10\": \"gracias\", \"11\": \"para\", \"12\": \"los\", \"13\": \"pelicula\", \"14\": \"significa\", \"15\": \"bases\", \"16\": \"todo\", \"17\": \"me\", \"18\": \"el\", \"19\": \"hace\", \"20\": \"sql\", \"21\": \"tu\", \"22\": \"programacion\", \"23\": \"con\", \"24\": \"son\", \"25\": \"funciona\", \"26\": \"insert\", \"27\": \"update\", \"28\": \"tal\", \"29\": \"la\", \"30\": \"variable\", \"31\": \"oop\", \"32\": \"podria\", \"33\": \"tipos\", \"34\": \"existen\", \"35\": \"tabla\", \"36\": \"select\", \"37\": \"where\", \"38\": \"saldre\", \"39\": \"amigos\", \"40\": \"hola\", \"41\": \"te\", \"42\": \"y\", \"43\": \"por\", \"44\": \"hasta\", \"45\": \"se\", \"46\": \"if\", \"47\": \"funcion\", \"48\": \"cuales\", \"49\": \"popular\", \"50\": \"mas\", \"51\": \"cual\", \"52\": \"hacer\", \"53\": \"chiste\", \"54\": \"algo\", \"55\": \"alguna\", \"56\": \"dialogo\", \"57\": \"comida\", \"58\": \"datos\", \"59\": \"sirve\", \"60\": \"delete\", \"61\": \"a\", \"62\": \"buenas\", \"63\": \"estas\", \"64\": \"dia\", \"65\": \"va\", \"66\": \"hay\", \"67\": \"muy\", \"68\": \"luego\", \"69\": \"nos\", \"70\": \"vemos\", \"71\": \"define\", \"72\": \"terminos\", \"73\": \"valor\", \"74\": \"ciclo\", \"75\": \"ciclos\", \"76\": \"importancia\", \"77\": \"tienen\", \"78\": \"metodo\", \"79\": \"las\", \"80\": \"dime\", \"81\": \"tienes\", \"82\": \"algun\", \"83\": \"di\", \"84\": \"actividad\", \"85\": \"hoy\", \"86\": \"realizar\", \"87\": \"dame\", \"88\": \"preparar\", \"89\": \"comer\", \"90\": \"eres\", \"91\": \"comando\", \"92\": \"elimino\", \"93\": \"hey\", \"94\": \"buenos\", \"95\": \"dias\", \"96\": \"tardes\", \"97\": \"noches\", \"98\": \"saludos\", \"99\": \"hi\", \"100\": \"encuentras\", \"101\": \"has\", \"102\": \"hecho\", \"103\": \"cuentas\", \"104\": \"nuevo\", \"105\": \"excelente\", \"106\": \"perfecto\", \"107\": \"bastante\", \"108\": \"preguntar\", \"109\": \"no\", \"110\": \"quejo\", \"111\": \"genial\", \"112\": \"adios\", \"113\": \"chao\", \"114\": \"pronto\", \"115\": \"voy\", \"116\": \"bye\", \"117\": \"manana\", \"118\": \"despido\", \"119\": \"muchas\", \"120\": \"lo\", \"121\": \"agradezco\", \"122\": \"mil\", \"123\": \"amable\", \"124\": \"aprecio\", \"125\": \"ayuda\", \"126\": \"thanks\", \"127\": \"tiempo\", \"128\": \"agradece\", \"129\": \"creacion\", \"130\": \"software\", \"131\": \"describe\", \"132\": \"tecnicos\", \"133\": \"relaciona\", \"134\": \"hardware\", \"135\": \"puede\", \"136\": \"cambiar\", \"137\": \"utiliza\", \"138\": \"condicional\", \"139\": \"tipo\", \"140\": \"instruccion\", \"141\": \"hacen\", \"142\": \"condicionales\", \"143\": \"toman\", \"144\": \"desiciones\", \"145\": \"ayudan\", \"146\": \"aplicacion\", \"147\": \"programa\", \"148\": \"condiciones\", \"149\": \"debe\", \"150\": \"cumplir\", \"151\": \"ejecutarse\", \"152\": \"devuelve\", \"153\": \"diferencia\", \"154\": \"entre\", \"155\": \"funciones\", \"156\": \"metodos\", \"157\": \"caracteristicas\", \"158\": \"del\", \"159\": \"recomendable\", \"160\": \"usar\", \"161\": \"tan\", \"162\": \"genero\", \"163\": \"peliculas\", \"164\": \"costo\", \"165\": \"promedio\", \"166\": \"accion\", \"167\": \"recomendarias\", \"168\": \"este\", \"169\": \"ano\", \"170\": \"cuentame\", \"171\": \"bueno\", \"172\": \"gracioso\", \"173\": \"recomiendas\", \"174\": \"actividades\", \"175\": \"mi\", \"176\": \"divertido\", \"177\": \"podrias\", \"178\": \"darme\", \"179\": \"frase\", \"180\": \"recomiendame\", \"181\": \"pueda\", \"182\": \"tengo\", \"183\": \"ganas\", \"184\": \"definir\", \"185\": \"representa\", \"186\": \"modelos\", \"187\": \"clases\", \"188\": \"table\", \"189\": \"consultas\", \"190\": \"filtros\", \"191\": \"quien\", \"192\": \"haces\", \"193\": \"registros\", \"194\": \"unos\", \"195\": \"tomar\", \"196\": \"concierto\"}", "word_index": "{\"<OOV>\": 1, \"que\": 2, \"de\": 3, \"es\": 4, \"una\": 5, \"como\": 6, \"un\": 7, \"en\": 8, \"bien\": 9, \"gracias\": 10, \"para\": 11, \"los\": 12, \"pelicula\": 13, \"significa\": 14, \"bases\": 15, \"todo\": 16, \"me\": 17, \"el\": 18, \"hace\": 19, \"sql\": 20, \"tu\": 21, \"programacion\": 22, \"con\": 23, \"son\": 24, \"funciona\": 25, \"insert\": 26, \"update\": 27, \"tal\": 28, \"la\": 29, \"variable\": 30, \"oop\": 31, \"podria\": 32, \"tipos\": 33, \"existen\": 34, \"tabla\": 35, \"select\": 36, \"where\": 37, \"saldre\": 38, \"amigos\": 39, \"hola\": 40, \"te\": 41, \"y\": 42, \"por\": 43, \"hasta\": 44, \"se\": 45, \"if\": 46, \"funcion\": 47, \"cuales\": 48, \"popular\": 49, \"mas\": 50, \"cual\": 51, \"hacer\": 52, \"chiste\": 53, \"algo\": 54, \"alguna\": 55, \"dialogo\": 56, \"comida\": 57, \"datos\": 58, \"sirve\": 59, \"delete\": 60, \"a\": 61, \"buenas\": 62, \"estas\": 63, \"dia\": 64, \"va\": 65, \"hay\": 66, \"muy\": 67, \"luego\": 68, \"nos\": 69, \"vemos\": 70, \"define\": 71, \"terminos\": 72, \"valor\": 73, \"ciclo\": 74, \"ciclos\": 75, \"importancia\": 76, \"tienen\": 77, \"metodo\": 78, \"las\": 79, \"dime\": 80, \"tienes\": 81, \"algun\": 82, \"di\": 83, \"actividad\": 84, \"hoy\": 85, \"realizar\": 86, \"dame\": 87, \"preparar\": 88, \"comer\": 89, \"eres\": 90, \"comando\": 91, \"elimino\": 92, \"hey\": 93, \"buenos\": 94, \"dias\": 95, \"tardes\": 96, \"noches\": 97, \"saludos\": 98, \"hi\": 99, \"encuentras\": 100, \"has\": 101, \"hecho\": 102, \"cuentas\": 103, \"nuevo\": 104, \"excelente\": 105, \"perfecto\": 106, \"bastante\": 107, \"preguntar\": 108, \"no\": 109, \"quejo\": 110, \"genial\": 111, \"adios\": 112, \"chao\": 113, \"pronto\": 114, \"voy\": 115, \"bye\": 116, \"manana\": 117, \"despido\": 118, \"muchas\": 119, \"lo\": 120, \"agradezco\": 121, \"mil\": 122, \"amable\": 123, \"aprecio\": 124, \"ayuda\": 125, \"thanks\": 126, \"tiempo\": 127, \"agradece\": 128, \"creacion\": 129, \"software\": 130, \"describe\": 131, \"tecnicos\": 132, \"relaciona\": 133, \"hardware\": 134, \"puede\": 135, \"cambiar\": 136, \"utiliza\": 137, \"condicional\": 138, \"tipo\": 139, \"instruccion\": 140, \"hacen\": 141, \"condicionales\": 142, \"toman\": 143, \"desiciones\": 144, \"ayudan\": 145, \"aplicacion\": 146, \"programa\": 147, \"condiciones\": 148, \"debe\": 149, \"cumplir\": 150, \"ejecutarse\": 151, \"devuelve\": 152, \"diferencia\": 153, \"entre\": 154, \"funciones\": 155, \"metodos\": 156, \"caracteristicas\": 157, \"del\": 158, \"recomendable\": 159, \"usar\": 160, \"tan\": 161, \"genero\": 162, \"peliculas\": 163, \"costo\": 164, \"promedio\": 165, \"accion\": 166, \"recomendarias\": 167, \"este\": 168, \"ano\": 169, \"cuentame\": 170, \"bueno\": 171, \"gracioso\": 172, \"recomiendas\": 173, \"actividades\": 174, \"mi\": 175, \"divertido\": 176, \"podrias\": 177, \"darme\": 178, \"frase\": 179, \"recomiendame\": 180, \"pueda\": 181, \"tengo\": 182, \"ganas\": 183, \"definir\": 184, \"representa\": 185, \"modelos\": 186, \"clases\": 187, \"table\": 188, \"consultas\": 189, \"filtros\": 190, \"quien\": 191, \"haces\": 192, \"registros\": 193, \"unos\": 194, \"tomar\": 195, \"concierto\": 196}"}}