{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 268, "word_counts": "{\"hola\": 3, \"hey\": 2, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"como\": 15, \"estas\": 2, \"que\": 61, \"tal\": 4, \"saludos\": 1, \"hi\": 2, \"tu\": 5, \"dia\": 2, \"te\": 3, \"encuentras\": 1, \"todo\": 6, \"va\": 2, \"has\": 1, \"hecho\": 1, \"bien\": 7, \"me\": 14, \"cuentas\": 1, \"hay\": 2, \"de\": 21, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"y\": 3, \"perfecto\": 1, \"bastante\": 1, \"por\": 3, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adios\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 2, \"manana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 6, \"tiempo\": 1, \"se\": 3, \"agradece\": 1, \"es\": 21, \"la\": 4, \"programacion\": 5, \"define\": 7, \"en\": 8, \"terminos\": 2, \"creacion\": 1, \"software\": 2, \"describe\": 2, \"tecnicos\": 1, \"relaciona\": 1, \"con\": 5, \"el\": 6, \"hardware\": 2, \"una\": 17, \"variable\": 8, \"hace\": 6, \"valor\": 2, \"puede\": 1, \"cambiar\": 1, \"para\": 7, \"utiliza\": 1, \"un\": 13, \"condicional\": 1, \"if\": 5, \"tipo\": 1, \"instruccion\": 1, \"hacen\": 1, \"los\": 7, \"condicionales\": 1, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"ayudan\": 1, \"ciclos\": 2, \"aplicacion\": 1, \"importancia\": 2, \"tienen\": 2, \"programa\": 1, \"condiciones\": 1, \"debe\": 1, \"cumplir\": 1, \"ejecutarse\": 1, \"funcion\": 3, \"metodo\": 2, \"devuelve\": 1, \"diferencia\": 1, \"entre\": 1, \"las\": 2, \"funciones\": 1, \"metodos\": 1, \"oop\": 8, \"cuales\": 3, \"son\": 5, \"caracteristicas\": 1, \"del\": 1, \"recomendable\": 1, \"usar\": 1, \"tan\": 1, \"popular\": 4, \"genero\": 1, \"peliculas\": 1, \"mas\": 3, \"cual\": 3, \"costo\": 1, \"promedio\": 1, \"hacer\": 3, \"pelicula\": 7, \"accion\": 1, \"recomendarias\": 1, \"este\": 1, \"ano\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"tienes\": 2, \"algun\": 2, \"bueno\": 1, \"di\": 2, \"algo\": 3, \"gracioso\": 1, \"recomiendas\": 1, \"alguna\": 3, \"actividad\": 2, \"hoy\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 1, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 1, \"darme\": 1, \"dame\": 2, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"ganas\": 1, \"comer\": 2, \"sql\": 12, \"significa\": 7, \"definir\": 1, \"representa\": 1, \"tipos\": 4, \"bases\": 7, \"datos\": 3, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"tabla\": 4, \"sirve\": 3, \"table\": 6, \"select\": 8, \"funciona\": 5, \"consultas\": 1, \"where\": 8, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 10, \"comando\": 2, \"update\": 10, \"delete\": 8, \"elimino\": 2, \"registros\": 1, \"saldre\": 4, \"unos\": 1, \"amigos\": 4, \"a\": 23, \"tomar\": 1, \"concierto\": 1, \"hello\": 3, \"good\": 5, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"how\": 18, \"are\": 11, \"you\": 22, \"what's\": 2, \"up\": 3, \"greetings\": 1, \"what\": 50, \"is\": 25, \"does\": 19, \"mean\": 7, \"to\": 7, \"represent\": 1, \"do\": 22, \"types\": 2, \"of\": 9, \"databases\": 5, \"exist\": 4, \"kinds\": 1, \"database\": 1, \"models\": 1, \"classes\": 1, \"the\": 5, \"in\": 9, \"used\": 4, \"for\": 8, \"work\": 5, \"queries\": 1, \"filters\": 1, \"who\": 1, \"your\": 4, \"function\": 4, \"command\": 2, \"i\": 14, \"data\": 1, \"records\": 1, \"will\": 4, \"go\": 4, \"out\": 3, \"with\": 4, \"some\": 1, \"friends\": 4, \"drinks\": 1, \"concert\": 1, \"eat\": 1, \"day\": 2, \"going\": 2, \"feeling\": 1, \"everything\": 3, \"have\": 3, \"been\": 1, \"fine\": 3, \"great\": 2, \"very\": 3, \"and\": 3, \"asking\": 1, \"goodbye\": 1, \"see\": 4, \"later\": 1, \"soon\": 1, \"tomorrow\": 1, \"thank\": 2, \"much\": 2, \"appreciate\": 2, \"it\": 2, \"many\": 1, \"you're\": 1, \"kind\": 1, \"help\": 2, \"time\": 1, \"appreciated\": 1, \"programming\": 8, \"can\": 6, \"give\": 5, \"definition\": 2, \"technical\": 1, \"terms\": 2, \"related\": 1, \"creation\": 1, \"an\": 5, \"type\": 1, \"instruction\": 1, \"conditionals\": 1, \"ifs\": 1, \"make\": 3, \"decisions\": 1, \"loops\": 4, \"application\": 2, \"one\": 1, \"difference\": 1, \"between\": 1, \"method\": 1, \"important\": 1, \"functions\": 1, \"methods\": 1, \"characteristics\": 1, \"recommended\": 1, \"use\": 1, \"tell\": 2, \"joke\": 3, \"say\": 3, \"something\": 2, \"funny\": 1, \"recommend\": 2, \"any\": 2, \"activity\": 2, \"today\": 3, \"could\": 4, \"activities\": 1, \"my\": 1, \"more\": 1, \"fun\": 1, \"movie\": 4, \"quote\": 2, \"quotes\": 1, \"line\": 1, \"from\": 1, \"food\": 3, \"prepare\": 1, \"feel\": 1, \"like\": 1, \"eating\": 1}", "word_docs": "{\"hola\": 3, \"hey\": 2, \"buenos\": 1, \"dias\": 1, \"tardes\": 1, \"buenas\": 2, \"noches\": 1, \"estas\": 2, \"como\": 15, \"tal\": 4, \"que\": 61, \"saludos\": 1, \"hi\": 2, \"dia\": 2, \"tu\": 5, \"encuentras\": 1, \"te\": 3, \"todo\": 6, \"va\": 2, \"hecho\": 1, \"has\": 1, \"bien\": 7, \"cuentas\": 1, \"me\": 14, \"de\": 18, \"hay\": 2, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"y\": 3, \"perfecto\": 1, \"bastante\": 1, \"preguntar\": 1, \"por\": 3, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adios\": 1, \"luego\": 2, \"hasta\": 3, \"vemos\": 2, \"nos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 2, \"manana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"ayuda\": 1, \"aprecio\": 1, \"thanks\": 6, \"tiempo\": 1, \"se\": 3, \"agradece\": 1, \"es\": 21, \"la\": 4, \"programacion\": 5, \"en\": 7, \"creacion\": 1, \"software\": 2, \"terminos\": 2, \"define\": 7, \"describe\": 2, \"tecnicos\": 1, \"el\": 6, \"hardware\": 2, \"relaciona\": 1, \"con\": 5, \"una\": 16, \"variable\": 8, \"hace\": 6, \"valor\": 2, \"puede\": 1, \"cambiar\": 1, \"para\": 7, \"utiliza\": 1, \"un\": 12, \"condicional\": 1, \"if\": 5, \"tipo\": 1, \"instruccion\": 1, \"condicionales\": 1, \"hacen\": 1, \"los\": 7, \"desiciones\": 1, \"toman\": 1, \"ciclo\": 2, \"aplicacion\": 1, \"ciclos\": 2, \"ayudan\": 1, \"importancia\": 2, \"programa\": 1, \"tienen\": 2, \"ejecutarse\": 1, \"cumplir\": 1, \"debe\": 1, \"condiciones\": 1, \"funcion\": 3, \"devuelve\": 1, \"metodo\": 2, \"diferencia\": 1, \"entre\": 1, \"las\": 2, \"metodos\": 1, \"funciones\": 1, \"oop\": 8, \"cuales\": 3, \"del\": 1, \"caracteristicas\": 1, \"son\": 5, \"usar\": 1, \"recomendable\": 1, \"tan\": 1, \"popular\": 4, \"genero\": 1, \"peliculas\": 1, \"mas\": 3, \"cual\": 3, \"hacer\": 3, \"promedio\": 1, \"pelicula\": 7, \"costo\": 1, \"recomendarias\": 1, \"accion\": 1, \"este\": 1, \"ano\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"tienes\": 2, \"bueno\": 1, \"algun\": 2, \"di\": 2, \"algo\": 3, \"gracioso\": 1, \"recomiendas\": 1, \"alguna\": 3, \"hoy\": 2, \"actividad\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 1, \"divertido\": 1, \"dialogo\": 3, \"darme\": 1, \"podrias\": 1, \"frase\": 1, \"dame\": 2, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"comer\": 2, \"ganas\": 1, \"sql\": 12, \"significa\": 7, \"definir\": 1, \"representa\": 1, \"bases\": 7, \"tipos\": 4, \"datos\": 3, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"tabla\": 4, \"sirve\": 3, \"table\": 6, \"select\": 8, \"funciona\": 5, \"consultas\": 1, \"where\": 8, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 10, \"comando\": 2, \"update\": 10, \"delete\": 8, \"elimino\": 2, \"registros\": 1, \"saldre\": 4, \"unos\": 1, \"amigos\": 4, \"a\": 21, \"tomar\": 1, \"concierto\": 1, \"hello\": 3, \"morning\": 1, \"good\": 5, \"afternoon\": 1, \"evening\": 1, \"are\": 11, \"how\": 18, \"you\": 22, \"what's\": 2, \"up\": 3, \"greetings\": 1, \"what\": 50, \"is\": 25, \"does\": 19, \"mean\": 7, \"to\": 7, \"represent\": 1, \"do\": 18, \"databases\": 5, \"exist\": 4, \"of\": 9, \"types\": 2, \"kinds\": 1, \"database\": 1, \"models\": 1, \"classes\": 1, \"the\": 5, \"in\": 9, \"used\": 4, \"for\": 8, \"work\": 5, \"queries\": 1, \"filters\": 1, \"who\": 1, \"your\": 4, \"function\": 4, \"command\": 2, \"i\": 14, \"data\": 1, \"records\": 1, \"some\": 1, \"friends\": 4, \"with\": 4, \"will\": 4, \"go\": 4, \"out\": 3, \"drinks\": 1, \"concert\": 1, \"eat\": 1, \"day\": 2, \"going\": 2, \"feeling\": 1, \"everything\": 3, \"have\": 3, \"been\": 1, \"fine\": 3, \"great\": 2, \"very\": 3, \"and\": 3, \"asking\": 1, \"goodbye\": 1, \"see\": 4, \"later\": 1, \"soon\": 1, \"tomorrow\": 1, \"much\": 2, \"thank\": 2, \"it\": 2, \"appreciate\": 2, \"many\": 1, \"you're\": 1, \"kind\": 1, \"help\": 2, \"time\": 1, \"appreciated\": 1, \"programming\": 8, \"give\": 5, \"can\": 6, \"definition\": 2, \"technical\": 1, \"terms\": 2, \"related\": 1, \"creation\": 1, \"an\": 5, \"type\": 1, \"instruction\": 1, \"conditionals\": 1, \"ifs\": 1, \"decisions\": 1, \"make\": 3, \"loops\": 4, \"application\": 2, \"one\": 1, \"between\": 1, \"method\": 1, \"difference\": 1, \"important\": 1, \"functions\": 1, \"methods\": 1, \"characteristics\": 1, \"use\": 1, \"recommended\": 1, \"tell\": 2, \"joke\": 3, \"say\": 3, \"something\": 2, \"funny\": 1, \"any\": 2, \"today\": 3, \"recommend\": 2, \"activity\": 2, \"could\": 4, \"activities\": 1, \"my\": 1, \"fun\": 1, \"more\": 1, \"movie\": 4, \"quote\": 2, \"quotes\": 1, \"line\": 1, \"from\": 1, \"food\": 3, \"prepare\": 1, \"eating\": 1, \"feel\": 1, \"like\": 1}", "index_docs": "{\"80\": 3, \"111\": 2, \"167\": 1, \"168\": 1, \"169\": 1, \"112\": 2, \"170\": 1, \"113\": 2, \"13\": 15, \"59\": 4, \"2\": 61, \"171\": 1, \"114\": 2, \"115\": 2, \"47\": 5, \"172\": 1, \"81\": 3, \"41\": 6, \"116\": 2, \"174\": 1, \"173\": 1, \"31\": 7, \"175\": 1, \"14\": 14, \"8\": 18, \"117\": 2, \"176\": 1, \"32\": 7, \"118\": 2, \"177\": 1, \"82\": 3, \"178\": 1, \"179\": 1, \"180\": 1, \"83\": 3, \"181\": 1, \"182\": 1, \"183\": 1, \"184\": 1, \"119\": 2, \"84\": 3, \"121\": 2, \"120\": 2, \"185\": 1, \"186\": 1, \"187\": 1, \"122\": 2, \"188\": 1, \"189\": 1, \"190\": 1, \"191\": 1, \"192\": 1, \"193\": 1, \"194\": 1, \"196\": 1, \"195\": 1, \"42\": 6, \"197\": 1, \"85\": 3, \"198\": 1, \"9\": 21, \"60\": 4, \"48\": 5, \"23\": 7, \"199\": 1, \"124\": 2, \"123\": 2, \"33\": 7, \"125\": 2, \"200\": 1, \"43\": 6, \"126\": 2, \"201\": 1, \"49\": 5, \"12\": 16, \"24\": 8, \"44\": 6, \"127\": 2, \"202\": 1, \"203\": 1, \"34\": 7, \"204\": 1, \"16\": 12, \"205\": 1, \"50\": 5, \"206\": 1, \"207\": 1, \"209\": 1, \"208\": 1, \"35\": 7, \"211\": 1, \"210\": 1, \"128\": 2, \"213\": 1, \"129\": 2, \"212\": 1, \"130\": 2, \"214\": 1, \"131\": 2, \"218\": 1, \"217\": 1, \"216\": 1, \"215\": 1, \"86\": 3, \"219\": 1, \"132\": 2, \"220\": 1, \"221\": 1, \"133\": 2, \"223\": 1, \"222\": 1, \"25\": 8, \"87\": 3, \"225\": 1, \"224\": 1, \"51\": 5, \"227\": 1, \"226\": 1, \"228\": 1, \"61\": 4, \"229\": 1, \"230\": 1, \"88\": 3, \"89\": 3, \"90\": 3, \"232\": 1, \"36\": 7, \"231\": 1, \"234\": 1, \"233\": 1, \"235\": 1, \"236\": 1, \"237\": 1, \"91\": 3, \"134\": 2, \"135\": 2, \"238\": 1, \"136\": 2, \"137\": 2, \"92\": 3, \"239\": 1, \"240\": 1, \"93\": 3, \"139\": 2, \"138\": 2, \"62\": 4, \"140\": 2, \"241\": 1, \"242\": 1, \"243\": 1, \"94\": 3, \"245\": 1, \"244\": 1, \"246\": 1, \"141\": 2, \"95\": 3, \"142\": 2, \"247\": 1, \"248\": 1, \"249\": 1, \"143\": 2, \"250\": 1, \"17\": 12, \"37\": 7, \"251\": 1, \"252\": 1, \"38\": 7, \"63\": 4, \"96\": 3, \"64\": 4, \"253\": 1, \"254\": 1, \"65\": 4, \"97\": 3, \"45\": 6, \"26\": 8, \"52\": 5, \"255\": 1, \"27\": 8, \"256\": 1, \"144\": 2, \"257\": 1, \"258\": 1, \"19\": 10, \"145\": 2, \"20\": 10, \"28\": 8, \"146\": 2, \"259\": 1, \"66\": 4, \"260\": 1, \"67\": 4, \"5\": 21, \"261\": 1, \"262\": 1, \"98\": 3, \"263\": 1, \"53\": 5, \"264\": 1, \"265\": 1, \"18\": 11, \"11\": 18, \"6\": 22, \"147\": 2, \"99\": 3, \"266\": 1, \"3\": 50, \"4\": 25, \"10\": 19, \"39\": 7, \"40\": 7, \"267\": 1, \"7\": 18, \"54\": 5, \"68\": 4, \"21\": 9, \"148\": 2, \"268\": 1, \"269\": 1, \"270\": 1, \"271\": 1, \"55\": 5, \"22\": 9, \"69\": 4, \"29\": 8, \"56\": 5, \"272\": 1, \"273\": 1, \"274\": 1, \"70\": 4, \"71\": 4, \"149\": 2, \"15\": 14, \"275\": 1, \"276\": 1, \"277\": 1, \"75\": 4, \"74\": 4, \"72\": 4, \"73\": 4, \"100\": 3, \"278\": 1, \"279\": 1, \"280\": 1, \"150\": 2, \"151\": 2, \"281\": 1, \"101\": 3, \"102\": 3, \"282\": 1, \"103\": 3, \"152\": 2, \"104\": 3, \"105\": 3, \"283\": 1, \"284\": 1, \"76\": 4, \"285\": 1, \"286\": 1, \"287\": 1, \"154\": 2, \"153\": 2, \"156\": 2, \"155\": 2, \"288\": 1, \"289\": 1, \"290\": 1, \"157\": 2, \"291\": 1, \"292\": 1, \"30\": 8, \"57\": 5, \"46\": 6, \"158\": 2, \"293\": 1, \"159\": 2, \"294\": 1, \"295\": 1, \"58\": 5, \"296\": 1, \"297\": 1, \"298\": 1, \"299\": 1, \"300\": 1, \"106\": 3, \"77\": 4, \"160\": 2, \"301\": 1, \"303\": 1, \"304\": 1, \"302\": 1, \"305\": 1, \"306\": 1, \"307\": 1, \"308\": 1, \"310\": 1, \"309\": 1, \"161\": 2, \"107\": 3, \"108\": 3, \"162\": 2, \"311\": 1, \"164\": 2, \"109\": 3, \"163\": 2, \"165\": 2, \"78\": 4, \"312\": 1, \"313\": 1, \"315\": 1, \"314\": 1, \"79\": 4, \"166\": 2, \"316\": 1, \"317\": 1, \"318\": 1, \"110\": 3, \"319\": 1, \"322\": 1, \"320\": 1, \"321\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"que\", \"3\": \"what\", \"4\": \"is\", \"5\": \"a\", \"6\": \"you\", \"7\": \"do\", \"8\": \"de\", \"9\": \"es\", \"10\": \"does\", \"11\": \"how\", \"12\": \"una\", \"13\": \"como\", \"14\": \"me\", \"15\": \"i\", \"16\": \"un\", \"17\": \"sql\", \"18\": \"are\", \"19\": \"insert\", \"20\": \"update\", \"21\": \"of\", \"22\": \"in\", \"23\": \"en\", \"24\": \"variable\", \"25\": \"oop\", \"26\": \"select\", \"27\": \"where\", \"28\": \"delete\", \"29\": \"for\", \"30\": \"programming\", \"31\": \"bien\", \"32\": \"gracias\", \"33\": \"define\", \"34\": \"para\", \"35\": \"los\", \"36\": \"pelicula\", \"37\": \"significa\", \"38\": \"bases\", \"39\": \"mean\", \"40\": \"to\", \"41\": \"todo\", \"42\": \"thanks\", \"43\": \"el\", \"44\": \"hace\", \"45\": \"table\", \"46\": \"can\", \"47\": \"tu\", \"48\": \"programacion\", \"49\": \"con\", \"50\": \"if\", \"51\": \"son\", \"52\": \"funciona\", \"53\": \"good\", \"54\": \"databases\", \"55\": \"the\", \"56\": \"work\", \"57\": \"give\", \"58\": \"an\", \"59\": \"tal\", \"60\": \"la\", \"61\": \"popular\", \"62\": \"podria\", \"63\": \"tipos\", \"64\": \"existen\", \"65\": \"tabla\", \"66\": \"saldre\", \"67\": \"amigos\", \"68\": \"exist\", \"69\": \"used\", \"70\": \"your\", \"71\": \"function\", \"72\": \"will\", \"73\": \"go\", \"74\": \"with\", \"75\": \"friends\", \"76\": \"see\", \"77\": \"loops\", \"78\": \"could\", \"79\": \"movie\", \"80\": \"hola\", \"81\": \"te\", \"82\": \"y\", \"83\": \"por\", \"84\": \"hasta\", \"85\": \"se\", \"86\": \"funcion\", \"87\": \"cuales\", \"88\": \"mas\", \"89\": \"cual\", \"90\": \"hacer\", \"91\": \"chiste\", \"92\": \"algo\", \"93\": \"alguna\", \"94\": \"dialogo\", \"95\": \"comida\", \"96\": \"datos\", \"97\": \"sirve\", \"98\": \"hello\", \"99\": \"up\", \"100\": \"out\", \"101\": \"everything\", \"102\": \"have\", \"103\": \"fine\", \"104\": \"very\", \"105\": \"and\", \"106\": \"make\", \"107\": \"joke\", \"108\": \"say\", \"109\": \"today\", \"110\": \"food\", \"111\": \"hey\", \"112\": \"buenas\", \"113\": \"estas\", \"114\": \"hi\", \"115\": \"dia\", \"116\": \"va\", \"117\": \"hay\", \"118\": \"muy\", \"119\": \"luego\", \"120\": \"nos\", \"121\": \"vemos\", \"122\": \"bye\", \"123\": \"terminos\", \"124\": \"software\", \"125\": \"describe\", \"126\": \"hardware\", \"127\": \"valor\", \"128\": \"ciclo\", \"129\": \"ciclos\", \"130\": \"importancia\", \"131\": \"tienen\", \"132\": \"metodo\", \"133\": \"las\", \"134\": \"dime\", \"135\": \"tienes\", \"136\": \"algun\", \"137\": \"di\", \"138\": \"actividad\", \"139\": \"hoy\", \"140\": \"realizar\", \"141\": \"dame\", \"142\": \"preparar\", \"143\": \"comer\", \"144\": \"eres\", \"145\": \"comando\", \"146\": \"elimino\", \"147\": \"what's\", \"148\": \"types\", \"149\": \"command\", \"150\": \"day\", \"151\": \"going\", \"152\": \"great\", \"153\": \"thank\", \"154\": \"much\", \"155\": \"appreciate\", \"156\": \"it\", \"157\": \"help\", \"158\": \"definition\", \"159\": \"terms\", \"160\": \"application\", \"161\": \"tell\", \"162\": \"something\", \"163\": \"recommend\", \"164\": \"any\", \"165\": \"activity\", \"166\": \"quote\", \"167\": \"buenos\", \"168\": \"dias\", \"169\": \"tardes\", \"170\": \"noches\", \"171\": \"saludos\", \"172\": \"encuentras\", \"173\": \"has\", \"174\": \"hecho\", \"175\": \"cuentas\", \"176\": \"nuevo\", \"177\": \"excelente\", \"178\": \"perfecto\", \"179\": \"bastante\", \"180\": \"preguntar\", \"181\": \"no\", \"182\": \"quejo\", \"183\": \"genial\", \"184\": \"adios\", \"185\": \"chao\", \"186\": \"pronto\", \"187\": \"voy\", \"188\": \"manana\", \"189\": \"despido\", \"190\": \"muchas\", \"191\": \"lo\", \"192\": \"agradezco\", \"193\": \"mil\", \"194\": \"amable\", \"195\": \"aprecio\", \"196\": \"ayuda\", \"197\": \"tiempo\", \"198\": \"agradece\", \"199\": \"creacion\", \"200\": \"tecnicos\", \"201\": \"relaciona\", \"202\": \"puede\", \"203\": \"cambiar\", \"204\": \"utiliza\", \"205\": \"condicional\", \"206\": \"tipo\", \"207\": \"instruccion\", \"208\": \"hacen\", \"209\": \"condicionales\", \"210\": \"toman\", \"211\": \"desiciones\", \"212\": \"ayudan\", \"213\": \"aplicacion\", \"214\": \"programa\", \"215\": \"condiciones\", \"216\": \"debe\", \"217\": \"cumplir\", \"218\": \"ejecutarse\", \"219\": \"devuelve\", \"220\": \"diferencia\", \"221\": \"entre\", \"222\": \"funciones\", \"223\": \"metodos\", \"224\": \"caracteristicas\", \"225\": \"del\", \"226\": \"recomendable\", \"227\": \"usar\", \"228\": \"tan\", \"229\": \"genero\", \"230\": \"peliculas\", \"231\": \"costo\", \"232\": \"promedio\", \"233\": \"accion\", \"234\": \"recomendarias\", \"235\": \"este\", \"236\": \"ano\", \"237\": \"cuentame\", \"238\": \"bueno\", \"239\": \"gracioso\", \"240\": \"recomiendas\", \"241\": \"actividades\", \"242\": \"mi\", \"243\": \"divertido\", \"244\": \"podrias\", \"245\": \"darme\", \"246\": \"frase\", \"247\": \"recomiendame\", \"248\": \"pueda\", \"249\": \"tengo\", \"250\": \"ganas\", \"251\": \"definir\", \"252\": \"representa\", \"253\": \"modelos\", \"254\": \"clases\", \"255\": \"consultas\", \"256\": \"filtros\", \"257\": \"quien\", \"258\": \"haces\", \"259\": \"registros\", \"260\": \"unos\", \"261\": \"tomar\", \"262\": \"concierto\", \"263\": \"morning\", \"264\": \"afternoon\", \"265\": \"evening\", \"266\": \"greetings\", \"267\": \"represent\", \"268\": \"kinds\", \"269\": \"database\", \"270\": \"models\", \"271\": \"classes\", \"272\": \"queries\", \"273\": \"filters\", \"274\": \"who\", \"275\": \"data\", \"276\": \"records\", \"277\": \"some\", \"278\": \"drinks\", \"279\": \"concert\", \"280\": \"eat\", \"281\": \"feeling\", \"282\": \"been\", \"283\": \"asking\", \"284\": \"goodbye\", \"285\": \"later\", \"286\": \"soon\", \"287\": \"tomorrow\", \"288\": \"many\", \"289\": \"you're\", \"290\": \"kind\", \"291\": \"time\", \"292\": \"appreciated\", \"293\": \"technical\", \"294\": \"related\", \"295\": \"creation\", \"296\": \"type\", \"297\": \"instruction\", \"298\": \"conditionals\", \"299\": \"ifs\", \"300\": \"decisions\", \"301\": \"one\", \"302\": \"difference\", \"303\": \"between\", \"304\": \"method\", \"305\": \"important\", \"306\": \"functions\", \"307\": \"methods\", \"308\": \"characteristics\", \"309\": \"recommended\", \"310\": \"use\", \"311\": \"funny\", \"312\": \"activities\", \"313\": \"my\", \"314\": \"more\", \"315\": \"fun\", \"316\": \"quotes\", \"317\": \"line\", \"318\": \"from\", \"319\": \"prepare\", \"320\": \"feel\", \"321\": \"like\", \"322\": \"eating\"}", "word_index": "{\"<OOV>\": 1, \"que\": 2, \"what\": 3, \"is\": 4, \"a\": 5, \"you\": 6, \"do\": 7, \"de\": 8, \"es\": 9, \"does\": 10, \"how\": 11, \"una\": 12, \"como\": 13, \"me\": 14, \"i\": 15, \"un\": 16, \"sql\": 17, \"are\": 18, \"insert\": 19, \"update\": 20, \"of\": 21, \"in\": 22, \"en\": 23, \"variable\": 24, \"oop\": 25, \"select\": 26, \"where\": 27, \"delete\": 28, \"for\": 29, \"programming\": 30, \"bien\": 31, \"gracias\": 32, \"define\": 33, \"para\": 34, \"los\": 35, \"pelicula\": 36, \"significa\": 37, \"bases\": 38, \"mean\": 39, \"to\": 40, \"todo\": 41, \"thanks\": 42, \"el\": 43, \"hace\": 44, \"table\": 45, \"can\": 46, \"tu\": 47, \"programacion\": 48, \"con\": 49, \"if\": 50, \"son\": 51, \"funciona\": 52, \"good\": 53, \"databases\": 54, \"the\": 55, \"work\": 56, \"give\": 57, \"an\": 58, \"tal\": 59, \"la\": 60, \"popular\": 61, \"podria\": 62, \"tipos\": 63, \"existen\": 64, \"tabla\": 65, \"saldre\": 66, \"amigos\": 67, \"exist\": 68, \"used\": 69, \"your\": 70, \"function\": 71, \"will\": 72, \"go\": 73, \"with\": 74, \"friends\": 75, \"see\": 76, \"loops\": 77, \"could\": 78, \"movie\": 79, \"hola\": 80, \"te\": 81, \"y\": 82, \"por\": 83, \"hasta\": 84, \"se\": 85, \"funcion\": 86, \"cuales\": 87, \"mas\": 88, \"cual\": 89, \"hacer\": 90, \"chiste\": 91, \"algo\": 92, \"alguna\": 93, \"dialogo\": 94, \"comida\": 95, \"datos\": 96, \"sirve\": 97, \"hello\": 98, \"up\": 99, \"out\": 100, \"everything\": 101, \"have\": 102, \"fine\": 103, \"very\": 104, \"and\": 105, \"make\": 106, \"joke\": 107, \"say\": 108, \"today\": 109, \"food\": 110, \"hey\": 111, \"buenas\": 112, \"estas\": 113, \"hi\": 114, \"dia\": 115, \"va\": 116, \"hay\": 117, \"muy\": 118, \"luego\": 119, \"nos\": 120, \"vemos\": 121, \"bye\": 122, \"terminos\": 123, \"software\": 124, \"describe\": 125, \"hardware\": 126, \"valor\": 127, \"ciclo\": 128, \"ciclos\": 129, \"importancia\": 130, \"tienen\": 131, \"metodo\": 132, \"las\": 133, \"dime\": 134, \"tienes\": 135, \"algun\": 136, \"di\": 137, \"actividad\": 138, \"hoy\": 139, \"realizar\": 140, \"dame\": 141, \"preparar\": 142, \"comer\": 143, \"eres\": 144, \"comando\": 145, \"elimino\": 146, \"what's\": 147, \"types\": 148, \"command\": 149, \"day\": 150, \"going\": 151, \"great\": 152, \"thank\": 153, \"much\": 154, \"appreciate\": 155, \"it\": 156, \"help\": 157, \"definition\": 158, \"terms\": 159, \"application\": 160, \"tell\": 161, \"something\": 162, \"recommend\": 163, \"any\": 164, \"activity\": 165, \"quote\": 166, \"buenos\": 167, \"dias\": 168, \"tardes\": 169, \"noches\": 170, \"saludos\": 171, \"encuentras\": 172, \"has\": 173, \"hecho\": 174, \"cuentas\": 175, \"nuevo\": 176, \"excelente\": 177, \"perfecto\": 178, \"bastante\": 179, \"preguntar\": 180, \"no\": 181, \"quejo\": 182, \"genial\": 183, \"adios\": 184, \"chao\": 185, \"pronto\": 186, \"voy\": 187, \"manana\": 188, \"despido\": 189, \"muchas\": 190, \"lo\": 191, \"agradezco\": 192, \"mil\": 193, \"amable\": 194, \"aprecio\": 195, \"ayuda\": 196, \"tiempo\": 197, \"agradece\": 198, \"creacion\": 199, \"tecnicos\": 200, \"relaciona\": 201, \"puede\": 202, \"cambiar\": 203, \"utiliza\": 204, \"condicional\": 205, \"tipo\": 206, \"instruccion\": 207, \"hacen\": 208, \"condicionales\": 209, \"toman\": 210, \"desiciones\": 211, \"ayudan\": 212, \"aplicacion\": 213, \"programa\": 214, \"condiciones\": 215, \"debe\": 216, \"cumplir\": 217, \"ejecutarse\": 218, \"devuelve\": 219, \"diferencia\": 220, \"entre\": 221, \"funciones\": 222, \"metodos\": 223, \"caracteristicas\": 224, \"del\": 225, \"recomendable\": 226, \"usar\": 227, \"tan\": 228, \"genero\": 229, \"peliculas\": 230, \"costo\": 231, \"promedio\": 232, \"accion\": 233, \"recomendarias\": 234, \"este\": 235, \"ano\": 236, \"cuentame\": 237, \"bueno\": 238, \"gracioso\": 239, \"recomiendas\": 240, \"actividades\": 241, \"mi\": 242, \"divertido\": 243, \"podrias\": 244, \"darme\": 245, \"frase\": 246, \"recomiendame\": 247, \"pueda\": 248, \"tengo\": 249, \"ganas\": 250, \"definir\": 251, \"representa\": 252, \"modelos\": 253, \"clases\": 254, \"consultas\": 255, \"filtros\": 256, \"quien\": 257, \"haces\": 258, \"registros\": 259, \"unos\": 260, \"tomar\": 261, \"concierto\": 262, \"morning\": 263, \"afternoon\": 264, \"evening\": 265, \"greetings\": 266, \"represent\": 267, \"kinds\": 268, \"database\": 269, \"models\": 270, \"classes\": 271, \"queries\": 272, \"filters\": 273, \"who\": 274, \"data\": 275, \"records\": 276, \"some\": 277, \"drinks\": 278, \"concert\": 279, \"eat\": 280, \"feeling\": 281, \"been\": 282, \"asking\": 283, \"goodbye\": 284, \"later\": 285, \"soon\": 286, \"tomorrow\": 287, \"many\": 288, \"you're\": 289, \"kind\": 290, \"time\": 291, \"appreciated\": 292, \"technical\": 293, \"related\": 294, \"creation\": 295, \"type\": 296, \"instruction\": 297, \"conditionals\": 298, \"ifs\": 299, \"decisions\": 300, \"one\": 301, \"difference\": 302, \"between\": 303, \"method\": 304, \"important\": 305, \"functions\": 306, \"methods\": 307, \"characteristics\": 308, \"recommended\": 309, \"use\": 310, \"funny\": 311, \"activities\": 312, \"my\": 313, \"more\": 314, \"fun\": 315, \"quotes\": 316, \"line\": 317, \"from\": 318, \"prepare\": 319, \"feel\": 320, \"like\": 321, \"eating\": 322}"}}