{"class_name": "Tokenizer", "config": {"num_words": 20000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 988, "word_counts": "{\"hola\": 1, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"quien\": 2, \"eres\": 6, \"tu\": 4, \"que\": 96, \"haces\": 1, \"cual\": 2, \"es\": 30, \"funcion\": 70, \"describeme\": 26, \"funcionalidad\": 1, \"como\": 187, \"funcionas\": 1, \"tipo\": 2, \"de\": 315, \"bot\": 2, \"dime\": 14, \"explicame\": 39, \"en\": 481, \"me\": 118, \"puedes\": 67, \"ayudar\": 1, \"estas\": 2, \"te\": 3, \"encuentras\": 1, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"la\": 192, \"programacion\": 22, \"funciona\": 28, \"define\": 84, \"un\": 207, \"algoritmo\": 177, \"lenguaje\": 6, \"una\": 75, \"variable\": 32, \"constante\": 11, \"ciclo\": 26, \"for\": 50, \"condicion\": 11, \"if\": 56, \"bucle\": 13, \"while\": 42, \"clase\": 45, \"objeto\": 16, \"el\": 308, \"polimorfismo\": 16, \"herencia\": 16, \"encapsulamiento\": 16, \"abstraccion\": 5, \"orientado\": 5, \"a\": 186, \"objetos\": 5, \"poo\": 5, \"lenguajes\": 9, \"existen\": 2, \"deberia\": 1, \"aprender\": 1, \"cuales\": 2, \"son\": 2, \"los\": 5, \"mas\": 2, \"populares\": 2, \"dame\": 45, \"listado\": 1, \"sabes\": 2, \"conoces\": 2, \"para\": 63, \"programar\": 3, \"soportas\": 1, \"entiendes\": 2, \"python\": 450, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"ejecuto\": 3, \"mi\": 8, \"programa\": 12, \"corro\": 1, \"pruebo\": 1, \"app\": 2, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"ayudame\": 1, \"crear\": 8, \"puedo\": 9, \"empezar\": 1, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 14, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 75, \"del\": 131, \"algoritmos\": 9, \"con\": 37, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 14, \"ordenamiento\": 79, \"grafos\": 14, \"arboles\": 25, \"burbuja\": 54, \"quicksort\": 96, \"ensename\": 47, \"codigo\": 145, \"ejemplifica\": 6, \"por\": 49, \"seleccion\": 49, \"javascript\": 239, \"definicion\": 4, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 8, \"instalar\": 1, \"decirme\": 2, \"obtener\": 1, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"pasos\": 3, \"debo\": 3, \"seguir\": 3, \"se\": 43, \"ejecuta\": 1, \"inicializa\": 1, \"crea\": 6, \"diferencia\": 3, \"hay\": 1, \"entre\": 4, \"var\": 10, \"let\": 10, \"y\": 7, \"const\": 10, \"las\": 23, \"diferencias\": 1, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 8, \"escribe\": 8, \"\\u00bfpuedes\": 1, \"ense\\u00f1arme\": 1, \"podrias\": 31, \"darme\": 11, \"usar\": 3, \"tienes\": 1, \"algun\": 1, \"implementar\": 8, \"sentencia\": 1, \"muestrame\": 53, \"definir\": 4, \"utiliza\": 2, \"aplicar\": 1, \"implementa\": 5, \"mostrarme\": 28, \"asignar\": 1, \"arbol\": 1, \"hace\": 5, \"proporciona\": 17, \"uso\": 1, \"practico\": 2, \"realiza\": 6, \"ensenarme\": 41, \"implementan\": 1, \"claro\": 1, \"suma\": 31, \"quiero\": 23, \"ver\": 24, \"dentro\": 1, \"linea\": 14, \"lectura\": 4, \"numeros\": 1, \"recibe\": 2, \"realizar\": 1, \"datos\": 1, \"leen\": 1, \"valores\": 3, \"lineas\": 22, \"hacen\": 1, \"llama\": 2, \"llamada\": 3, \"muestra\": 9, \"resultado\": 6, \"imprime\": 3, \"mostrar\": 3, \"mostarme\": 1, \"numero\": 10, \"secreto\": 10, \"usado\": 2, \"condicional\": 2, \"dataclass\": 8, \"constantes\": 4, \"constructor\": 24, \"persona\": 13, \"metodo\": 8, \"saludar\": 4, \"nueva\": 3, \"instancia\": 4, \"animal\": 5, \"perro\": 5, \"basico\": 18, \"quicksor\": 1, \"asigna\": 10, \"pivote\": 18, \"separan\": 4, \"arreglo\": 8, \"dos\": 3, \"sublistas\": 6, \"divide\": 4, \"partes\": 2, \"return\": 24, \"optimizado\": 13, \"tres\": 3, \"iteracion\": 12, \"recorrido\": 5, \"lista\": 17, \"recorrer\": 8, \"comparar\": 17, \"elementos\": 22, \"compara\": 3, \"comparacion\": 4, \"intercambiar\": 14, \"encontrar\": 6, \"indice\": 6, \"elemento\": 12, \"minimo\": 12, \"sublista\": 10, \"restante\": 2, \"menor\": 2, \"primero\": 8, \"cambiar\": 2, \"indices\": 29, \"explicitos\": 30, \"logica\": 1, \"inidices\": 1, \"particion\": 20, \"proporcionarme\": 1, \"selecciona\": 1, \"elige\": 1, \"proporcionar\": 1, \"intercambia\": 4, \"nodo\": 8, \"inorden\": 4, \"hello\": 1, \"good\": 3, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"hi\": 1, \"who\": 2, \"are\": 12, \"you\": 59, \"what\": 48, \"do\": 95, \"is\": 38, \"your\": 2, \"function\": 41, \"describe\": 24, \"functionality\": 1, \"how\": 172, \"work\": 25, \"kind\": 1, \"of\": 90, \"tell\": 17, \"explain\": 46, \"can\": 39, \"help\": 2, \"doing\": 1, \"feel\": 1, \"how's\": 1, \"it\": 1, \"going\": 1, \"today\": 1, \"programming\": 21, \"does\": 24, \"an\": 100, \"algorithm\": 63, \"language\": 6, \"constant\": 11, \"loop\": 43, \"condition\": 11, \"cycle\": 5, \"class\": 21, \"object\": 17, \"polymorphism\": 16, \"encapsulation\": 16, \"abstraction\": 5, \"oriented\": 1, \"oop\": 4, \"languages\": 9, \"exist\": 1, \"there\": 1, \"should\": 4, \"i\": 99, \"learn\": 1, \"the\": 118, \"most\": 2, \"popular\": 2, \"give\": 45, \"list\": 1, \"know\": 4, \"which\": 2, \"support\": 1, \"understand\": 2, \"to\": 51, \"install\": 3, \"get\": 2, \"download\": 3, \"run\": 4, \"my\": 8, \"program\": 12, \"in\": 253, \"execute\": 5, \"test\": 1, \"application\": 1, \"start\": 2, \"initiate\": 1, \"create\": 23, \"begin\": 1, \"declare\": 13, \"assign\": 13, \"initialize\": 13, \"example\": 81, \"inheritance\": 11, \"algorithms\": 9, \"teach\": 12, \"handle\": 1, \"search\": 14, \"sorting\": 5, \"graph\": 12, \"tree\": 12, \"bubble\": 14, \"sort\": 23, \"with\": 17, \"code\": 34, \"show\": 45, \"trees\": 2, \"graphs\": 2, \"selection\": 9, \"definition\": 3, \"about\": 1, \"type\": 1, \"steps\": 3, \"follow\": 3, \"difference\": 3, \"between\": 4, \"and\": 5, \"differences\": 1, \"differ\": 1, \"write\": 12, \"use\": 3, \"have\": 1, \"implement\": 8, \"statement\": 9, \"defined\": 3, \"used\": 2, \"apply\": 1, \"implemented\": 3, \"works\": 2, \"created\": 2, \"provide\": 7, \"usage\": 1, \"practical\": 2, \"could\": 5, \"clear\": 1, \"sum\": 26, \"want\": 7, \"see\": 7, \"that\": 18, \"performs\": 5, \"addition\": 5, \"inside\": 1, \"line\": 8, \"read\": 4, \"numbers\": 1, \"receives\": 2, \"data\": 1, \"values\": 3, \"reading\": 1, \"lines\": 2, \"calls\": 5, \"shows\": 1, \"result\": 6, \"shown\": 1, \"prints\": 2, \"display\": 1, \"print\": 1, \"secret\": 10, \"number\": 10, \"conditional\": 1, \"constants\": 4, \"defines\": 1, \"creates\": 1, \"person\": 5}", "word_docs": "{\"hola\": 1, \"buenos\": 1, \"dias\": 1, \"tardes\": 1, \"buenas\": 2, \"noches\": 1, \"tu\": 4, \"eres\": 6, \"quien\": 2, \"que\": 96, \"haces\": 1, \"es\": 30, \"funcion\": 70, \"cual\": 2, \"describeme\": 26, \"funcionalidad\": 1, \"como\": 187, \"funcionas\": 1, \"tipo\": 2, \"bot\": 2, \"de\": 240, \"dime\": 14, \"explicame\": 39, \"me\": 117, \"puedes\": 67, \"en\": 408, \"ayudar\": 1, \"estas\": 2, \"te\": 3, \"encuentras\": 1, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"la\": 169, \"programacion\": 22, \"funciona\": 28, \"define\": 84, \"algoritmo\": 177, \"un\": 173, \"lenguaje\": 6, \"una\": 75, \"variable\": 32, \"constante\": 11, \"for\": 50, \"ciclo\": 26, \"condicion\": 11, \"if\": 56, \"bucle\": 13, \"while\": 42, \"clase\": 45, \"objeto\": 16, \"el\": 217, \"polimorfismo\": 16, \"herencia\": 16, \"encapsulamiento\": 16, \"abstraccion\": 5, \"orientado\": 5, \"a\": 185, \"objetos\": 5, \"poo\": 5, \"existen\": 2, \"lenguajes\": 9, \"aprender\": 1, \"deberia\": 1, \"son\": 2, \"mas\": 2, \"populares\": 2, \"los\": 5, \"cuales\": 2, \"dame\": 45, \"listado\": 1, \"sabes\": 2, \"programar\": 3, \"para\": 63, \"conoces\": 2, \"soportas\": 1, \"entiendes\": 2, \"python\": 450, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"mi\": 8, \"programa\": 12, \"ejecuto\": 3, \"corro\": 1, \"pruebo\": 1, \"app\": 2, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"ayudame\": 1, \"crear\": 8, \"empezar\": 1, \"puedo\": 9, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 14, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 75, \"del\": 114, \"algoritmos\": 9, \"ensenar\": 1, \"con\": 37, \"manejas\": 1, \"busqueda\": 14, \"ordenamiento\": 79, \"grafos\": 14, \"arboles\": 25, \"burbuja\": 54, \"quicksort\": 88, \"ensename\": 47, \"codigo\": 145, \"ejemplifica\": 6, \"seleccion\": 49, \"por\": 49, \"javascript\": 239, \"definicion\": 4, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 8, \"instalar\": 1, \"obtener\": 1, \"decirme\": 2, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"pasos\": 3, \"seguir\": 3, \"debo\": 3, \"ejecuta\": 1, \"se\": 43, \"inicializa\": 1, \"crea\": 6, \"const\": 10, \"entre\": 4, \"hay\": 1, \"var\": 10, \"diferencia\": 3, \"y\": 7, \"let\": 10, \"diferencias\": 1, \"las\": 23, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 8, \"escribe\": 8, \"ense\\u00f1arme\": 1, \"\\u00bfpuedes\": 1, \"darme\": 11, \"podrias\": 31, \"usar\": 3, \"tienes\": 1, \"algun\": 1, \"implementar\": 8, \"sentencia\": 1, \"muestrame\": 53, \"definir\": 4, \"utiliza\": 2, \"aplicar\": 1, \"implementa\": 5, \"mostrarme\": 28, \"asignar\": 1, \"arbol\": 1, \"hace\": 5, \"uso\": 1, \"proporciona\": 17, \"practico\": 2, \"realiza\": 6, \"ensenarme\": 41, \"implementan\": 1, \"claro\": 1, \"suma\": 26, \"quiero\": 23, \"ver\": 24, \"dentro\": 1, \"linea\": 14, \"numeros\": 1, \"lectura\": 4, \"recibe\": 2, \"datos\": 1, \"realizar\": 1, \"leen\": 1, \"valores\": 3, \"lineas\": 22, \"hacen\": 1, \"llama\": 2, \"llamada\": 3, \"muestra\": 9, \"resultado\": 6, \"imprime\": 3, \"mostrar\": 3, \"numero\": 10, \"secreto\": 10, \"mostarme\": 1, \"usado\": 2, \"condicional\": 2, \"constantes\": 4, \"dataclass\": 8, \"constructor\": 24, \"persona\": 13, \"metodo\": 8, \"saludar\": 4, \"instancia\": 4, \"nueva\": 3, \"animal\": 5, \"perro\": 5, \"basico\": 18, \"quicksor\": 1, \"pivote\": 18, \"asigna\": 10, \"separan\": 4, \"dos\": 3, \"sublistas\": 6, \"arreglo\": 8, \"divide\": 4, \"partes\": 2, \"return\": 24, \"optimizado\": 13, \"tres\": 3, \"iteracion\": 12, \"lista\": 17, \"recorrido\": 5, \"recorrer\": 8, \"comparar\": 17, \"elementos\": 22, \"compara\": 3, \"comparacion\": 4, \"intercambiar\": 14, \"indice\": 6, \"encontrar\": 6, \"elemento\": 12, \"minimo\": 12, \"sublista\": 10, \"restante\": 2, \"menor\": 2, \"primero\": 8, \"cambiar\": 2, \"indices\": 29, \"explicitos\": 30, \"logica\": 1, \"inidices\": 1, \"particion\": 20, \"proporcionarme\": 1, \"selecciona\": 1, \"elige\": 1, \"proporcionar\": 1, \"intercambia\": 4, \"nodo\": 8, \"inorden\": 4, \"hello\": 1, \"morning\": 1, \"good\": 3, \"afternoon\": 1, \"evening\": 1, \"hi\": 1, \"who\": 2, \"are\": 12, \"you\": 59, \"what\": 48, \"do\": 94, \"is\": 38, \"function\": 41, \"your\": 2, \"describe\": 24, \"functionality\": 1, \"work\": 25, \"how\": 172, \"of\": 85, \"kind\": 1, \"tell\": 17, \"explain\": 46, \"help\": 2, \"can\": 39, \"doing\": 1, \"feel\": 1, \"how's\": 1, \"it\": 1, \"going\": 1, \"today\": 1, \"programming\": 21, \"does\": 24, \"algorithm\": 63, \"an\": 98, \"language\": 6, \"constant\": 11, \"loop\": 43, \"condition\": 11, \"cycle\": 5, \"class\": 21, \"object\": 17, \"polymorphism\": 16, \"encapsulation\": 16, \"abstraction\": 5, \"oriented\": 1, \"oop\": 4, \"exist\": 1, \"languages\": 9, \"there\": 1, \"should\": 4, \"learn\": 1, \"i\": 99, \"most\": 2, \"popular\": 2, \"the\": 51, \"list\": 1, \"give\": 45, \"know\": 4, \"which\": 2, \"support\": 1, \"understand\": 2, \"to\": 49, \"install\": 3, \"get\": 2, \"download\": 3, \"in\": 236, \"my\": 8, \"program\": 12, \"run\": 4, \"execute\": 5, \"test\": 1, \"application\": 1, \"start\": 2, \"initiate\": 1, \"create\": 23, \"begin\": 1, \"declare\": 13, \"assign\": 13, \"initialize\": 13, \"example\": 81, \"inheritance\": 11, \"algorithms\": 9, \"teach\": 12, \"handle\": 1, \"search\": 14, \"sorting\": 5, \"graph\": 12, \"tree\": 12, \"sort\": 23, \"bubble\": 14, \"with\": 17, \"code\": 34, \"show\": 45, \"trees\": 2, \"graphs\": 2, \"selection\": 9, \"definition\": 3, \"about\": 1, \"type\": 1, \"follow\": 3, \"steps\": 3, \"difference\": 3, \"and\": 5, \"between\": 4, \"differences\": 1, \"differ\": 1, \"write\": 12, \"use\": 3, \"have\": 1, \"implement\": 8, \"statement\": 9, \"defined\": 3, \"used\": 2, \"apply\": 1, \"implemented\": 3, \"works\": 2, \"created\": 2, \"usage\": 1, \"provide\": 7, \"practical\": 2, \"could\": 5, \"clear\": 1, \"sum\": 26, \"see\": 7, \"want\": 7, \"performs\": 5, \"that\": 18, \"addition\": 5, \"inside\": 1, \"line\": 8, \"numbers\": 1, \"read\": 4, \"receives\": 2, \"data\": 1, \"values\": 3, \"reading\": 1, \"lines\": 2, \"calls\": 5, \"shows\": 1, \"result\": 6, \"shown\": 1, \"prints\": 2, \"display\": 1, \"print\": 1, \"secret\": 10, \"number\": 10, \"conditional\": 1, \"constants\": 4, \"defines\": 1, \"creates\": 1, \"person\": 5}", "index_docs": "{\"297\": 1, \"298\": 1, \"299\": 1, \"300\": 1, \"249\": 2, \"301\": 1, \"202\": 4, \"171\": 6, \"250\": 2, \"20\": 96, \"302\": 1, \"61\": 30, \"29\": 70, \"251\": 2, \"66\": 26, \"303\": 1, \"10\": 187, \"304\": 1, \"252\": 2, \"253\": 2, \"4\": 240, \"101\": 14, \"53\": 39, \"16\": 117, \"30\": 67, \"2\": 408, \"305\": 1, \"254\": 2, \"222\": 3, \"306\": 1, \"307\": 1, \"308\": 1, \"309\": 1, \"9\": 169, \"80\": 22, \"64\": 28, \"24\": 84, \"12\": 177, \"8\": 173, \"172\": 6, \"27\": 75, \"58\": 32, \"129\": 11, \"38\": 50, \"67\": 26, \"130\": 11, \"34\": 56, \"109\": 13, \"50\": 42, \"44\": 45, \"95\": 16, \"5\": 217, \"96\": 16, \"97\": 16, \"98\": 16, \"182\": 5, \"183\": 5, \"11\": 185, \"184\": 5, \"185\": 5, \"255\": 2, \"144\": 9, \"311\": 1, \"310\": 1, \"257\": 2, \"258\": 2, \"259\": 2, \"186\": 5, \"256\": 2, \"45\": 45, \"312\": 1, \"260\": 2, \"223\": 3, \"31\": 63, \"261\": 2, \"313\": 1, \"262\": 2, \"3\": 450, \"263\": 2, \"314\": 1, \"315\": 1, \"152\": 8, \"117\": 12, \"224\": 3, \"316\": 1, \"317\": 1, \"264\": 2, \"318\": 1, \"319\": 1, \"320\": 1, \"321\": 1, \"153\": 8, \"322\": 1, \"145\": 9, \"323\": 1, \"110\": 13, \"111\": 13, \"102\": 14, \"118\": 12, \"119\": 12, \"28\": 75, \"15\": 114, \"146\": 9, \"324\": 1, \"56\": 37, \"325\": 1, \"103\": 14, \"26\": 79, \"104\": 14, \"69\": 25, \"35\": 54, \"21\": 88, \"42\": 47, \"14\": 145, \"173\": 6, \"40\": 49, \"39\": 49, \"7\": 239, \"203\": 4, \"326\": 1, \"327\": 1, \"154\": 8, \"328\": 1, \"329\": 1, \"265\": 2, \"266\": 2, \"267\": 2, \"268\": 2, \"225\": 3, \"227\": 3, \"226\": 3, \"330\": 1, \"48\": 43, \"331\": 1, \"174\": 6, \"137\": 10, \"204\": 4, \"332\": 1, \"135\": 10, \"228\": 3, \"167\": 7, \"136\": 10, \"333\": 1, \"76\": 23, \"334\": 1, \"335\": 1, \"155\": 8, \"156\": 8, \"337\": 1, \"336\": 1, \"131\": 11, \"59\": 31, \"229\": 3, \"338\": 1, \"339\": 1, \"157\": 8, \"340\": 1, \"36\": 53, \"205\": 4, \"269\": 2, \"341\": 1, \"187\": 5, \"65\": 28, \"342\": 1, \"343\": 1, \"188\": 5, \"344\": 1, \"89\": 17, \"270\": 2, \"175\": 6, \"51\": 41, \"345\": 1, \"346\": 1, \"60\": 26, \"77\": 23, \"71\": 24, \"347\": 1, \"105\": 14, \"348\": 1, \"206\": 4, \"271\": 2, \"350\": 1, \"349\": 1, \"351\": 1, \"230\": 3, \"81\": 22, \"352\": 1, \"272\": 2, \"231\": 3, \"147\": 9, \"176\": 6, \"232\": 3, \"233\": 3, \"138\": 10, \"139\": 10, \"353\": 1, \"273\": 2, \"274\": 2, \"207\": 4, \"158\": 8, \"72\": 24, \"112\": 13, \"159\": 8, \"208\": 4, \"209\": 4, \"234\": 3, \"189\": 5, \"190\": 5, \"86\": 18, \"354\": 1, \"87\": 18, \"140\": 10, \"210\": 4, \"235\": 3, \"177\": 6, \"160\": 8, \"211\": 4, \"275\": 2, \"73\": 24, \"113\": 13, \"236\": 3, \"120\": 12, \"90\": 17, \"191\": 5, \"161\": 8, \"91\": 17, \"82\": 22, \"237\": 3, \"212\": 4, \"106\": 14, \"179\": 6, \"178\": 6, \"121\": 12, \"122\": 12, \"141\": 10, \"276\": 2, \"277\": 2, \"162\": 8, \"278\": 2, \"63\": 29, \"62\": 30, \"355\": 1, \"356\": 1, \"85\": 20, \"357\": 1, \"358\": 1, \"359\": 1, \"360\": 1, \"213\": 4, \"163\": 8, \"214\": 4, \"361\": 1, \"362\": 1, \"238\": 3, \"363\": 1, \"364\": 1, \"365\": 1, \"279\": 2, \"123\": 12, \"33\": 59, \"41\": 48, \"22\": 94, \"55\": 38, \"52\": 41, \"280\": 2, \"74\": 24, \"366\": 1, \"70\": 25, \"13\": 172, \"23\": 85, \"367\": 1, \"92\": 17, \"43\": 46, \"281\": 2, \"54\": 39, \"368\": 1, \"369\": 1, \"370\": 1, \"371\": 1, \"372\": 1, \"373\": 1, \"83\": 21, \"75\": 24, \"32\": 63, \"18\": 98, \"180\": 6, \"132\": 11, \"49\": 43, \"133\": 11, \"192\": 5, \"84\": 21, \"93\": 17, \"99\": 16, \"100\": 16, \"193\": 5, \"374\": 1, \"215\": 4, \"375\": 1, \"148\": 9, \"376\": 1, \"216\": 4, \"377\": 1, \"19\": 99, \"282\": 2, \"283\": 2, \"17\": 51, \"378\": 1, \"46\": 45, \"217\": 4, \"284\": 2, \"379\": 1, \"285\": 2, \"37\": 49, \"239\": 3, \"286\": 2, \"240\": 3, \"6\": 236, \"164\": 8, \"124\": 12, \"218\": 4, \"194\": 5, \"380\": 1, \"381\": 1, \"287\": 2, \"382\": 1, \"78\": 23, \"383\": 1, \"114\": 13, \"115\": 13, \"116\": 13, \"25\": 81, \"134\": 11, \"149\": 9, \"125\": 12, \"384\": 1, \"107\": 14, \"195\": 5, \"126\": 12, \"127\": 12, \"79\": 23, \"108\": 14, \"94\": 17, \"57\": 34, \"47\": 45, \"288\": 2, \"289\": 2, \"150\": 9, \"241\": 3, \"385\": 1, \"386\": 1, \"243\": 3, \"242\": 3, \"244\": 3, \"196\": 5, \"219\": 4, \"387\": 1, \"388\": 1, \"128\": 12, \"245\": 3, \"389\": 1, \"165\": 8, \"151\": 9, \"246\": 3, \"290\": 2, \"390\": 1, \"247\": 3, \"291\": 2, \"292\": 2, \"391\": 1, \"168\": 7, \"293\": 2, \"197\": 5, \"392\": 1, \"68\": 26, \"170\": 7, \"169\": 7, \"198\": 5, \"88\": 18, \"199\": 5, \"393\": 1, \"166\": 8, \"394\": 1, \"220\": 4, \"294\": 2, \"395\": 1, \"248\": 3, \"396\": 1, \"295\": 2, \"200\": 5, \"397\": 1, \"181\": 6, \"398\": 1, \"296\": 2, \"399\": 1, \"400\": 1, \"142\": 10, \"143\": 10, \"401\": 1, \"221\": 4, \"402\": 1, \"403\": 1, \"201\": 5}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"en\", \"3\": \"python\", \"4\": \"de\", \"5\": \"el\", \"6\": \"in\", \"7\": \"javascript\", \"8\": \"un\", \"9\": \"la\", \"10\": \"como\", \"11\": \"a\", \"12\": \"algoritmo\", \"13\": \"how\", \"14\": \"codigo\", \"15\": \"del\", \"16\": \"me\", \"17\": \"the\", \"18\": \"an\", \"19\": \"i\", \"20\": \"que\", \"21\": \"quicksort\", \"22\": \"do\", \"23\": \"of\", \"24\": \"define\", \"25\": \"example\", \"26\": \"ordenamiento\", \"27\": \"una\", \"28\": \"ejemplo\", \"29\": \"funcion\", \"30\": \"puedes\", \"31\": \"para\", \"32\": \"algorithm\", \"33\": \"you\", \"34\": \"if\", \"35\": \"burbuja\", \"36\": \"muestrame\", \"37\": \"to\", \"38\": \"for\", \"39\": \"por\", \"40\": \"seleccion\", \"41\": \"what\", \"42\": \"ensename\", \"43\": \"explain\", \"44\": \"clase\", \"45\": \"dame\", \"46\": \"give\", \"47\": \"show\", \"48\": \"se\", \"49\": \"loop\", \"50\": \"while\", \"51\": \"ensenarme\", \"52\": \"function\", \"53\": \"explicame\", \"54\": \"can\", \"55\": \"is\", \"56\": \"con\", \"57\": \"code\", \"58\": \"variable\", \"59\": \"podrias\", \"60\": \"suma\", \"61\": \"es\", \"62\": \"explicitos\", \"63\": \"indices\", \"64\": \"funciona\", \"65\": \"mostrarme\", \"66\": \"describeme\", \"67\": \"ciclo\", \"68\": \"sum\", \"69\": \"arboles\", \"70\": \"work\", \"71\": \"ver\", \"72\": \"constructor\", \"73\": \"return\", \"74\": \"describe\", \"75\": \"does\", \"76\": \"las\", \"77\": \"quiero\", \"78\": \"create\", \"79\": \"sort\", \"80\": \"programacion\", \"81\": \"lineas\", \"82\": \"elementos\", \"83\": \"programming\", \"84\": \"class\", \"85\": \"particion\", \"86\": \"basico\", \"87\": \"pivote\", \"88\": \"that\", \"89\": \"proporciona\", \"90\": \"lista\", \"91\": \"comparar\", \"92\": \"tell\", \"93\": \"object\", \"94\": \"with\", \"95\": \"objeto\", \"96\": \"polimorfismo\", \"97\": \"herencia\", \"98\": \"encapsulamiento\", \"99\": \"polymorphism\", \"100\": \"encapsulation\", \"101\": \"dime\", \"102\": \"creo\", \"103\": \"busqueda\", \"104\": \"grafos\", \"105\": \"linea\", \"106\": \"intercambiar\", \"107\": \"search\", \"108\": \"bubble\", \"109\": \"bucle\", \"110\": \"defino\", \"111\": \"declaro\", \"112\": \"persona\", \"113\": \"optimizado\", \"114\": \"declare\", \"115\": \"assign\", \"116\": \"initialize\", \"117\": \"programa\", \"118\": \"asigno\", \"119\": \"inicializo\", \"120\": \"iteracion\", \"121\": \"elemento\", \"122\": \"minimo\", \"123\": \"are\", \"124\": \"program\", \"125\": \"teach\", \"126\": \"graph\", \"127\": \"tree\", \"128\": \"write\", \"129\": \"constante\", \"130\": \"condicion\", \"131\": \"darme\", \"132\": \"constant\", \"133\": \"condition\", \"134\": \"inheritance\", \"135\": \"var\", \"136\": \"let\", \"137\": \"const\", \"138\": \"numero\", \"139\": \"secreto\", \"140\": \"asigna\", \"141\": \"sublista\", \"142\": \"secret\", \"143\": \"number\", \"144\": \"lenguajes\", \"145\": \"puedo\", \"146\": \"algoritmos\", \"147\": \"muestra\", \"148\": \"languages\", \"149\": \"algorithms\", \"150\": \"selection\", \"151\": \"statement\", \"152\": \"mi\", \"153\": \"crear\", \"154\": \"explicarme\", \"155\": \"escribir\", \"156\": \"escribe\", \"157\": \"implementar\", \"158\": \"dataclass\", \"159\": \"metodo\", \"160\": \"arreglo\", \"161\": \"recorrer\", \"162\": \"primero\", \"163\": \"nodo\", \"164\": \"my\", \"165\": \"implement\", \"166\": \"line\", \"167\": \"y\", \"168\": \"provide\", \"169\": \"want\", \"170\": \"see\", \"171\": \"eres\", \"172\": \"lenguaje\", \"173\": \"ejemplifica\", \"174\": \"crea\", \"175\": \"realiza\", \"176\": \"resultado\", \"177\": \"sublistas\", \"178\": \"encontrar\", \"179\": \"indice\", \"180\": \"language\", \"181\": \"result\", \"182\": \"abstraccion\", \"183\": \"orientado\", \"184\": \"objetos\", \"185\": \"poo\", \"186\": \"los\", \"187\": \"implementa\", \"188\": \"hace\", \"189\": \"animal\", \"190\": \"perro\", \"191\": \"recorrido\", \"192\": \"cycle\", \"193\": \"abstraction\", \"194\": \"execute\", \"195\": \"sorting\", \"196\": \"and\", \"197\": \"could\", \"198\": \"performs\", \"199\": \"addition\", \"200\": \"calls\", \"201\": \"person\", \"202\": \"tu\", \"203\": \"definicion\", \"204\": \"entre\", \"205\": \"definir\", \"206\": \"lectura\", \"207\": \"constantes\", \"208\": \"saludar\", \"209\": \"instancia\", \"210\": \"separan\", \"211\": \"divide\", \"212\": \"comparacion\", \"213\": \"intercambia\", \"214\": \"inorden\", \"215\": \"oop\", \"216\": \"should\", \"217\": \"know\", \"218\": \"run\", \"219\": \"between\", \"220\": \"read\", \"221\": \"constants\", \"222\": \"te\", \"223\": \"programar\", \"224\": \"ejecuto\", \"225\": \"pasos\", \"226\": \"debo\", \"227\": \"seguir\", \"228\": \"diferencia\", \"229\": \"usar\", \"230\": \"valores\", \"231\": \"llamada\", \"232\": \"imprime\", \"233\": \"mostrar\", \"234\": \"nueva\", \"235\": \"dos\", \"236\": \"tres\", \"237\": \"compara\", \"238\": \"good\", \"239\": \"install\", \"240\": \"download\", \"241\": \"definition\", \"242\": \"steps\", \"243\": \"follow\", \"244\": \"difference\", \"245\": \"use\", \"246\": \"defined\", \"247\": \"implemented\", \"248\": \"values\", \"249\": \"buenas\", \"250\": \"quien\", \"251\": \"cual\", \"252\": \"tipo\", \"253\": \"bot\", \"254\": \"estas\", \"255\": \"existen\", \"256\": \"cuales\", \"257\": \"son\", \"258\": \"mas\", \"259\": \"populares\", \"260\": \"sabes\", \"261\": \"conoces\", \"262\": \"entiendes\", \"263\": \"instalo\", \"264\": \"app\", \"265\": \"decirme\", \"266\": \"descargar\", \"267\": \"correr\", \"268\": \"ejecutar\", \"269\": \"utiliza\", \"270\": \"practico\", \"271\": \"recibe\", \"272\": \"llama\", \"273\": \"usado\", \"274\": \"condicional\", \"275\": \"partes\", \"276\": \"restante\", \"277\": \"menor\", \"278\": \"cambiar\", \"279\": \"who\", \"280\": \"your\", \"281\": \"help\", \"282\": \"most\", \"283\": \"popular\", \"284\": \"which\", \"285\": \"understand\", \"286\": \"get\", \"287\": \"start\", \"288\": \"trees\", \"289\": \"graphs\", \"290\": \"used\", \"291\": \"works\", \"292\": \"created\", \"293\": \"practical\", \"294\": \"receives\", \"295\": \"lines\", \"296\": \"prints\", \"297\": \"hola\", \"298\": \"buenos\", \"299\": \"dias\", \"300\": \"tardes\", \"301\": \"noches\", \"302\": \"haces\", \"303\": \"funcionalidad\", \"304\": \"funcionas\", \"305\": \"ayudar\", \"306\": \"encuentras\", \"307\": \"sientes\", \"308\": \"va\", \"309\": \"tal\", \"310\": \"deberia\", \"311\": \"aprender\", \"312\": \"listado\", \"313\": \"soportas\", \"314\": \"obtengo\", \"315\": \"descargo\", \"316\": \"corro\", \"317\": \"pruebo\", \"318\": \"aplicacion\", \"319\": \"empiezo\", \"320\": \"inicio\", \"321\": \"ayudame\", \"322\": \"empezar\", \"323\": \"iniciar\", \"324\": \"ensenar\", \"325\": \"manejas\", \"326\": \"cuentame\", \"327\": \"acerca\", \"328\": \"instalar\", \"329\": \"obtener\", \"330\": \"ejecuta\", \"331\": \"inicializa\", \"332\": \"hay\", \"333\": \"diferencias\", \"334\": \"diferencian\", \"335\": \"explicar\", \"336\": \"\\u00bfpuedes\", \"337\": \"ense\\u00f1arme\", \"338\": \"tienes\", \"339\": \"algun\", \"340\": \"sentencia\", \"341\": \"aplicar\", \"342\": \"asignar\", \"343\": \"arbol\", \"344\": \"uso\", \"345\": \"implementan\", \"346\": \"claro\", \"347\": \"dentro\", \"348\": \"numeros\", \"349\": \"realizar\", \"350\": \"datos\", \"351\": \"leen\", \"352\": \"hacen\", \"353\": \"mostarme\", \"354\": \"quicksor\", \"355\": \"logica\", \"356\": \"inidices\", \"357\": \"proporcionarme\", \"358\": \"selecciona\", \"359\": \"elige\", \"360\": \"proporcionar\", \"361\": \"hello\", \"362\": \"morning\", \"363\": \"afternoon\", \"364\": \"evening\", \"365\": \"hi\", \"366\": \"functionality\", \"367\": \"kind\", \"368\": \"doing\", \"369\": \"feel\", \"370\": \"how's\", \"371\": \"it\", \"372\": \"going\", \"373\": \"today\", \"374\": \"oriented\", \"375\": \"exist\", \"376\": \"there\", \"377\": \"learn\", \"378\": \"list\", \"379\": \"support\", \"380\": \"test\", \"381\": \"application\", \"382\": \"initiate\", \"383\": \"begin\", \"384\": \"handle\", \"385\": \"about\", \"386\": \"type\", \"387\": \"differences\", \"388\": \"differ\", \"389\": \"have\", \"390\": \"apply\", \"391\": \"usage\", \"392\": \"clear\", \"393\": \"inside\", \"394\": \"numbers\", \"395\": \"data\", \"396\": \"reading\", \"397\": \"shows\", \"398\": \"shown\", \"399\": \"display\", \"400\": \"print\", \"401\": \"conditional\", \"402\": \"defines\", \"403\": \"creates\"}", "word_index": "{\"<OOV>\": 1, \"en\": 2, \"python\": 3, \"de\": 4, \"el\": 5, \"in\": 6, \"javascript\": 7, \"un\": 8, \"la\": 9, \"como\": 10, \"a\": 11, \"algoritmo\": 12, \"how\": 13, \"codigo\": 14, \"del\": 15, \"me\": 16, \"the\": 17, \"an\": 18, \"i\": 19, \"que\": 20, \"quicksort\": 21, \"do\": 22, \"of\": 23, \"define\": 24, \"example\": 25, \"ordenamiento\": 26, \"una\": 27, \"ejemplo\": 28, \"funcion\": 29, \"puedes\": 30, \"para\": 31, \"algorithm\": 32, \"you\": 33, \"if\": 34, \"burbuja\": 35, \"muestrame\": 36, \"to\": 37, \"for\": 38, \"por\": 39, \"seleccion\": 40, \"what\": 41, \"ensename\": 42, \"explain\": 43, \"clase\": 44, \"dame\": 45, \"give\": 46, \"show\": 47, \"se\": 48, \"loop\": 49, \"while\": 50, \"ensenarme\": 51, \"function\": 52, \"explicame\": 53, \"can\": 54, \"is\": 55, \"con\": 56, \"code\": 57, \"variable\": 58, \"podrias\": 59, \"suma\": 60, \"es\": 61, \"explicitos\": 62, \"indices\": 63, \"funciona\": 64, \"mostrarme\": 65, \"describeme\": 66, \"ciclo\": 67, \"sum\": 68, \"arboles\": 69, \"work\": 70, \"ver\": 71, \"constructor\": 72, \"return\": 73, \"describe\": 74, \"does\": 75, \"las\": 76, \"quiero\": 77, \"create\": 78, \"sort\": 79, \"programacion\": 80, \"lineas\": 81, \"elementos\": 82, \"programming\": 83, \"class\": 84, \"particion\": 85, \"basico\": 86, \"pivote\": 87, \"that\": 88, \"proporciona\": 89, \"lista\": 90, \"comparar\": 91, \"tell\": 92, \"object\": 93, \"with\": 94, \"objeto\": 95, \"polimorfismo\": 96, \"herencia\": 97, \"encapsulamiento\": 98, \"polymorphism\": 99, \"encapsulation\": 100, \"dime\": 101, \"creo\": 102, \"busqueda\": 103, \"grafos\": 104, \"linea\": 105, \"intercambiar\": 106, \"search\": 107, \"bubble\": 108, \"bucle\": 109, \"defino\": 110, \"declaro\": 111, \"persona\": 112, \"optimizado\": 113, \"declare\": 114, \"assign\": 115, \"initialize\": 116, \"programa\": 117, \"asigno\": 118, \"inicializo\": 119, \"iteracion\": 120, \"elemento\": 121, \"minimo\": 122, \"are\": 123, \"program\": 124, \"teach\": 125, \"graph\": 126, \"tree\": 127, \"write\": 128, \"constante\": 129, \"condicion\": 130, \"darme\": 131, \"constant\": 132, \"condition\": 133, \"inheritance\": 134, \"var\": 135, \"let\": 136, \"const\": 137, \"numero\": 138, \"secreto\": 139, \"asigna\": 140, \"sublista\": 141, \"secret\": 142, \"number\": 143, \"lenguajes\": 144, \"puedo\": 145, \"algoritmos\": 146, \"muestra\": 147, \"languages\": 148, \"algorithms\": 149, \"selection\": 150, \"statement\": 151, \"mi\": 152, \"crear\": 153, \"explicarme\": 154, \"escribir\": 155, \"escribe\": 156, \"implementar\": 157, \"dataclass\": 158, \"metodo\": 159, \"arreglo\": 160, \"recorrer\": 161, \"primero\": 162, \"nodo\": 163, \"my\": 164, \"implement\": 165, \"line\": 166, \"y\": 167, \"provide\": 168, \"want\": 169, \"see\": 170, \"eres\": 171, \"lenguaje\": 172, \"ejemplifica\": 173, \"crea\": 174, \"realiza\": 175, \"resultado\": 176, \"sublistas\": 177, \"encontrar\": 178, \"indice\": 179, \"language\": 180, \"result\": 181, \"abstraccion\": 182, \"orientado\": 183, \"objetos\": 184, \"poo\": 185, \"los\": 186, \"implementa\": 187, \"hace\": 188, \"animal\": 189, \"perro\": 190, \"recorrido\": 191, \"cycle\": 192, \"abstraction\": 193, \"execute\": 194, \"sorting\": 195, \"and\": 196, \"could\": 197, \"performs\": 198, \"addition\": 199, \"calls\": 200, \"person\": 201, \"tu\": 202, \"definicion\": 203, \"entre\": 204, \"definir\": 205, \"lectura\": 206, \"constantes\": 207, \"saludar\": 208, \"instancia\": 209, \"separan\": 210, \"divide\": 211, \"comparacion\": 212, \"intercambia\": 213, \"inorden\": 214, \"oop\": 215, \"should\": 216, \"know\": 217, \"run\": 218, \"between\": 219, \"read\": 220, \"constants\": 221, \"te\": 222, \"programar\": 223, \"ejecuto\": 224, \"pasos\": 225, \"debo\": 226, \"seguir\": 227, \"diferencia\": 228, \"usar\": 229, \"valores\": 230, \"llamada\": 231, \"imprime\": 232, \"mostrar\": 233, \"nueva\": 234, \"dos\": 235, \"tres\": 236, \"compara\": 237, \"good\": 238, \"install\": 239, \"download\": 240, \"definition\": 241, \"steps\": 242, \"follow\": 243, \"difference\": 244, \"use\": 245, \"defined\": 246, \"implemented\": 247, \"values\": 248, \"buenas\": 249, \"quien\": 250, \"cual\": 251, \"tipo\": 252, \"bot\": 253, \"estas\": 254, \"existen\": 255, \"cuales\": 256, \"son\": 257, \"mas\": 258, \"populares\": 259, \"sabes\": 260, \"conoces\": 261, \"entiendes\": 262, \"instalo\": 263, \"app\": 264, \"decirme\": 265, \"descargar\": 266, \"correr\": 267, \"ejecutar\": 268, \"utiliza\": 269, \"practico\": 270, \"recibe\": 271, \"llama\": 272, \"usado\": 273, \"condicional\": 274, \"partes\": 275, \"restante\": 276, \"menor\": 277, \"cambiar\": 278, \"who\": 279, \"your\": 280, \"help\": 281, \"most\": 282, \"popular\": 283, \"which\": 284, \"understand\": 285, \"get\": 286, \"start\": 287, \"trees\": 288, \"graphs\": 289, \"used\": 290, \"works\": 291, \"created\": 292, \"practical\": 293, \"receives\": 294, \"lines\": 295, \"prints\": 296, \"hola\": 297, \"buenos\": 298, \"dias\": 299, \"tardes\": 300, \"noches\": 301, \"haces\": 302, \"funcionalidad\": 303, \"funcionas\": 304, \"ayudar\": 305, \"encuentras\": 306, \"sientes\": 307, \"va\": 308, \"tal\": 309, \"deberia\": 310, \"aprender\": 311, \"listado\": 312, \"soportas\": 313, \"obtengo\": 314, \"descargo\": 315, \"corro\": 316, \"pruebo\": 317, \"aplicacion\": 318, \"empiezo\": 319, \"inicio\": 320, \"ayudame\": 321, \"empezar\": 322, \"iniciar\": 323, \"ensenar\": 324, \"manejas\": 325, \"cuentame\": 326, \"acerca\": 327, \"instalar\": 328, \"obtener\": 329, \"ejecuta\": 330, \"inicializa\": 331, \"hay\": 332, \"diferencias\": 333, \"diferencian\": 334, \"explicar\": 335, \"\\u00bfpuedes\": 336, \"ense\\u00f1arme\": 337, \"tienes\": 338, \"algun\": 339, \"sentencia\": 340, \"aplicar\": 341, \"asignar\": 342, \"arbol\": 343, \"uso\": 344, \"implementan\": 345, \"claro\": 346, \"dentro\": 347, \"numeros\": 348, \"realizar\": 349, \"datos\": 350, \"leen\": 351, \"hacen\": 352, \"mostarme\": 353, \"quicksor\": 354, \"logica\": 355, \"inidices\": 356, \"proporcionarme\": 357, \"selecciona\": 358, \"elige\": 359, \"proporcionar\": 360, \"hello\": 361, \"morning\": 362, \"afternoon\": 363, \"evening\": 364, \"hi\": 365, \"functionality\": 366, \"kind\": 367, \"doing\": 368, \"feel\": 369, \"how's\": 370, \"it\": 371, \"going\": 372, \"today\": 373, \"oriented\": 374, \"exist\": 375, \"there\": 376, \"learn\": 377, \"list\": 378, \"support\": 379, \"test\": 380, \"application\": 381, \"initiate\": 382, \"begin\": 383, \"handle\": 384, \"about\": 385, \"type\": 386, \"differences\": 387, \"differ\": 388, \"have\": 389, \"apply\": 390, \"usage\": 391, \"clear\": 392, \"inside\": 393, \"numbers\": 394, \"data\": 395, \"reading\": 396, \"shows\": 397, \"shown\": 398, \"display\": 399, \"print\": 400, \"conditional\": 401, \"defines\": 402, \"creates\": 403}"}}