{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 584, "word_counts": "{\"hola\": 1, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"quien\": 2, \"eres\": 6, \"tu\": 4, \"que\": 96, \"haces\": 1, \"cual\": 2, \"es\": 30, \"funcion\": 70, \"describeme\": 26, \"funcionalidad\": 1, \"como\": 187, \"funcionas\": 1, \"tipo\": 2, \"de\": 315, \"bot\": 1, \"dime\": 14, \"explicame\": 39, \"en\": 481, \"me\": 2, \"puedes\": 67, \"ayudar\": 1, \"estas\": 2, \"te\": 3, \"encuentras\": 1, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"la\": 192, \"programacion\": 22, \"funciona\": 28, \"define\": 39, \"un\": 207, \"algoritmo\": 177, \"lenguaje\": 6, \"una\": 75, \"variable\": 16, \"constante\": 11, \"ciclo\": 26, \"for\": 20, \"condicion\": 11, \"if\": 35, \"bucle\": 13, \"while\": 21, \"clase\": 45, \"objeto\": 16, \"el\": 308, \"polimorfismo\": 16, \"herencia\": 16, \"encapsulamiento\": 16, \"abstraccion\": 5, \"orientado\": 5, \"a\": 11, \"objetos\": 5, \"poo\": 5, \"lenguajes\": 9, \"existen\": 2, \"deberia\": 1, \"aprender\": 1, \"cuales\": 2, \"son\": 2, \"los\": 5, \"mas\": 2, \"populares\": 2, \"dame\": 45, \"listado\": 1, \"sabes\": 2, \"conoces\": 2, \"para\": 63, \"programar\": 3, \"soportas\": 1, \"entiendes\": 2, \"python\": 291, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"ejecuto\": 3, \"mi\": 8, \"programa\": 12, \"corro\": 1, \"pruebo\": 1, \"app\": 1, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"ayudame\": 1, \"crear\": 8, \"puedo\": 9, \"empezar\": 1, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 14, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 75, \"del\": 131, \"algoritmos\": 9, \"con\": 37, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 14, \"ordenamiento\": 79, \"grafos\": 14, \"arboles\": 25, \"burbuja\": 54, \"quicksort\": 82, \"ensename\": 47, \"codigo\": 145, \"ejemplifica\": 6, \"por\": 49, \"seleccion\": 49, \"javascript\": 139, \"definicion\": 4, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 8, \"instalar\": 1, \"decirme\": 2, \"obtener\": 1, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"pasos\": 3, \"debo\": 3, \"seguir\": 3, \"se\": 43, \"ejecuta\": 1, \"inicializa\": 1, \"crea\": 6, \"diferencia\": 3, \"hay\": 1, \"entre\": 4, \"var\": 5, \"let\": 5, \"y\": 7, \"const\": 5, \"las\": 23, \"diferencias\": 1, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 8, \"escribe\": 8, \"\\u00bfpuedes\": 1, \"ense\\u00f1arme\": 1, \"podrias\": 31, \"darme\": 11, \"usar\": 3, \"tienes\": 1, \"algun\": 1, \"implementar\": 8, \"sentencia\": 1, \"muestrame\": 53, \"definir\": 4, \"utiliza\": 2, \"aplicar\": 1, \"implementa\": 5, \"mostrarme\": 28, \"asignar\": 1, \"arbol\": 1, \"hace\": 5, \"proporciona\": 17, \"uso\": 1, \"practico\": 2, \"realiza\": 6, \"ensenarme\": 41, \"implementan\": 1, \"claro\": 1, \"suma\": 31, \"quiero\": 23, \"ver\": 24, \"dentro\": 1, \"linea\": 14, \"lectura\": 4, \"numeros\": 1, \"recibe\": 2, \"realizar\": 1, \"datos\": 1, \"leen\": 1, \"valores\": 3, \"lineas\": 22, \"hacen\": 1, \"llama\": 2, \"llamada\": 3, \"muestra\": 9, \"resultado\": 6, \"imprime\": 3, \"mostrar\": 3, \"mostarme\": 1, \"numero\": 10, \"secreto\": 10, \"usado\": 2, \"condicional\": 2, \"dataclass\": 4, \"constantes\": 4, \"constructor\": 19, \"persona\": 13, \"metodo\": 8, \"saludar\": 4, \"nueva\": 3, \"instancia\": 4, \"animal\": 5, \"perro\": 5, \"basico\": 18, \"quicksor\": 1, \"asigna\": 10, \"pivote\": 18, \"separan\": 4, \"arreglo\": 8, \"dos\": 3, \"sublistas\": 6, \"divide\": 4, \"partes\": 2, \"return\": 24, \"optimizado\": 13, \"tres\": 3, \"iteracion\": 12, \"recorrido\": 5, \"lista\": 17, \"recorrer\": 8, \"comparar\": 17, \"elementos\": 22, \"compara\": 3, \"comparacion\": 4, \"intercambiar\": 14, \"encontrar\": 6, \"indice\": 6, \"elemento\": 12, \"minimo\": 12, \"sublista\": 10, \"restante\": 2, \"menor\": 2, \"primero\": 8, \"cambiar\": 2, \"indices\": 29, \"explicitos\": 30, \"logica\": 1, \"inidices\": 1, \"particion\": 20, \"proporcionarme\": 1, \"selecciona\": 1, \"elige\": 1, \"proporcionar\": 1, \"intercambia\": 4, \"nodo\": 8, \"inorden\": 4}", "word_docs": "{\"hola\": 1, \"dias\": 1, \"buenos\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"tu\": 4, \"quien\": 2, \"eres\": 6, \"que\": 96, \"haces\": 1, \"cual\": 2, \"es\": 30, \"funcion\": 70, \"describeme\": 26, \"funcionalidad\": 1, \"funcionas\": 1, \"como\": 187, \"bot\": 1, \"de\": 240, \"tipo\": 2, \"dime\": 14, \"explicame\": 39, \"ayudar\": 1, \"puedes\": 67, \"en\": 408, \"me\": 2, \"estas\": 2, \"encuentras\": 1, \"te\": 3, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"programacion\": 22, \"la\": 169, \"funciona\": 28, \"define\": 39, \"algoritmo\": 177, \"un\": 173, \"lenguaje\": 6, \"variable\": 16, \"una\": 75, \"constante\": 11, \"ciclo\": 26, \"for\": 20, \"condicion\": 11, \"if\": 35, \"bucle\": 13, \"while\": 21, \"clase\": 45, \"objeto\": 16, \"el\": 217, \"polimorfismo\": 16, \"herencia\": 16, \"encapsulamiento\": 16, \"abstraccion\": 5, \"a\": 11, \"objetos\": 5, \"orientado\": 5, \"poo\": 5, \"lenguajes\": 9, \"existen\": 2, \"aprender\": 1, \"deberia\": 1, \"son\": 2, \"populares\": 2, \"mas\": 2, \"cuales\": 2, \"los\": 5, \"dame\": 45, \"listado\": 1, \"sabes\": 2, \"programar\": 3, \"conoces\": 2, \"para\": 63, \"soportas\": 1, \"entiendes\": 2, \"python\": 291, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"ejecuto\": 3, \"programa\": 12, \"mi\": 8, \"corro\": 1, \"pruebo\": 1, \"app\": 1, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"crear\": 8, \"ayudame\": 1, \"puedo\": 9, \"empezar\": 1, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 14, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 75, \"del\": 114, \"algoritmos\": 9, \"con\": 37, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 14, \"ordenamiento\": 79, \"grafos\": 14, \"arboles\": 25, \"burbuja\": 54, \"quicksort\": 74, \"ensename\": 47, \"codigo\": 145, \"ejemplifica\": 6, \"seleccion\": 49, \"por\": 49, \"javascript\": 139, \"definicion\": 4, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 8, \"instalar\": 1, \"decirme\": 2, \"obtener\": 1, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"debo\": 3, \"seguir\": 3, \"pasos\": 3, \"se\": 43, \"ejecuta\": 1, \"inicializa\": 1, \"crea\": 6, \"var\": 5, \"let\": 5, \"const\": 5, \"y\": 7, \"hay\": 1, \"entre\": 4, \"diferencia\": 3, \"diferencias\": 1, \"las\": 23, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 8, \"escribe\": 8, \"\\u00bfpuedes\": 1, \"ense\\u00f1arme\": 1, \"darme\": 11, \"podrias\": 31, \"usar\": 3, \"tienes\": 1, \"algun\": 1, \"implementar\": 8, \"sentencia\": 1, \"muestrame\": 53, \"definir\": 4, \"utiliza\": 2, \"aplicar\": 1, \"implementa\": 5, \"mostrarme\": 28, \"asignar\": 1, \"arbol\": 1, \"hace\": 5, \"proporciona\": 17, \"uso\": 1, \"practico\": 2, \"realiza\": 6, \"ensenarme\": 41, \"implementan\": 1, \"claro\": 1, \"suma\": 26, \"quiero\": 23, \"ver\": 24, \"dentro\": 1, \"linea\": 14, \"numeros\": 1, \"lectura\": 4, \"recibe\": 2, \"realizar\": 1, \"datos\": 1, \"leen\": 1, \"valores\": 3, \"lineas\": 22, \"hacen\": 1, \"llama\": 2, \"llamada\": 3, \"muestra\": 9, \"resultado\": 6, \"imprime\": 3, \"mostrar\": 3, \"mostarme\": 1, \"numero\": 10, \"secreto\": 10, \"usado\": 2, \"condicional\": 2, \"constantes\": 4, \"dataclass\": 4, \"persona\": 13, \"constructor\": 19, \"saludar\": 4, \"metodo\": 8, \"instancia\": 4, \"nueva\": 3, \"animal\": 5, \"perro\": 5, \"basico\": 18, \"quicksor\": 1, \"asigna\": 10, \"pivote\": 18, \"arreglo\": 8, \"sublistas\": 6, \"dos\": 3, \"separan\": 4, \"divide\": 4, \"partes\": 2, \"return\": 24, \"optimizado\": 13, \"tres\": 3, \"iteracion\": 12, \"recorrido\": 5, \"lista\": 17, \"recorrer\": 8, \"elementos\": 22, \"comparar\": 17, \"compara\": 3, \"comparacion\": 4, \"intercambiar\": 14, \"elemento\": 12, \"encontrar\": 6, \"indice\": 6, \"minimo\": 12, \"sublista\": 10, \"restante\": 2, \"menor\": 2, \"primero\": 8, \"cambiar\": 2, \"explicitos\": 30, \"indices\": 29, \"logica\": 1, \"inidices\": 1, \"particion\": 20, \"proporcionarme\": 1, \"selecciona\": 1, \"elige\": 1, \"proporcionar\": 1, \"intercambia\": 4, \"nodo\": 8, \"inorden\": 4}", "index_docs": "{\"187\": 1, \"189\": 1, \"188\": 1, \"158\": 2, \"190\": 1, \"191\": 1, \"128\": 4, \"159\": 2, \"106\": 6, \"13\": 96, \"192\": 1, \"160\": 2, \"36\": 30, \"18\": 70, \"41\": 26, \"193\": 1, \"194\": 1, \"8\": 187, \"195\": 1, \"3\": 240, \"161\": 2, \"65\": 14, \"30\": 39, \"196\": 1, \"19\": 67, \"2\": 408, \"162\": 2, \"163\": 2, \"197\": 1, \"142\": 3, \"198\": 1, \"199\": 1, \"200\": 1, \"48\": 22, \"7\": 169, \"39\": 28, \"31\": 39, \"9\": 177, \"6\": 173, \"107\": 6, \"60\": 16, \"16\": 75, \"82\": 11, \"42\": 26, \"52\": 20, \"83\": 11, \"33\": 35, \"71\": 13, \"51\": 21, \"26\": 45, \"61\": 16, \"4\": 217, \"62\": 16, \"63\": 16, \"64\": 16, \"115\": 5, \"84\": 11, \"117\": 5, \"116\": 5, \"118\": 5, \"90\": 9, \"164\": 2, \"202\": 1, \"201\": 1, \"166\": 2, \"168\": 2, \"167\": 2, \"165\": 2, \"119\": 5, \"27\": 45, \"203\": 1, \"169\": 2, \"143\": 3, \"170\": 2, \"20\": 63, \"204\": 1, \"171\": 2, \"5\": 291, \"172\": 2, \"205\": 1, \"206\": 1, \"144\": 3, \"76\": 12, \"94\": 8, \"207\": 1, \"208\": 1, \"209\": 1, \"210\": 1, \"211\": 1, \"212\": 1, \"95\": 8, \"213\": 1, \"91\": 9, \"214\": 1, \"215\": 1, \"72\": 13, \"73\": 13, \"66\": 14, \"77\": 12, \"78\": 12, \"17\": 75, \"12\": 114, \"92\": 9, \"32\": 37, \"216\": 1, \"217\": 1, \"67\": 14, \"15\": 79, \"68\": 14, \"43\": 25, \"21\": 54, \"14\": 74, \"25\": 47, \"10\": 145, \"108\": 6, \"24\": 49, \"23\": 49, \"11\": 139, \"129\": 4, \"218\": 1, \"219\": 1, \"96\": 8, \"220\": 1, \"173\": 2, \"221\": 1, \"174\": 2, \"175\": 2, \"176\": 2, \"146\": 3, \"147\": 3, \"145\": 3, \"28\": 43, \"222\": 1, \"223\": 1, \"109\": 6, \"120\": 5, \"121\": 5, \"122\": 5, \"105\": 7, \"224\": 1, \"130\": 4, \"148\": 3, \"225\": 1, \"46\": 23, \"226\": 1, \"227\": 1, \"97\": 8, \"98\": 8, \"228\": 1, \"229\": 1, \"85\": 11, \"34\": 31, \"149\": 3, \"230\": 1, \"231\": 1, \"99\": 8, \"232\": 1, \"22\": 53, \"131\": 4, \"177\": 2, \"233\": 1, \"123\": 5, \"40\": 28, \"234\": 1, \"235\": 1, \"124\": 5, \"57\": 17, \"236\": 1, \"178\": 2, \"110\": 6, \"29\": 41, \"237\": 1, \"238\": 1, \"35\": 26, \"47\": 23, \"44\": 24, \"239\": 1, \"69\": 14, \"240\": 1, \"132\": 4, \"179\": 2, \"241\": 1, \"242\": 1, \"243\": 1, \"150\": 3, \"49\": 22, \"244\": 1, \"180\": 2, \"151\": 3, \"93\": 9, \"111\": 6, \"152\": 3, \"153\": 3, \"245\": 1, \"86\": 10, \"87\": 10, \"181\": 2, \"182\": 2, \"134\": 4, \"133\": 4, \"74\": 13, \"54\": 19, \"135\": 4, \"100\": 8, \"136\": 4, \"154\": 3, \"125\": 5, \"126\": 5, \"55\": 18, \"246\": 1, \"88\": 10, \"56\": 18, \"101\": 8, \"112\": 6, \"155\": 3, \"137\": 4, \"138\": 4, \"183\": 2, \"45\": 24, \"75\": 13, \"156\": 3, \"79\": 12, \"127\": 5, \"58\": 17, \"102\": 8, \"50\": 22, \"59\": 17, \"157\": 3, \"139\": 4, \"70\": 14, \"80\": 12, \"113\": 6, \"114\": 6, \"81\": 12, \"89\": 10, \"184\": 2, \"185\": 2, \"103\": 8, \"186\": 2, \"37\": 30, \"38\": 29, \"247\": 1, \"248\": 1, \"53\": 20, \"249\": 1, \"250\": 1, \"251\": 1, \"252\": 1, \"140\": 4, \"104\": 8, \"141\": 4}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"en\", \"3\": \"de\", \"4\": \"el\", \"5\": \"python\", \"6\": \"un\", \"7\": \"la\", \"8\": \"como\", \"9\": \"algoritmo\", \"10\": \"codigo\", \"11\": \"javascript\", \"12\": \"del\", \"13\": \"que\", \"14\": \"quicksort\", \"15\": \"ordenamiento\", \"16\": \"una\", \"17\": \"ejemplo\", \"18\": \"funcion\", \"19\": \"puedes\", \"20\": \"para\", \"21\": \"burbuja\", \"22\": \"muestrame\", \"23\": \"por\", \"24\": \"seleccion\", \"25\": \"ensename\", \"26\": \"clase\", \"27\": \"dame\", \"28\": \"se\", \"29\": \"ensenarme\", \"30\": \"explicame\", \"31\": \"define\", \"32\": \"con\", \"33\": \"if\", \"34\": \"podrias\", \"35\": \"suma\", \"36\": \"es\", \"37\": \"explicitos\", \"38\": \"indices\", \"39\": \"funciona\", \"40\": \"mostrarme\", \"41\": \"describeme\", \"42\": \"ciclo\", \"43\": \"arboles\", \"44\": \"ver\", \"45\": \"return\", \"46\": \"las\", \"47\": \"quiero\", \"48\": \"programacion\", \"49\": \"lineas\", \"50\": \"elementos\", \"51\": \"while\", \"52\": \"for\", \"53\": \"particion\", \"54\": \"constructor\", \"55\": \"basico\", \"56\": \"pivote\", \"57\": \"proporciona\", \"58\": \"lista\", \"59\": \"comparar\", \"60\": \"variable\", \"61\": \"objeto\", \"62\": \"polimorfismo\", \"63\": \"herencia\", \"64\": \"encapsulamiento\", \"65\": \"dime\", \"66\": \"creo\", \"67\": \"busqueda\", \"68\": \"grafos\", \"69\": \"linea\", \"70\": \"intercambiar\", \"71\": \"bucle\", \"72\": \"defino\", \"73\": \"declaro\", \"74\": \"persona\", \"75\": \"optimizado\", \"76\": \"programa\", \"77\": \"asigno\", \"78\": \"inicializo\", \"79\": \"iteracion\", \"80\": \"elemento\", \"81\": \"minimo\", \"82\": \"constante\", \"83\": \"condicion\", \"84\": \"a\", \"85\": \"darme\", \"86\": \"numero\", \"87\": \"secreto\", \"88\": \"asigna\", \"89\": \"sublista\", \"90\": \"lenguajes\", \"91\": \"puedo\", \"92\": \"algoritmos\", \"93\": \"muestra\", \"94\": \"mi\", \"95\": \"crear\", \"96\": \"explicarme\", \"97\": \"escribir\", \"98\": \"escribe\", \"99\": \"implementar\", \"100\": \"metodo\", \"101\": \"arreglo\", \"102\": \"recorrer\", \"103\": \"primero\", \"104\": \"nodo\", \"105\": \"y\", \"106\": \"eres\", \"107\": \"lenguaje\", \"108\": \"ejemplifica\", \"109\": \"crea\", \"110\": \"realiza\", \"111\": \"resultado\", \"112\": \"sublistas\", \"113\": \"encontrar\", \"114\": \"indice\", \"115\": \"abstraccion\", \"116\": \"orientado\", \"117\": \"objetos\", \"118\": \"poo\", \"119\": \"los\", \"120\": \"var\", \"121\": \"let\", \"122\": \"const\", \"123\": \"implementa\", \"124\": \"hace\", \"125\": \"animal\", \"126\": \"perro\", \"127\": \"recorrido\", \"128\": \"tu\", \"129\": \"definicion\", \"130\": \"entre\", \"131\": \"definir\", \"132\": \"lectura\", \"133\": \"dataclass\", \"134\": \"constantes\", \"135\": \"saludar\", \"136\": \"instancia\", \"137\": \"separan\", \"138\": \"divide\", \"139\": \"comparacion\", \"140\": \"intercambia\", \"141\": \"inorden\", \"142\": \"te\", \"143\": \"programar\", \"144\": \"ejecuto\", \"145\": \"pasos\", \"146\": \"debo\", \"147\": \"seguir\", \"148\": \"diferencia\", \"149\": \"usar\", \"150\": \"valores\", \"151\": \"llamada\", \"152\": \"imprime\", \"153\": \"mostrar\", \"154\": \"nueva\", \"155\": \"dos\", \"156\": \"tres\", \"157\": \"compara\", \"158\": \"buenas\", \"159\": \"quien\", \"160\": \"cual\", \"161\": \"tipo\", \"162\": \"me\", \"163\": \"estas\", \"164\": \"existen\", \"165\": \"cuales\", \"166\": \"son\", \"167\": \"mas\", \"168\": \"populares\", \"169\": \"sabes\", \"170\": \"conoces\", \"171\": \"entiendes\", \"172\": \"instalo\", \"173\": \"decirme\", \"174\": \"descargar\", \"175\": \"correr\", \"176\": \"ejecutar\", \"177\": \"utiliza\", \"178\": \"practico\", \"179\": \"recibe\", \"180\": \"llama\", \"181\": \"usado\", \"182\": \"condicional\", \"183\": \"partes\", \"184\": \"restante\", \"185\": \"menor\", \"186\": \"cambiar\", \"187\": \"hola\", \"188\": \"buenos\", \"189\": \"dias\", \"190\": \"tardes\", \"191\": \"noches\", \"192\": \"haces\", \"193\": \"funcionalidad\", \"194\": \"funcionas\", \"195\": \"bot\", \"196\": \"ayudar\", \"197\": \"encuentras\", \"198\": \"sientes\", \"199\": \"va\", \"200\": \"tal\", \"201\": \"deberia\", \"202\": \"aprender\", \"203\": \"listado\", \"204\": \"soportas\", \"205\": \"obtengo\", \"206\": \"descargo\", \"207\": \"corro\", \"208\": \"pruebo\", \"209\": \"app\", \"210\": \"aplicacion\", \"211\": \"empiezo\", \"212\": \"inicio\", \"213\": \"ayudame\", \"214\": \"empezar\", \"215\": \"iniciar\", \"216\": \"ensenar\", \"217\": \"manejas\", \"218\": \"cuentame\", \"219\": \"acerca\", \"220\": \"instalar\", \"221\": \"obtener\", \"222\": \"ejecuta\", \"223\": \"inicializa\", \"224\": \"hay\", \"225\": \"diferencias\", \"226\": \"diferencian\", \"227\": \"explicar\", \"228\": \"\\u00bfpuedes\", \"229\": \"ense\\u00f1arme\", \"230\": \"tienes\", \"231\": \"algun\", \"232\": \"sentencia\", \"233\": \"aplicar\", \"234\": \"asignar\", \"235\": \"arbol\", \"236\": \"uso\", \"237\": \"implementan\", \"238\": \"claro\", \"239\": \"dentro\", \"240\": \"numeros\", \"241\": \"realizar\", \"242\": \"datos\", \"243\": \"leen\", \"244\": \"hacen\", \"245\": \"mostarme\", \"246\": \"quicksor\", \"247\": \"logica\", \"248\": \"inidices\", \"249\": \"proporcionarme\", \"250\": \"selecciona\", \"251\": \"elige\", \"252\": \"proporcionar\"}", "word_index": "{\"<OOV>\": 1, \"en\": 2, \"de\": 3, \"el\": 4, \"python\": 5, \"un\": 6, \"la\": 7, \"como\": 8, \"algoritmo\": 9, \"codigo\": 10, \"javascript\": 11, \"del\": 12, \"que\": 13, \"quicksort\": 14, \"ordenamiento\": 15, \"una\": 16, \"ejemplo\": 17, \"funcion\": 18, \"puedes\": 19, \"para\": 20, \"burbuja\": 21, \"muestrame\": 22, \"por\": 23, \"seleccion\": 24, \"ensename\": 25, \"clase\": 26, \"dame\": 27, \"se\": 28, \"ensenarme\": 29, \"explicame\": 30, \"define\": 31, \"con\": 32, \"if\": 33, \"podrias\": 34, \"suma\": 35, \"es\": 36, \"explicitos\": 37, \"indices\": 38, \"funciona\": 39, \"mostrarme\": 40, \"describeme\": 41, \"ciclo\": 42, \"arboles\": 43, \"ver\": 44, \"return\": 45, \"las\": 46, \"quiero\": 47, \"programacion\": 48, \"lineas\": 49, \"elementos\": 50, \"while\": 51, \"for\": 52, \"particion\": 53, \"constructor\": 54, \"basico\": 55, \"pivote\": 56, \"proporciona\": 57, \"lista\": 58, \"comparar\": 59, \"variable\": 60, \"objeto\": 61, \"polimorfismo\": 62, \"herencia\": 63, \"encapsulamiento\": 64, \"dime\": 65, \"creo\": 66, \"busqueda\": 67, \"grafos\": 68, \"linea\": 69, \"intercambiar\": 70, \"bucle\": 71, \"defino\": 72, \"declaro\": 73, \"persona\": 74, \"optimizado\": 75, \"programa\": 76, \"asigno\": 77, \"inicializo\": 78, \"iteracion\": 79, \"elemento\": 80, \"minimo\": 81, \"constante\": 82, \"condicion\": 83, \"a\": 84, \"darme\": 85, \"numero\": 86, \"secreto\": 87, \"asigna\": 88, \"sublista\": 89, \"lenguajes\": 90, \"puedo\": 91, \"algoritmos\": 92, \"muestra\": 93, \"mi\": 94, \"crear\": 95, \"explicarme\": 96, \"escribir\": 97, \"escribe\": 98, \"implementar\": 99, \"metodo\": 100, \"arreglo\": 101, \"recorrer\": 102, \"primero\": 103, \"nodo\": 104, \"y\": 105, \"eres\": 106, \"lenguaje\": 107, \"ejemplifica\": 108, \"crea\": 109, \"realiza\": 110, \"resultado\": 111, \"sublistas\": 112, \"encontrar\": 113, \"indice\": 114, \"abstraccion\": 115, \"orientado\": 116, \"objetos\": 117, \"poo\": 118, \"los\": 119, \"var\": 120, \"let\": 121, \"const\": 122, \"implementa\": 123, \"hace\": 124, \"animal\": 125, \"perro\": 126, \"recorrido\": 127, \"tu\": 128, \"definicion\": 129, \"entre\": 130, \"definir\": 131, \"lectura\": 132, \"dataclass\": 133, \"constantes\": 134, \"saludar\": 135, \"instancia\": 136, \"separan\": 137, \"divide\": 138, \"comparacion\": 139, \"intercambia\": 140, \"inorden\": 141, \"te\": 142, \"programar\": 143, \"ejecuto\": 144, \"pasos\": 145, \"debo\": 146, \"seguir\": 147, \"diferencia\": 148, \"usar\": 149, \"valores\": 150, \"llamada\": 151, \"imprime\": 152, \"mostrar\": 153, \"nueva\": 154, \"dos\": 155, \"tres\": 156, \"compara\": 157, \"buenas\": 158, \"quien\": 159, \"cual\": 160, \"tipo\": 161, \"me\": 162, \"estas\": 163, \"existen\": 164, \"cuales\": 165, \"son\": 166, \"mas\": 167, \"populares\": 168, \"sabes\": 169, \"conoces\": 170, \"entiendes\": 171, \"instalo\": 172, \"decirme\": 173, \"descargar\": 174, \"correr\": 175, \"ejecutar\": 176, \"utiliza\": 177, \"practico\": 178, \"recibe\": 179, \"llama\": 180, \"usado\": 181, \"condicional\": 182, \"partes\": 183, \"restante\": 184, \"menor\": 185, \"cambiar\": 186, \"hola\": 187, \"buenos\": 188, \"dias\": 189, \"tardes\": 190, \"noches\": 191, \"haces\": 192, \"funcionalidad\": 193, \"funcionas\": 194, \"bot\": 195, \"ayudar\": 196, \"encuentras\": 197, \"sientes\": 198, \"va\": 199, \"tal\": 200, \"deberia\": 201, \"aprender\": 202, \"listado\": 203, \"soportas\": 204, \"obtengo\": 205, \"descargo\": 206, \"corro\": 207, \"pruebo\": 208, \"app\": 209, \"aplicacion\": 210, \"empiezo\": 211, \"inicio\": 212, \"ayudame\": 213, \"empezar\": 214, \"iniciar\": 215, \"ensenar\": 216, \"manejas\": 217, \"cuentame\": 218, \"acerca\": 219, \"instalar\": 220, \"obtener\": 221, \"ejecuta\": 222, \"inicializa\": 223, \"hay\": 224, \"diferencias\": 225, \"diferencian\": 226, \"explicar\": 227, \"\\u00bfpuedes\": 228, \"ense\\u00f1arme\": 229, \"tienes\": 230, \"algun\": 231, \"sentencia\": 232, \"aplicar\": 233, \"asignar\": 234, \"arbol\": 235, \"uso\": 236, \"implementan\": 237, \"claro\": 238, \"dentro\": 239, \"numeros\": 240, \"realizar\": 241, \"datos\": 242, \"leen\": 243, \"hacen\": 244, \"mostarme\": 245, \"quicksor\": 246, \"logica\": 247, \"inidices\": 248, \"proporcionarme\": 249, \"selecciona\": 250, \"elige\": 251, \"proporcionar\": 252}"}}