{"class_name": "Tokenizer", "config": {"num_words": 20000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 645, "word_counts": "{\"hola\": 1, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"quien\": 2, \"eres\": 6, \"tu\": 4, \"que\": 96, \"haces\": 1, \"cual\": 2, \"es\": 30, \"funcion\": 70, \"describeme\": 26, \"funcionalidad\": 1, \"como\": 187, \"funcionas\": 1, \"tipo\": 2, \"de\": 315, \"bot\": 2, \"dime\": 14, \"explicame\": 39, \"en\": 481, \"me\": 4, \"puedes\": 67, \"ayudar\": 1, \"estas\": 2, \"te\": 3, \"encuentras\": 1, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"la\": 192, \"programacion\": 22, \"funciona\": 28, \"define\": 47, \"un\": 207, \"algoritmo\": 177, \"lenguaje\": 6, \"una\": 75, \"variable\": 21, \"constante\": 11, \"ciclo\": 26, \"for\": 25, \"condicion\": 11, \"if\": 40, \"bucle\": 13, \"while\": 26, \"clase\": 45, \"objeto\": 16, \"el\": 308, \"polimorfismo\": 16, \"herencia\": 16, \"encapsulamiento\": 16, \"abstraccion\": 5, \"orientado\": 5, \"a\": 36, \"objetos\": 5, \"poo\": 5, \"lenguajes\": 9, \"existen\": 2, \"deberia\": 1, \"aprender\": 1, \"cuales\": 2, \"son\": 2, \"los\": 5, \"mas\": 2, \"populares\": 2, \"dame\": 45, \"listado\": 1, \"sabes\": 2, \"conoces\": 2, \"para\": 63, \"programar\": 3, \"soportas\": 1, \"entiendes\": 2, \"python\": 291, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"ejecuto\": 3, \"mi\": 8, \"programa\": 12, \"corro\": 1, \"pruebo\": 1, \"app\": 1, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"ayudame\": 1, \"crear\": 8, \"puedo\": 9, \"empezar\": 1, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 14, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 75, \"del\": 131, \"algoritmos\": 9, \"con\": 37, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 14, \"ordenamiento\": 79, \"grafos\": 14, \"arboles\": 25, \"burbuja\": 54, \"quicksort\": 82, \"ensename\": 47, \"codigo\": 145, \"ejemplifica\": 6, \"por\": 49, \"seleccion\": 49, \"javascript\": 139, \"definicion\": 4, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 8, \"instalar\": 1, \"decirme\": 2, \"obtener\": 1, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"pasos\": 3, \"debo\": 3, \"seguir\": 3, \"se\": 43, \"ejecuta\": 1, \"inicializa\": 1, \"crea\": 6, \"diferencia\": 3, \"hay\": 1, \"entre\": 4, \"var\": 5, \"let\": 5, \"y\": 7, \"const\": 5, \"las\": 23, \"diferencias\": 1, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 8, \"escribe\": 8, \"\\u00bfpuedes\": 1, \"ense\\u00f1arme\": 1, \"podrias\": 31, \"darme\": 11, \"usar\": 3, \"tienes\": 1, \"algun\": 1, \"implementar\": 8, \"sentencia\": 1, \"muestrame\": 53, \"definir\": 4, \"utiliza\": 2, \"aplicar\": 1, \"implementa\": 5, \"mostrarme\": 28, \"asignar\": 1, \"arbol\": 1, \"hace\": 5, \"proporciona\": 17, \"uso\": 1, \"practico\": 2, \"realiza\": 6, \"ensenarme\": 41, \"implementan\": 1, \"claro\": 1, \"suma\": 31, \"quiero\": 23, \"ver\": 24, \"dentro\": 1, \"linea\": 14, \"lectura\": 4, \"numeros\": 1, \"recibe\": 2, \"realizar\": 1, \"datos\": 1, \"leen\": 1, \"valores\": 3, \"lineas\": 22, \"hacen\": 1, \"llama\": 2, \"llamada\": 3, \"muestra\": 9, \"resultado\": 6, \"imprime\": 3, \"mostrar\": 3, \"mostarme\": 1, \"numero\": 10, \"secreto\": 10, \"usado\": 2, \"condicional\": 2, \"dataclass\": 4, \"constantes\": 4, \"constructor\": 19, \"persona\": 13, \"metodo\": 8, \"saludar\": 4, \"nueva\": 3, \"instancia\": 4, \"animal\": 5, \"perro\": 5, \"basico\": 18, \"quicksor\": 1, \"asigna\": 10, \"pivote\": 18, \"separan\": 4, \"arreglo\": 8, \"dos\": 3, \"sublistas\": 6, \"divide\": 4, \"partes\": 2, \"return\": 24, \"optimizado\": 13, \"tres\": 3, \"iteracion\": 12, \"recorrido\": 5, \"lista\": 17, \"recorrer\": 8, \"comparar\": 17, \"elementos\": 22, \"compara\": 3, \"comparacion\": 4, \"intercambiar\": 14, \"encontrar\": 6, \"indice\": 6, \"elemento\": 12, \"minimo\": 12, \"sublista\": 10, \"restante\": 2, \"menor\": 2, \"primero\": 8, \"cambiar\": 2, \"indices\": 29, \"explicitos\": 30, \"logica\": 1, \"inidices\": 1, \"particion\": 20, \"proporcionarme\": 1, \"selecciona\": 1, \"elige\": 1, \"proporcionar\": 1, \"intercambia\": 4, \"nodo\": 8, \"inorden\": 4, \"hello\": 1, \"good\": 3, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"hi\": 1, \"who\": 2, \"are\": 9, \"you\": 13, \"what\": 14, \"do\": 4, \"is\": 9, \"your\": 2, \"function\": 1, \"describe\": 9, \"functionality\": 1, \"how\": 14, \"work\": 9, \"kind\": 1, \"of\": 1, \"tell\": 1, \"explain\": 9, \"can\": 1, \"help\": 1, \"doing\": 1, \"feel\": 1, \"how's\": 1, \"it\": 1, \"going\": 1, \"today\": 1, \"programming\": 10, \"does\": 8, \"an\": 10, \"algorithm\": 5, \"language\": 5, \"constant\": 5, \"loop\": 10, \"condition\": 5}", "word_docs": "{\"hola\": 1, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"eres\": 6, \"tu\": 4, \"quien\": 2, \"que\": 96, \"haces\": 1, \"es\": 30, \"cual\": 2, \"funcion\": 70, \"funcionalidad\": 1, \"describeme\": 26, \"funcionas\": 1, \"como\": 187, \"tipo\": 2, \"de\": 240, \"bot\": 2, \"dime\": 14, \"explicame\": 39, \"me\": 4, \"puedes\": 67, \"en\": 408, \"ayudar\": 1, \"estas\": 2, \"encuentras\": 1, \"te\": 3, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"la\": 169, \"programacion\": 22, \"funciona\": 28, \"define\": 47, \"algoritmo\": 177, \"un\": 173, \"lenguaje\": 6, \"una\": 75, \"variable\": 21, \"constante\": 11, \"for\": 25, \"ciclo\": 26, \"if\": 40, \"condicion\": 11, \"bucle\": 13, \"while\": 26, \"clase\": 45, \"objeto\": 16, \"polimorfismo\": 16, \"el\": 217, \"herencia\": 16, \"encapsulamiento\": 16, \"abstraccion\": 5, \"objetos\": 5, \"a\": 36, \"orientado\": 5, \"poo\": 5, \"existen\": 2, \"lenguajes\": 9, \"aprender\": 1, \"deberia\": 1, \"cuales\": 2, \"populares\": 2, \"los\": 5, \"son\": 2, \"mas\": 2, \"dame\": 45, \"listado\": 1, \"sabes\": 2, \"programar\": 3, \"para\": 63, \"conoces\": 2, \"soportas\": 1, \"entiendes\": 2, \"python\": 291, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"mi\": 8, \"programa\": 12, \"ejecuto\": 3, \"corro\": 1, \"pruebo\": 1, \"app\": 1, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"ayudame\": 1, \"crear\": 8, \"empezar\": 1, \"puedo\": 9, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 14, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 75, \"del\": 114, \"algoritmos\": 9, \"con\": 37, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 14, \"ordenamiento\": 79, \"grafos\": 14, \"arboles\": 25, \"burbuja\": 54, \"quicksort\": 74, \"ensename\": 47, \"codigo\": 145, \"ejemplifica\": 6, \"seleccion\": 49, \"por\": 49, \"javascript\": 139, \"definicion\": 4, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 8, \"instalar\": 1, \"obtener\": 1, \"decirme\": 2, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"seguir\": 3, \"pasos\": 3, \"debo\": 3, \"ejecuta\": 1, \"se\": 43, \"inicializa\": 1, \"crea\": 6, \"diferencia\": 3, \"var\": 5, \"entre\": 4, \"let\": 5, \"hay\": 1, \"const\": 5, \"y\": 7, \"diferencias\": 1, \"las\": 23, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 8, \"escribe\": 8, \"\\u00bfpuedes\": 1, \"ense\\u00f1arme\": 1, \"podrias\": 31, \"darme\": 11, \"usar\": 3, \"algun\": 1, \"tienes\": 1, \"implementar\": 8, \"sentencia\": 1, \"muestrame\": 53, \"definir\": 4, \"utiliza\": 2, \"aplicar\": 1, \"implementa\": 5, \"mostrarme\": 28, \"asignar\": 1, \"arbol\": 1, \"hace\": 5, \"uso\": 1, \"proporciona\": 17, \"practico\": 2, \"realiza\": 6, \"ensenarme\": 41, \"implementan\": 1, \"claro\": 1, \"suma\": 26, \"quiero\": 23, \"ver\": 24, \"dentro\": 1, \"linea\": 14, \"numeros\": 1, \"recibe\": 2, \"lectura\": 4, \"realizar\": 1, \"datos\": 1, \"leen\": 1, \"valores\": 3, \"hacen\": 1, \"lineas\": 22, \"llama\": 2, \"llamada\": 3, \"muestra\": 9, \"resultado\": 6, \"imprime\": 3, \"mostrar\": 3, \"secreto\": 10, \"numero\": 10, \"mostarme\": 1, \"usado\": 2, \"condicional\": 2, \"dataclass\": 4, \"constantes\": 4, \"constructor\": 19, \"persona\": 13, \"metodo\": 8, \"saludar\": 4, \"instancia\": 4, \"nueva\": 3, \"animal\": 5, \"perro\": 5, \"basico\": 18, \"quicksor\": 1, \"pivote\": 18, \"asigna\": 10, \"sublistas\": 6, \"dos\": 3, \"separan\": 4, \"arreglo\": 8, \"partes\": 2, \"divide\": 4, \"return\": 24, \"optimizado\": 13, \"tres\": 3, \"iteracion\": 12, \"lista\": 17, \"recorrido\": 5, \"recorrer\": 8, \"elementos\": 22, \"comparar\": 17, \"compara\": 3, \"comparacion\": 4, \"intercambiar\": 14, \"indice\": 6, \"minimo\": 12, \"elemento\": 12, \"encontrar\": 6, \"sublista\": 10, \"restante\": 2, \"menor\": 2, \"primero\": 8, \"cambiar\": 2, \"indices\": 29, \"explicitos\": 30, \"logica\": 1, \"inidices\": 1, \"particion\": 20, \"proporcionarme\": 1, \"selecciona\": 1, \"elige\": 1, \"proporcionar\": 1, \"intercambia\": 4, \"nodo\": 8, \"inorden\": 4, \"hello\": 1, \"good\": 3, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"hi\": 1, \"are\": 9, \"who\": 2, \"you\": 13, \"what\": 14, \"do\": 3, \"your\": 2, \"is\": 9, \"function\": 1, \"functionality\": 1, \"describe\": 9, \"how\": 14, \"work\": 9, \"kind\": 1, \"of\": 1, \"tell\": 1, \"explain\": 9, \"can\": 1, \"help\": 1, \"doing\": 1, \"feel\": 1, \"going\": 1, \"how's\": 1, \"it\": 1, \"today\": 1, \"programming\": 10, \"does\": 8, \"algorithm\": 5, \"an\": 10, \"language\": 5, \"constant\": 5, \"loop\": 10, \"condition\": 5}", "index_docs": "{\"208\": 1, \"209\": 1, \"210\": 1, \"177\": 2, \"211\": 1, \"212\": 1, \"118\": 6, \"144\": 4, \"178\": 2, \"13\": 96, \"213\": 1, \"37\": 30, \"179\": 2, \"18\": 70, \"214\": 1, \"42\": 26, \"215\": 1, \"8\": 187, \"180\": 2, \"3\": 240, \"181\": 2, \"66\": 14, \"32\": 39, \"145\": 4, \"19\": 67, \"2\": 408, \"216\": 1, \"182\": 2, \"217\": 1, \"160\": 3, \"218\": 1, \"219\": 1, \"220\": 1, \"7\": 169, \"51\": 22, \"40\": 28, \"25\": 47, \"9\": 177, \"6\": 173, \"119\": 6, \"16\": 75, \"54\": 21, \"86\": 11, \"45\": 25, \"43\": 26, \"31\": 40, \"87\": 11, \"74\": 13, \"44\": 26, \"27\": 45, \"62\": 16, \"63\": 16, \"4\": 217, \"64\": 16, \"65\": 16, \"127\": 5, \"129\": 5, \"34\": 36, \"128\": 5, \"130\": 5, \"183\": 2, \"96\": 9, \"222\": 1, \"221\": 1, \"184\": 2, \"187\": 2, \"131\": 5, \"185\": 2, \"186\": 2, \"28\": 45, \"223\": 1, \"188\": 2, \"161\": 3, \"20\": 63, \"189\": 2, \"224\": 1, \"190\": 2, \"5\": 291, \"191\": 2, \"225\": 1, \"226\": 1, \"105\": 8, \"80\": 12, \"162\": 3, \"227\": 1, \"228\": 1, \"229\": 1, \"230\": 1, \"231\": 1, \"232\": 1, \"233\": 1, \"106\": 8, \"234\": 1, \"97\": 9, \"235\": 1, \"75\": 13, \"76\": 13, \"67\": 14, \"81\": 12, \"82\": 12, \"17\": 75, \"12\": 114, \"98\": 9, \"33\": 37, \"236\": 1, \"237\": 1, \"68\": 14, \"15\": 79, \"69\": 14, \"46\": 25, \"21\": 54, \"14\": 74, \"26\": 47, \"10\": 145, \"120\": 6, \"24\": 49, \"23\": 49, \"11\": 139, \"146\": 4, \"238\": 1, \"239\": 1, \"107\": 8, \"240\": 1, \"241\": 1, \"192\": 2, \"193\": 2, \"194\": 2, \"195\": 2, \"165\": 3, \"163\": 3, \"164\": 3, \"242\": 1, \"29\": 43, \"243\": 1, \"121\": 6, \"166\": 3, \"132\": 5, \"147\": 4, \"133\": 5, \"244\": 1, \"134\": 5, \"117\": 7, \"245\": 1, \"49\": 23, \"246\": 1, \"247\": 1, \"108\": 8, \"109\": 8, \"248\": 1, \"249\": 1, \"35\": 31, \"88\": 11, \"167\": 3, \"251\": 1, \"250\": 1, \"110\": 8, \"252\": 1, \"22\": 53, \"148\": 4, \"196\": 2, \"253\": 1, \"135\": 5, \"41\": 28, \"254\": 1, \"255\": 1, \"136\": 5, \"256\": 1, \"59\": 17, \"197\": 2, \"122\": 6, \"30\": 41, \"257\": 1, \"258\": 1, \"36\": 26, \"50\": 23, \"47\": 24, \"259\": 1, \"70\": 14, \"260\": 1, \"198\": 2, \"149\": 4, \"261\": 1, \"262\": 1, \"263\": 1, \"168\": 3, \"264\": 1, \"52\": 22, \"199\": 2, \"169\": 3, \"99\": 9, \"123\": 6, \"170\": 3, \"171\": 3, \"90\": 10, \"89\": 10, \"265\": 1, \"200\": 2, \"201\": 2, \"150\": 4, \"151\": 4, \"56\": 19, \"77\": 13, \"111\": 8, \"152\": 4, \"153\": 4, \"172\": 3, \"137\": 5, \"138\": 5, \"57\": 18, \"266\": 1, \"58\": 18, \"91\": 10, \"124\": 6, \"173\": 3, \"154\": 4, \"112\": 8, \"202\": 2, \"155\": 4, \"48\": 24, \"78\": 13, \"174\": 3, \"83\": 12, \"60\": 17, \"139\": 5, \"113\": 8, \"53\": 22, \"61\": 17, \"175\": 3, \"156\": 4, \"71\": 14, \"126\": 6, \"85\": 12, \"84\": 12, \"125\": 6, \"92\": 10, \"203\": 2, \"204\": 2, \"114\": 8, \"205\": 2, \"39\": 29, \"38\": 30, \"267\": 1, \"268\": 1, \"55\": 20, \"269\": 1, \"270\": 1, \"271\": 1, \"272\": 1, \"157\": 4, \"115\": 8, \"158\": 4, \"273\": 1, \"176\": 3, \"274\": 1, \"275\": 1, \"276\": 1, \"277\": 1, \"100\": 9, \"206\": 2, \"79\": 13, \"72\": 14, \"159\": 3, \"207\": 2, \"101\": 9, \"278\": 1, \"279\": 1, \"102\": 9, \"73\": 14, \"103\": 9, \"280\": 1, \"281\": 1, \"282\": 1, \"104\": 9, \"283\": 1, \"284\": 1, \"285\": 1, \"286\": 1, \"289\": 1, \"287\": 1, \"288\": 1, \"290\": 1, \"93\": 10, \"116\": 8, \"140\": 5, \"94\": 10, \"141\": 5, \"142\": 5, \"95\": 10, \"143\": 5}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"en\", \"3\": \"de\", \"4\": \"el\", \"5\": \"python\", \"6\": \"un\", \"7\": \"la\", \"8\": \"como\", \"9\": \"algoritmo\", \"10\": \"codigo\", \"11\": \"javascript\", \"12\": \"del\", \"13\": \"que\", \"14\": \"quicksort\", \"15\": \"ordenamiento\", \"16\": \"una\", \"17\": \"ejemplo\", \"18\": \"funcion\", \"19\": \"puedes\", \"20\": \"para\", \"21\": \"burbuja\", \"22\": \"muestrame\", \"23\": \"por\", \"24\": \"seleccion\", \"25\": \"define\", \"26\": \"ensename\", \"27\": \"clase\", \"28\": \"dame\", \"29\": \"se\", \"30\": \"ensenarme\", \"31\": \"if\", \"32\": \"explicame\", \"33\": \"con\", \"34\": \"a\", \"35\": \"podrias\", \"36\": \"suma\", \"37\": \"es\", \"38\": \"explicitos\", \"39\": \"indices\", \"40\": \"funciona\", \"41\": \"mostrarme\", \"42\": \"describeme\", \"43\": \"ciclo\", \"44\": \"while\", \"45\": \"for\", \"46\": \"arboles\", \"47\": \"ver\", \"48\": \"return\", \"49\": \"las\", \"50\": \"quiero\", \"51\": \"programacion\", \"52\": \"lineas\", \"53\": \"elementos\", \"54\": \"variable\", \"55\": \"particion\", \"56\": \"constructor\", \"57\": \"basico\", \"58\": \"pivote\", \"59\": \"proporciona\", \"60\": \"lista\", \"61\": \"comparar\", \"62\": \"objeto\", \"63\": \"polimorfismo\", \"64\": \"herencia\", \"65\": \"encapsulamiento\", \"66\": \"dime\", \"67\": \"creo\", \"68\": \"busqueda\", \"69\": \"grafos\", \"70\": \"linea\", \"71\": \"intercambiar\", \"72\": \"what\", \"73\": \"how\", \"74\": \"bucle\", \"75\": \"defino\", \"76\": \"declaro\", \"77\": \"persona\", \"78\": \"optimizado\", \"79\": \"you\", \"80\": \"programa\", \"81\": \"asigno\", \"82\": \"inicializo\", \"83\": \"iteracion\", \"84\": \"elemento\", \"85\": \"minimo\", \"86\": \"constante\", \"87\": \"condicion\", \"88\": \"darme\", \"89\": \"numero\", \"90\": \"secreto\", \"91\": \"asigna\", \"92\": \"sublista\", \"93\": \"programming\", \"94\": \"an\", \"95\": \"loop\", \"96\": \"lenguajes\", \"97\": \"puedo\", \"98\": \"algoritmos\", \"99\": \"muestra\", \"100\": \"are\", \"101\": \"is\", \"102\": \"describe\", \"103\": \"work\", \"104\": \"explain\", \"105\": \"mi\", \"106\": \"crear\", \"107\": \"explicarme\", \"108\": \"escribir\", \"109\": \"escribe\", \"110\": \"implementar\", \"111\": \"metodo\", \"112\": \"arreglo\", \"113\": \"recorrer\", \"114\": \"primero\", \"115\": \"nodo\", \"116\": \"does\", \"117\": \"y\", \"118\": \"eres\", \"119\": \"lenguaje\", \"120\": \"ejemplifica\", \"121\": \"crea\", \"122\": \"realiza\", \"123\": \"resultado\", \"124\": \"sublistas\", \"125\": \"encontrar\", \"126\": \"indice\", \"127\": \"abstraccion\", \"128\": \"orientado\", \"129\": \"objetos\", \"130\": \"poo\", \"131\": \"los\", \"132\": \"var\", \"133\": \"let\", \"134\": \"const\", \"135\": \"implementa\", \"136\": \"hace\", \"137\": \"animal\", \"138\": \"perro\", \"139\": \"recorrido\", \"140\": \"algorithm\", \"141\": \"language\", \"142\": \"constant\", \"143\": \"condition\", \"144\": \"tu\", \"145\": \"me\", \"146\": \"definicion\", \"147\": \"entre\", \"148\": \"definir\", \"149\": \"lectura\", \"150\": \"dataclass\", \"151\": \"constantes\", \"152\": \"saludar\", \"153\": \"instancia\", \"154\": \"separan\", \"155\": \"divide\", \"156\": \"comparacion\", \"157\": \"intercambia\", \"158\": \"inorden\", \"159\": \"do\", \"160\": \"te\", \"161\": \"programar\", \"162\": \"ejecuto\", \"163\": \"pasos\", \"164\": \"debo\", \"165\": \"seguir\", \"166\": \"diferencia\", \"167\": \"usar\", \"168\": \"valores\", \"169\": \"llamada\", \"170\": \"imprime\", \"171\": \"mostrar\", \"172\": \"nueva\", \"173\": \"dos\", \"174\": \"tres\", \"175\": \"compara\", \"176\": \"good\", \"177\": \"buenas\", \"178\": \"quien\", \"179\": \"cual\", \"180\": \"tipo\", \"181\": \"bot\", \"182\": \"estas\", \"183\": \"existen\", \"184\": \"cuales\", \"185\": \"son\", \"186\": \"mas\", \"187\": \"populares\", \"188\": \"sabes\", \"189\": \"conoces\", \"190\": \"entiendes\", \"191\": \"instalo\", \"192\": \"decirme\", \"193\": \"descargar\", \"194\": \"correr\", \"195\": \"ejecutar\", \"196\": \"utiliza\", \"197\": \"practico\", \"198\": \"recibe\", \"199\": \"llama\", \"200\": \"usado\", \"201\": \"condicional\", \"202\": \"partes\", \"203\": \"restante\", \"204\": \"menor\", \"205\": \"cambiar\", \"206\": \"who\", \"207\": \"your\", \"208\": \"hola\", \"209\": \"buenos\", \"210\": \"dias\", \"211\": \"tardes\", \"212\": \"noches\", \"213\": \"haces\", \"214\": \"funcionalidad\", \"215\": \"funcionas\", \"216\": \"ayudar\", \"217\": \"encuentras\", \"218\": \"sientes\", \"219\": \"va\", \"220\": \"tal\", \"221\": \"deberia\", \"222\": \"aprender\", \"223\": \"listado\", \"224\": \"soportas\", \"225\": \"obtengo\", \"226\": \"descargo\", \"227\": \"corro\", \"228\": \"pruebo\", \"229\": \"app\", \"230\": \"aplicacion\", \"231\": \"empiezo\", \"232\": \"inicio\", \"233\": \"ayudame\", \"234\": \"empezar\", \"235\": \"iniciar\", \"236\": \"ensenar\", \"237\": \"manejas\", \"238\": \"cuentame\", \"239\": \"acerca\", \"240\": \"instalar\", \"241\": \"obtener\", \"242\": \"ejecuta\", \"243\": \"inicializa\", \"244\": \"hay\", \"245\": \"diferencias\", \"246\": \"diferencian\", \"247\": \"explicar\", \"248\": \"\\u00bfpuedes\", \"249\": \"ense\\u00f1arme\", \"250\": \"tienes\", \"251\": \"algun\", \"252\": \"sentencia\", \"253\": \"aplicar\", \"254\": \"asignar\", \"255\": \"arbol\", \"256\": \"uso\", \"257\": \"implementan\", \"258\": \"claro\", \"259\": \"dentro\", \"260\": \"numeros\", \"261\": \"realizar\", \"262\": \"datos\", \"263\": \"leen\", \"264\": \"hacen\", \"265\": \"mostarme\", \"266\": \"quicksor\", \"267\": \"logica\", \"268\": \"inidices\", \"269\": \"proporcionarme\", \"270\": \"selecciona\", \"271\": \"elige\", \"272\": \"proporcionar\", \"273\": \"hello\", \"274\": \"morning\", \"275\": \"afternoon\", \"276\": \"evening\", \"277\": \"hi\", \"278\": \"function\", \"279\": \"functionality\", \"280\": \"kind\", \"281\": \"of\", \"282\": \"tell\", \"283\": \"can\", \"284\": \"help\", \"285\": \"doing\", \"286\": \"feel\", \"287\": \"how's\", \"288\": \"it\", \"289\": \"going\", \"290\": \"today\"}", "word_index": "{\"<OOV>\": 1, \"en\": 2, \"de\": 3, \"el\": 4, \"python\": 5, \"un\": 6, \"la\": 7, \"como\": 8, \"algoritmo\": 9, \"codigo\": 10, \"javascript\": 11, \"del\": 12, \"que\": 13, \"quicksort\": 14, \"ordenamiento\": 15, \"una\": 16, \"ejemplo\": 17, \"funcion\": 18, \"puedes\": 19, \"para\": 20, \"burbuja\": 21, \"muestrame\": 22, \"por\": 23, \"seleccion\": 24, \"define\": 25, \"ensename\": 26, \"clase\": 27, \"dame\": 28, \"se\": 29, \"ensenarme\": 30, \"if\": 31, \"explicame\": 32, \"con\": 33, \"a\": 34, \"podrias\": 35, \"suma\": 36, \"es\": 37, \"explicitos\": 38, \"indices\": 39, \"funciona\": 40, \"mostrarme\": 41, \"describeme\": 42, \"ciclo\": 43, \"while\": 44, \"for\": 45, \"arboles\": 46, \"ver\": 47, \"return\": 48, \"las\": 49, \"quiero\": 50, \"programacion\": 51, \"lineas\": 52, \"elementos\": 53, \"variable\": 54, \"particion\": 55, \"constructor\": 56, \"basico\": 57, \"pivote\": 58, \"proporciona\": 59, \"lista\": 60, \"comparar\": 61, \"objeto\": 62, \"polimorfismo\": 63, \"herencia\": 64, \"encapsulamiento\": 65, \"dime\": 66, \"creo\": 67, \"busqueda\": 68, \"grafos\": 69, \"linea\": 70, \"intercambiar\": 71, \"what\": 72, \"how\": 73, \"bucle\": 74, \"defino\": 75, \"declaro\": 76, \"persona\": 77, \"optimizado\": 78, \"you\": 79, \"programa\": 80, \"asigno\": 81, \"inicializo\": 82, \"iteracion\": 83, \"elemento\": 84, \"minimo\": 85, \"constante\": 86, \"condicion\": 87, \"darme\": 88, \"numero\": 89, \"secreto\": 90, \"asigna\": 91, \"sublista\": 92, \"programming\": 93, \"an\": 94, \"loop\": 95, \"lenguajes\": 96, \"puedo\": 97, \"algoritmos\": 98, \"muestra\": 99, \"are\": 100, \"is\": 101, \"describe\": 102, \"work\": 103, \"explain\": 104, \"mi\": 105, \"crear\": 106, \"explicarme\": 107, \"escribir\": 108, \"escribe\": 109, \"implementar\": 110, \"metodo\": 111, \"arreglo\": 112, \"recorrer\": 113, \"primero\": 114, \"nodo\": 115, \"does\": 116, \"y\": 117, \"eres\": 118, \"lenguaje\": 119, \"ejemplifica\": 120, \"crea\": 121, \"realiza\": 122, \"resultado\": 123, \"sublistas\": 124, \"encontrar\": 125, \"indice\": 126, \"abstraccion\": 127, \"orientado\": 128, \"objetos\": 129, \"poo\": 130, \"los\": 131, \"var\": 132, \"let\": 133, \"const\": 134, \"implementa\": 135, \"hace\": 136, \"animal\": 137, \"perro\": 138, \"recorrido\": 139, \"algorithm\": 140, \"language\": 141, \"constant\": 142, \"condition\": 143, \"tu\": 144, \"me\": 145, \"definicion\": 146, \"entre\": 147, \"definir\": 148, \"lectura\": 149, \"dataclass\": 150, \"constantes\": 151, \"saludar\": 152, \"instancia\": 153, \"separan\": 154, \"divide\": 155, \"comparacion\": 156, \"intercambia\": 157, \"inorden\": 158, \"do\": 159, \"te\": 160, \"programar\": 161, \"ejecuto\": 162, \"pasos\": 163, \"debo\": 164, \"seguir\": 165, \"diferencia\": 166, \"usar\": 167, \"valores\": 168, \"llamada\": 169, \"imprime\": 170, \"mostrar\": 171, \"nueva\": 172, \"dos\": 173, \"tres\": 174, \"compara\": 175, \"good\": 176, \"buenas\": 177, \"quien\": 178, \"cual\": 179, \"tipo\": 180, \"bot\": 181, \"estas\": 182, \"existen\": 183, \"cuales\": 184, \"son\": 185, \"mas\": 186, \"populares\": 187, \"sabes\": 188, \"conoces\": 189, \"entiendes\": 190, \"instalo\": 191, \"decirme\": 192, \"descargar\": 193, \"correr\": 194, \"ejecutar\": 195, \"utiliza\": 196, \"practico\": 197, \"recibe\": 198, \"llama\": 199, \"usado\": 200, \"condicional\": 201, \"partes\": 202, \"restante\": 203, \"menor\": 204, \"cambiar\": 205, \"who\": 206, \"your\": 207, \"hola\": 208, \"buenos\": 209, \"dias\": 210, \"tardes\": 211, \"noches\": 212, \"haces\": 213, \"funcionalidad\": 214, \"funcionas\": 215, \"ayudar\": 216, \"encuentras\": 217, \"sientes\": 218, \"va\": 219, \"tal\": 220, \"deberia\": 221, \"aprender\": 222, \"listado\": 223, \"soportas\": 224, \"obtengo\": 225, \"descargo\": 226, \"corro\": 227, \"pruebo\": 228, \"app\": 229, \"aplicacion\": 230, \"empiezo\": 231, \"inicio\": 232, \"ayudame\": 233, \"empezar\": 234, \"iniciar\": 235, \"ensenar\": 236, \"manejas\": 237, \"cuentame\": 238, \"acerca\": 239, \"instalar\": 240, \"obtener\": 241, \"ejecuta\": 242, \"inicializa\": 243, \"hay\": 244, \"diferencias\": 245, \"diferencian\": 246, \"explicar\": 247, \"\\u00bfpuedes\": 248, \"ense\\u00f1arme\": 249, \"tienes\": 250, \"algun\": 251, \"sentencia\": 252, \"aplicar\": 253, \"asignar\": 254, \"arbol\": 255, \"uso\": 256, \"implementan\": 257, \"claro\": 258, \"dentro\": 259, \"numeros\": 260, \"realizar\": 261, \"datos\": 262, \"leen\": 263, \"hacen\": 264, \"mostarme\": 265, \"quicksor\": 266, \"logica\": 267, \"inidices\": 268, \"proporcionarme\": 269, \"selecciona\": 270, \"elige\": 271, \"proporcionar\": 272, \"hello\": 273, \"morning\": 274, \"afternoon\": 275, \"evening\": 276, \"hi\": 277, \"function\": 278, \"functionality\": 279, \"kind\": 280, \"of\": 281, \"tell\": 282, \"can\": 283, \"help\": 284, \"doing\": 285, \"feel\": 286, \"how's\": 287, \"it\": 288, \"going\": 289, \"today\": 290}"}}