{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 318, "word_counts": "{\"hola\": 1, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"quien\": 2, \"eres\": 6, \"tu\": 4, \"que\": 50, \"haces\": 1, \"cual\": 1, \"es\": 29, \"funcion\": 17, \"describeme\": 26, \"funcionalidad\": 1, \"como\": 138, \"funcionas\": 1, \"tipo\": 2, \"de\": 91, \"bot\": 1, \"dime\": 11, \"explicame\": 32, \"en\": 142, \"me\": 2, \"puedes\": 6, \"ayudar\": 1, \"estas\": 2, \"te\": 3, \"encuentras\": 1, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"la\": 33, \"programacion\": 22, \"funciona\": 26, \"define\": 28, \"un\": 150, \"algoritmo\": 48, \"lenguaje\": 6, \"una\": 72, \"variable\": 16, \"constante\": 11, \"ciclo\": 22, \"for\": 16, \"condicion\": 11, \"if\": 16, \"bucle\": 12, \"while\": 16, \"clase\": 16, \"objeto\": 11, \"el\": 20, \"polimorfismo\": 11, \"herencia\": 11, \"encapsulamiento\": 11, \"abstraccion\": 5, \"orientado\": 5, \"a\": 9, \"objetos\": 5, \"poo\": 5, \"lenguajes\": 9, \"existen\": 2, \"deberia\": 1, \"aprender\": 1, \"cuales\": 2, \"son\": 2, \"los\": 3, \"mas\": 2, \"populares\": 2, \"dame\": 28, \"listado\": 1, \"sabes\": 2, \"conoces\": 2, \"para\": 3, \"programar\": 3, \"soportas\": 1, \"entiendes\": 2, \"python\": 114, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"ejecuto\": 3, \"mi\": 8, \"programa\": 11, \"corro\": 1, \"pruebo\": 1, \"app\": 1, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"ayudame\": 1, \"crear\": 3, \"puedo\": 6, \"empezar\": 1, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 13, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 29, \"del\": 2, \"algoritmos\": 4, \"con\": 19, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 9, \"ordenamiento\": 23, \"grafos\": 9, \"arboles\": 9, \"burbuja\": 9, \"quicksort\": 9, \"ensename\": 7, \"codigo\": 6, \"ejemplifica\": 6, \"javascript\": 50, \"definicion\": 1, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 2, \"instalar\": 1, \"decirme\": 2, \"obtener\": 1, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"pasos\": 2, \"debo\": 2, \"seguir\": 2, \"se\": 12, \"ejecuta\": 1, \"inicializa\": 1, \"crea\": 3, \"diferencia\": 3, \"hay\": 1, \"entre\": 4, \"var\": 5, \"let\": 5, \"y\": 5, \"const\": 5, \"las\": 1, \"diferencias\": 1, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 7, \"escribe\": 3, \"\\u00bfpuedes\": 1, \"ense\\u00f1arme\": 1, \"podrias\": 2, \"darme\": 1, \"usar\": 2, \"tienes\": 1, \"algun\": 1, \"implementar\": 1, \"sentencia\": 1, \"muestrame\": 2, \"definir\": 2}", "word_docs": "{\"hola\": 1, \"dias\": 1, \"buenos\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"quien\": 2, \"tu\": 4, \"eres\": 6, \"que\": 50, \"haces\": 1, \"es\": 29, \"funcion\": 17, \"cual\": 1, \"funcionalidad\": 1, \"describeme\": 26, \"como\": 138, \"funcionas\": 1, \"tipo\": 2, \"bot\": 1, \"de\": 79, \"dime\": 11, \"explicame\": 32, \"puedes\": 6, \"en\": 142, \"ayudar\": 1, \"me\": 2, \"estas\": 2, \"te\": 3, \"encuentras\": 1, \"sientes\": 1, \"va\": 1, \"tal\": 1, \"programacion\": 22, \"la\": 33, \"funciona\": 26, \"define\": 28, \"algoritmo\": 48, \"un\": 130, \"lenguaje\": 6, \"variable\": 16, \"una\": 72, \"constante\": 11, \"for\": 16, \"ciclo\": 22, \"condicion\": 11, \"if\": 16, \"while\": 16, \"bucle\": 12, \"clase\": 16, \"objeto\": 11, \"polimorfismo\": 11, \"el\": 20, \"herencia\": 11, \"encapsulamiento\": 11, \"abstraccion\": 5, \"orientado\": 5, \"a\": 9, \"objetos\": 5, \"poo\": 5, \"existen\": 2, \"lenguajes\": 9, \"aprender\": 1, \"deberia\": 1, \"mas\": 2, \"son\": 2, \"populares\": 2, \"los\": 3, \"cuales\": 2, \"listado\": 1, \"dame\": 28, \"sabes\": 2, \"conoces\": 2, \"para\": 3, \"programar\": 3, \"soportas\": 1, \"entiendes\": 2, \"python\": 114, \"instalo\": 2, \"obtengo\": 1, \"descargo\": 1, \"programa\": 11, \"ejecuto\": 3, \"mi\": 8, \"corro\": 1, \"pruebo\": 1, \"app\": 1, \"aplicacion\": 1, \"empiezo\": 1, \"inicio\": 1, \"crear\": 3, \"ayudame\": 1, \"puedo\": 6, \"empezar\": 1, \"iniciar\": 1, \"defino\": 13, \"declaro\": 13, \"creo\": 13, \"asigno\": 12, \"inicializo\": 12, \"ejemplo\": 29, \"del\": 2, \"algoritmos\": 4, \"con\": 19, \"ensenar\": 1, \"manejas\": 1, \"busqueda\": 9, \"ordenamiento\": 23, \"grafos\": 9, \"arboles\": 9, \"burbuja\": 9, \"quicksort\": 9, \"ensename\": 7, \"codigo\": 6, \"ejemplifica\": 6, \"javascript\": 50, \"definicion\": 1, \"cuentame\": 1, \"acerca\": 1, \"explicarme\": 2, \"instalar\": 1, \"obtener\": 1, \"decirme\": 2, \"descargar\": 2, \"correr\": 2, \"ejecutar\": 2, \"debo\": 2, \"pasos\": 2, \"seguir\": 2, \"ejecuta\": 1, \"se\": 12, \"inicializa\": 1, \"crea\": 3, \"entre\": 4, \"hay\": 1, \"let\": 5, \"y\": 5, \"const\": 5, \"diferencia\": 3, \"var\": 5, \"las\": 1, \"diferencias\": 1, \"diferencian\": 1, \"explicar\": 1, \"escribir\": 7, \"escribe\": 3, \"ense\\u00f1arme\": 1, \"\\u00bfpuedes\": 1, \"darme\": 1, \"podrias\": 2, \"usar\": 2, \"tienes\": 1, \"algun\": 1, \"implementar\": 1, \"sentencia\": 1, \"muestrame\": 2, \"definir\": 2}", "index_docs": "{\"108\": 1, \"110\": 1, \"109\": 1, \"81\": 2, \"111\": 1, \"112\": 1, \"82\": 2, \"69\": 4, \"55\": 6, \"8\": 50, \"113\": 1, \"13\": 29, \"24\": 17, \"114\": 1, \"115\": 1, \"17\": 26, \"4\": 138, \"116\": 1, \"83\": 2, \"117\": 1, \"6\": 79, \"37\": 11, \"12\": 32, \"56\": 6, \"3\": 142, \"118\": 1, \"84\": 2, \"85\": 2, \"72\": 3, \"119\": 1, \"120\": 1, \"121\": 1, \"122\": 1, \"20\": 22, \"11\": 33, \"18\": 26, \"15\": 28, \"10\": 48, \"2\": 130, \"57\": 6, \"25\": 16, \"7\": 72, \"38\": 11, \"26\": 16, \"21\": 22, \"39\": 11, \"27\": 16, \"28\": 16, \"33\": 12, \"29\": 16, \"40\": 11, \"41\": 11, \"22\": 20, \"42\": 11, \"43\": 11, \"61\": 5, \"62\": 5, \"45\": 9, \"63\": 5, \"64\": 5, \"86\": 2, \"46\": 9, \"124\": 1, \"123\": 1, \"89\": 2, \"88\": 2, \"90\": 2, \"73\": 3, \"87\": 2, \"125\": 1, \"16\": 28, \"91\": 2, \"92\": 2, \"74\": 3, \"75\": 3, \"126\": 1, \"93\": 2, \"5\": 114, \"94\": 2, \"127\": 1, \"128\": 1, \"44\": 11, \"76\": 3, \"52\": 8, \"129\": 1, \"130\": 1, \"131\": 1, \"132\": 1, \"133\": 1, \"134\": 1, \"77\": 3, \"135\": 1, \"58\": 6, \"136\": 1, \"137\": 1, \"30\": 13, \"31\": 13, \"32\": 13, \"34\": 12, \"35\": 12, \"14\": 29, \"95\": 2, \"70\": 4, \"23\": 19, \"138\": 1, \"139\": 1, \"47\": 9, \"19\": 23, \"48\": 9, \"49\": 9, \"50\": 9, \"51\": 9, \"53\": 7, \"59\": 6, \"60\": 6, \"9\": 50, \"140\": 1, \"141\": 1, \"142\": 1, \"96\": 2, \"143\": 1, \"144\": 1, \"97\": 2, \"98\": 2, \"99\": 2, \"100\": 2, \"102\": 2, \"101\": 2, \"103\": 2, \"145\": 1, \"36\": 12, \"146\": 1, \"78\": 3, \"71\": 4, \"147\": 1, \"66\": 5, \"67\": 5, \"68\": 5, \"79\": 3, \"65\": 5, \"148\": 1, \"149\": 1, \"150\": 1, \"151\": 1, \"54\": 7, \"80\": 3, \"153\": 1, \"152\": 1, \"154\": 1, \"104\": 2, \"105\": 2, \"155\": 1, \"156\": 1, \"157\": 1, \"158\": 1, \"106\": 2, \"107\": 2}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"un\", \"3\": \"en\", \"4\": \"como\", \"5\": \"python\", \"6\": \"de\", \"7\": \"una\", \"8\": \"que\", \"9\": \"javascript\", \"10\": \"algoritmo\", \"11\": \"la\", \"12\": \"explicame\", \"13\": \"es\", \"14\": \"ejemplo\", \"15\": \"define\", \"16\": \"dame\", \"17\": \"describeme\", \"18\": \"funciona\", \"19\": \"ordenamiento\", \"20\": \"programacion\", \"21\": \"ciclo\", \"22\": \"el\", \"23\": \"con\", \"24\": \"funcion\", \"25\": \"variable\", \"26\": \"for\", \"27\": \"if\", \"28\": \"while\", \"29\": \"clase\", \"30\": \"defino\", \"31\": \"declaro\", \"32\": \"creo\", \"33\": \"bucle\", \"34\": \"asigno\", \"35\": \"inicializo\", \"36\": \"se\", \"37\": \"dime\", \"38\": \"constante\", \"39\": \"condicion\", \"40\": \"objeto\", \"41\": \"polimorfismo\", \"42\": \"herencia\", \"43\": \"encapsulamiento\", \"44\": \"programa\", \"45\": \"a\", \"46\": \"lenguajes\", \"47\": \"busqueda\", \"48\": \"grafos\", \"49\": \"arboles\", \"50\": \"burbuja\", \"51\": \"quicksort\", \"52\": \"mi\", \"53\": \"ensename\", \"54\": \"escribir\", \"55\": \"eres\", \"56\": \"puedes\", \"57\": \"lenguaje\", \"58\": \"puedo\", \"59\": \"codigo\", \"60\": \"ejemplifica\", \"61\": \"abstraccion\", \"62\": \"orientado\", \"63\": \"objetos\", \"64\": \"poo\", \"65\": \"var\", \"66\": \"let\", \"67\": \"y\", \"68\": \"const\", \"69\": \"tu\", \"70\": \"algoritmos\", \"71\": \"entre\", \"72\": \"te\", \"73\": \"los\", \"74\": \"para\", \"75\": \"programar\", \"76\": \"ejecuto\", \"77\": \"crear\", \"78\": \"crea\", \"79\": \"diferencia\", \"80\": \"escribe\", \"81\": \"buenas\", \"82\": \"quien\", \"83\": \"tipo\", \"84\": \"me\", \"85\": \"estas\", \"86\": \"existen\", \"87\": \"cuales\", \"88\": \"son\", \"89\": \"mas\", \"90\": \"populares\", \"91\": \"sabes\", \"92\": \"conoces\", \"93\": \"entiendes\", \"94\": \"instalo\", \"95\": \"del\", \"96\": \"explicarme\", \"97\": \"decirme\", \"98\": \"descargar\", \"99\": \"correr\", \"100\": \"ejecutar\", \"101\": \"pasos\", \"102\": \"debo\", \"103\": \"seguir\", \"104\": \"podrias\", \"105\": \"usar\", \"106\": \"muestrame\", \"107\": \"definir\", \"108\": \"hola\", \"109\": \"buenos\", \"110\": \"dias\", \"111\": \"tardes\", \"112\": \"noches\", \"113\": \"haces\", \"114\": \"cual\", \"115\": \"funcionalidad\", \"116\": \"funcionas\", \"117\": \"bot\", \"118\": \"ayudar\", \"119\": \"encuentras\", \"120\": \"sientes\", \"121\": \"va\", \"122\": \"tal\", \"123\": \"deberia\", \"124\": \"aprender\", \"125\": \"listado\", \"126\": \"soportas\", \"127\": \"obtengo\", \"128\": \"descargo\", \"129\": \"corro\", \"130\": \"pruebo\", \"131\": \"app\", \"132\": \"aplicacion\", \"133\": \"empiezo\", \"134\": \"inicio\", \"135\": \"ayudame\", \"136\": \"empezar\", \"137\": \"iniciar\", \"138\": \"ensenar\", \"139\": \"manejas\", \"140\": \"definicion\", \"141\": \"cuentame\", \"142\": \"acerca\", \"143\": \"instalar\", \"144\": \"obtener\", \"145\": \"ejecuta\", \"146\": \"inicializa\", \"147\": \"hay\", \"148\": \"las\", \"149\": \"diferencias\", \"150\": \"diferencian\", \"151\": \"explicar\", \"152\": \"\\u00bfpuedes\", \"153\": \"ense\\u00f1arme\", \"154\": \"darme\", \"155\": \"tienes\", \"156\": \"algun\", \"157\": \"implementar\", \"158\": \"sentencia\"}", "word_index": "{\"<OOV>\": 1, \"un\": 2, \"en\": 3, \"como\": 4, \"python\": 5, \"de\": 6, \"una\": 7, \"que\": 8, \"javascript\": 9, \"algoritmo\": 10, \"la\": 11, \"explicame\": 12, \"es\": 13, \"ejemplo\": 14, \"define\": 15, \"dame\": 16, \"describeme\": 17, \"funciona\": 18, \"ordenamiento\": 19, \"programacion\": 20, \"ciclo\": 21, \"el\": 22, \"con\": 23, \"funcion\": 24, \"variable\": 25, \"for\": 26, \"if\": 27, \"while\": 28, \"clase\": 29, \"defino\": 30, \"declaro\": 31, \"creo\": 32, \"bucle\": 33, \"asigno\": 34, \"inicializo\": 35, \"se\": 36, \"dime\": 37, \"constante\": 38, \"condicion\": 39, \"objeto\": 40, \"polimorfismo\": 41, \"herencia\": 42, \"encapsulamiento\": 43, \"programa\": 44, \"a\": 45, \"lenguajes\": 46, \"busqueda\": 47, \"grafos\": 48, \"arboles\": 49, \"burbuja\": 50, \"quicksort\": 51, \"mi\": 52, \"ensename\": 53, \"escribir\": 54, \"eres\": 55, \"puedes\": 56, \"lenguaje\": 57, \"puedo\": 58, \"codigo\": 59, \"ejemplifica\": 60, \"abstraccion\": 61, \"orientado\": 62, \"objetos\": 63, \"poo\": 64, \"var\": 65, \"let\": 66, \"y\": 67, \"const\": 68, \"tu\": 69, \"algoritmos\": 70, \"entre\": 71, \"te\": 72, \"los\": 73, \"para\": 74, \"programar\": 75, \"ejecuto\": 76, \"crear\": 77, \"crea\": 78, \"diferencia\": 79, \"escribe\": 80, \"buenas\": 81, \"quien\": 82, \"tipo\": 83, \"me\": 84, \"estas\": 85, \"existen\": 86, \"cuales\": 87, \"son\": 88, \"mas\": 89, \"populares\": 90, \"sabes\": 91, \"conoces\": 92, \"entiendes\": 93, \"instalo\": 94, \"del\": 95, \"explicarme\": 96, \"decirme\": 97, \"descargar\": 98, \"correr\": 99, \"ejecutar\": 100, \"pasos\": 101, \"debo\": 102, \"seguir\": 103, \"podrias\": 104, \"usar\": 105, \"muestrame\": 106, \"definir\": 107, \"hola\": 108, \"buenos\": 109, \"dias\": 110, \"tardes\": 111, \"noches\": 112, \"haces\": 113, \"cual\": 114, \"funcionalidad\": 115, \"funcionas\": 116, \"bot\": 117, \"ayudar\": 118, \"encuentras\": 119, \"sientes\": 120, \"va\": 121, \"tal\": 122, \"deberia\": 123, \"aprender\": 124, \"listado\": 125, \"soportas\": 126, \"obtengo\": 127, \"descargo\": 128, \"corro\": 129, \"pruebo\": 130, \"app\": 131, \"aplicacion\": 132, \"empiezo\": 133, \"inicio\": 134, \"ayudame\": 135, \"empezar\": 136, \"iniciar\": 137, \"ensenar\": 138, \"manejas\": 139, \"definicion\": 140, \"cuentame\": 141, \"acerca\": 142, \"instalar\": 143, \"obtener\": 144, \"ejecuta\": 145, \"inicializa\": 146, \"hay\": 147, \"las\": 148, \"diferencias\": 149, \"diferencian\": 150, \"explicar\": 151, \"\\u00bfpuedes\": 152, \"ense\\u00f1arme\": 153, \"darme\": 154, \"tienes\": 155, \"algun\": 156, \"implementar\": 157, \"sentencia\": 158}"}}