{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 50, "word_counts": "{\"hola\": 3, \"hey\": 1, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 5, \"est\\u00e1s\": 2, \"que\": 1, \"tal\": 4, \"saludos\": 1, \"\\u00bfqu\\u00e9\": 6, \"hi\": 1, \"tu\": 3, \"d\\u00eda\": 1, \"te\": 3, \"encuentras\": 1, \"todo\": 5, \"va\": 2, \"has\": 1, \"hecho\": 1, \"\\u00bftodo\": 1, \"bien\": 7, \"me\": 4, \"cuentas\": 1, \"hay\": 1, \"de\": 1, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"\\u00bfy\": 1, \"t\\u00fa\": 1, \"perfecto\": 1, \"bastante\": 1, \"por\": 3, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adi\\u00f3s\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 1, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 1, \"tiempo\": 1, \"se\": 1, \"agradece\": 1}", "word_docs": "{\"hola\": 3, \"hey\": 1, \"d\\u00edas\": 1, \"buenos\": 1, \"tardes\": 1, \"buenas\": 2, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 5, \"est\\u00e1s\": 2, \"tal\": 4, \"que\": 1, \"saludos\": 1, \"\\u00bfqu\\u00e9\": 6, \"hi\": 1, \"d\\u00eda\": 1, \"tu\": 3, \"encuentras\": 1, \"te\": 3, \"todo\": 5, \"va\": 2, \"hecho\": 1, \"has\": 1, \"bien\": 7, \"\\u00bftodo\": 1, \"cuentas\": 1, \"me\": 4, \"hay\": 1, \"nuevo\": 1, \"de\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"\\u00bfy\": 1, \"t\\u00fa\": 1, \"perfecto\": 1, \"bastante\": 1, \"preguntar\": 1, \"por\": 3, \"quejo\": 1, \"no\": 1, \"genial\": 1, \"adi\\u00f3s\": 1, \"luego\": 2, \"hasta\": 3, \"vemos\": 2, \"nos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 1, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"ayuda\": 1, \"aprecio\": 1, \"thanks\": 1, \"tiempo\": 1, \"se\": 1, \"agradece\": 1}", "index_docs": "{\"9\": 3, \"21\": 1, \"23\": 1, \"22\": 1, \"24\": 1, \"14\": 2, \"25\": 1, \"5\": 5, \"15\": 2, \"7\": 4, \"26\": 1, \"27\": 1, \"4\": 6, \"28\": 1, \"29\": 1, \"10\": 3, \"30\": 1, \"11\": 3, \"6\": 5, \"16\": 2, \"32\": 1, \"31\": 1, \"2\": 7, \"33\": 1, \"34\": 1, \"8\": 4, \"35\": 1, \"37\": 1, \"36\": 1, \"3\": 7, \"17\": 2, \"38\": 1, \"39\": 1, \"40\": 1, \"41\": 1, \"42\": 1, \"43\": 1, \"12\": 3, \"45\": 1, \"44\": 1, \"46\": 1, \"47\": 1, \"18\": 2, \"13\": 3, \"20\": 2, \"19\": 2, \"48\": 1, \"49\": 1, \"50\": 1, \"51\": 1, \"52\": 1, \"53\": 1, \"54\": 1, \"55\": 1, \"56\": 1, \"57\": 1, \"58\": 1, \"60\": 1, \"59\": 1, \"61\": 1, \"62\": 1, \"63\": 1, \"64\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"bien\", \"3\": \"gracias\", \"4\": \"\\u00bfqu\\u00e9\", \"5\": \"\\u00bfc\\u00f3mo\", \"6\": \"todo\", \"7\": \"tal\", \"8\": \"me\", \"9\": \"hola\", \"10\": \"tu\", \"11\": \"te\", \"12\": \"por\", \"13\": \"hasta\", \"14\": \"buenas\", \"15\": \"est\\u00e1s\", \"16\": \"va\", \"17\": \"muy\", \"18\": \"luego\", \"19\": \"nos\", \"20\": \"vemos\", \"21\": \"hey\", \"22\": \"buenos\", \"23\": \"d\\u00edas\", \"24\": \"tardes\", \"25\": \"noches\", \"26\": \"que\", \"27\": \"saludos\", \"28\": \"hi\", \"29\": \"d\\u00eda\", \"30\": \"encuentras\", \"31\": \"has\", \"32\": \"hecho\", \"33\": \"\\u00bftodo\", \"34\": \"cuentas\", \"35\": \"hay\", \"36\": \"de\", \"37\": \"nuevo\", \"38\": \"excelente\", \"39\": \"\\u00bfy\", \"40\": \"t\\u00fa\", \"41\": \"perfecto\", \"42\": \"bastante\", \"43\": \"preguntar\", \"44\": \"no\", \"45\": \"quejo\", \"46\": \"genial\", \"47\": \"adi\\u00f3s\", \"48\": \"chao\", \"49\": \"pronto\", \"50\": \"voy\", \"51\": \"bye\", \"52\": \"ma\\u00f1ana\", \"53\": \"despido\", \"54\": \"muchas\", \"55\": \"lo\", \"56\": \"agradezco\", \"57\": \"mil\", \"58\": \"amable\", \"59\": \"aprecio\", \"60\": \"ayuda\", \"61\": \"thanks\", \"62\": \"tiempo\", \"63\": \"se\", \"64\": \"agradece\"}", "word_index": "{\"<OOV>\": 1, \"bien\": 2, \"gracias\": 3, \"\\u00bfqu\\u00e9\": 4, \"\\u00bfc\\u00f3mo\": 5, \"todo\": 6, \"tal\": 7, \"me\": 8, \"hola\": 9, \"tu\": 10, \"te\": 11, \"por\": 12, \"hasta\": 13, \"buenas\": 14, \"est\\u00e1s\": 15, \"va\": 16, \"muy\": 17, \"luego\": 18, \"nos\": 19, \"vemos\": 20, \"hey\": 21, \"buenos\": 22, \"d\\u00edas\": 23, \"tardes\": 24, \"noches\": 25, \"que\": 26, \"saludos\": 27, \"hi\": 28, \"d\\u00eda\": 29, \"encuentras\": 30, \"has\": 31, \"hecho\": 32, \"\\u00bftodo\": 33, \"cuentas\": 34, \"hay\": 35, \"de\": 36, \"nuevo\": 37, \"excelente\": 38, \"\\u00bfy\": 39, \"t\\u00fa\": 40, \"perfecto\": 41, \"bastante\": 42, \"preguntar\": 43, \"no\": 44, \"quejo\": 45, \"genial\": 46, \"adi\\u00f3s\": 47, \"chao\": 48, \"pronto\": 49, \"voy\": 50, \"bye\": 51, \"ma\\u00f1ana\": 52, \"despido\": 53, \"muchas\": 54, \"lo\": 55, \"agradezco\": 56, \"mil\": 57, \"amable\": 58, \"aprecio\": 59, \"ayuda\": 60, \"thanks\": 61, \"tiempo\": 62, \"se\": 63, \"agradece\": 64}"}}