{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 143, "word_counts": "{\"hola\": 3, \"hey\": 1, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 5, \"est\\u00e1s\": 2, \"que\": 39, \"tal\": 4, \"saludos\": 1, \"\\u00bfqu\\u00e9\": 8, \"hi\": 1, \"tu\": 4, \"d\\u00eda\": 1, \"te\": 3, \"encuentras\": 1, \"todo\": 5, \"va\": 2, \"has\": 1, \"hecho\": 1, \"\\u00bftodo\": 1, \"bien\": 7, \"me\": 6, \"cuentas\": 1, \"hay\": 2, \"de\": 21, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"\\u00bfy\": 1, \"t\\u00fa\": 1, \"perfecto\": 1, \"bastante\": 1, \"por\": 3, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adi\\u00f3s\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 1, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 1, \"tiempo\": 1, \"se\": 3, \"agradece\": 1, \"es\": 21, \"la\": 4, \"programacion\": 5, \"define\": 2, \"en\": 8, \"terminos\": 2, \"creacion\": 1, \"software\": 1, \"describe\": 1, \"tecnicos\": 1, \"como\": 8, \"relaciona\": 1, \"con\": 5, \"el\": 6, \"hardware\": 1, \"una\": 17, \"variable\": 4, \"hace\": 6, \"valor\": 2, \"puede\": 1, \"cambiar\": 1, \"para\": 7, \"utiliza\": 1, \"un\": 13, \"condicional\": 1, \"if\": 3, \"tipo\": 1, \"instruccion\": 1, \"hacen\": 1, \"los\": 7, \"condicionales\": 1, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"ayudan\": 1, \"ciclos\": 2, \"aplicacion\": 1, \"importancia\": 2, \"tienen\": 2, \"programa\": 1, \"condiciones\": 1, \"debe\": 1, \"cumplir\": 1, \"ejecutarse\": 1, \"funcion\": 3, \"metodo\": 2, \"devuelve\": 1, \"diferencia\": 1, \"entre\": 1, \"y\": 2, \"las\": 2, \"funciones\": 1, \"metodos\": 1, \"oop\": 4, \"cuales\": 1, \"son\": 5, \"caracteristicas\": 1, \"del\": 1, \"recomendable\": 1, \"usar\": 1, \"tan\": 1, \"popular\": 3, \"genero\": 1, \"peliculas\": 1, \"mas\": 2, \"cual\": 2, \"costo\": 1, \"promedio\": 1, \"hacer\": 3, \"pelicula\": 6, \"accion\": 1, \"recomendarias\": 1, \"cu\\u00e1l\": 1, \"pel\\u00edcula\": 1, \"m\\u00e1s\": 1, \"este\": 1, \"a\\u00f1o\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"tienes\": 2, \"algun\": 2, \"bueno\": 1, \"di\": 2, \"algo\": 3, \"gracioso\": 1, \"recomiendas\": 1, \"alguna\": 3, \"actividad\": 2, \"hoy\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 1, \"dia\": 1, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 1, \"darme\": 1, \"dame\": 2, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"ganas\": 1, \"comer\": 2, \"qu\\u00e9\": 14, \"sql\": 6, \"significa\": 7, \"c\\u00f3mo\": 2, \"definir\": 1, \"representa\": 1, \"tipos\": 4, \"bases\": 7, \"datos\": 3, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"\\u00bfcu\\u00e1les\": 1, \"cu\\u00e1les\": 1, \"tabla\": 4, \"sirve\": 3, \"table\": 1, \"select\": 4, \"funciona\": 5, \"consultas\": 1, \"where\": 4, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 5, \"comando\": 2, \"update\": 5, \"delete\": 3, \"elimino\": 2, \"registros\": 1, \"saldre\": 4, \"unos\": 1, \"amigos\": 4, \"a\": 3, \"tomar\": 1, \"concierto\": 1}", "word_docs": "{\"hola\": 3, \"hey\": 1, \"d\\u00edas\": 1, \"buenos\": 1, \"tardes\": 1, \"buenas\": 2, \"noches\": 1, \"est\\u00e1s\": 2, \"\\u00bfc\\u00f3mo\": 5, \"que\": 39, \"tal\": 4, \"saludos\": 1, \"\\u00bfqu\\u00e9\": 8, \"hi\": 1, \"d\\u00eda\": 1, \"tu\": 4, \"te\": 3, \"encuentras\": 1, \"todo\": 5, \"va\": 2, \"hecho\": 1, \"has\": 1, \"bien\": 7, \"\\u00bftodo\": 1, \"me\": 6, \"cuentas\": 1, \"nuevo\": 1, \"hay\": 2, \"de\": 18, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"t\\u00fa\": 1, \"\\u00bfy\": 1, \"perfecto\": 1, \"bastante\": 1, \"por\": 3, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adi\\u00f3s\": 1, \"luego\": 2, \"hasta\": 3, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 1, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 1, \"tiempo\": 1, \"se\": 3, \"agradece\": 1, \"programacion\": 5, \"la\": 4, \"es\": 21, \"en\": 7, \"define\": 2, \"software\": 1, \"creacion\": 1, \"terminos\": 2, \"describe\": 1, \"tecnicos\": 1, \"el\": 6, \"relaciona\": 1, \"como\": 8, \"hardware\": 1, \"con\": 5, \"variable\": 4, \"una\": 16, \"hace\": 6, \"puede\": 1, \"cambiar\": 1, \"valor\": 2, \"utiliza\": 1, \"para\": 7, \"un\": 12, \"condicional\": 1, \"if\": 3, \"tipo\": 1, \"instruccion\": 1, \"hacen\": 1, \"condicionales\": 1, \"los\": 7, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"ciclos\": 2, \"ayudan\": 1, \"aplicacion\": 1, \"tienen\": 2, \"importancia\": 2, \"programa\": 1, \"cumplir\": 1, \"condiciones\": 1, \"debe\": 1, \"ejecutarse\": 1, \"funcion\": 3, \"metodo\": 2, \"devuelve\": 1, \"entre\": 1, \"y\": 2, \"diferencia\": 1, \"funciones\": 1, \"las\": 2, \"metodos\": 1, \"oop\": 4, \"cuales\": 1, \"del\": 1, \"son\": 5, \"caracteristicas\": 1, \"usar\": 1, \"recomendable\": 1, \"popular\": 3, \"tan\": 1, \"peliculas\": 1, \"mas\": 2, \"genero\": 1, \"cual\": 2, \"promedio\": 1, \"hacer\": 3, \"costo\": 1, \"pelicula\": 6, \"recomendarias\": 1, \"accion\": 1, \"a\\u00f1o\": 1, \"cu\\u00e1l\": 1, \"este\": 1, \"pel\\u00edcula\": 1, \"m\\u00e1s\": 1, \"chiste\": 3, \"cuentame\": 1, \"dime\": 2, \"tienes\": 2, \"bueno\": 1, \"algun\": 2, \"gracioso\": 1, \"algo\": 3, \"di\": 2, \"hoy\": 2, \"alguna\": 3, \"recomiendas\": 1, \"actividad\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 1, \"divertido\": 1, \"dia\": 1, \"dialogo\": 3, \"podrias\": 1, \"darme\": 1, \"frase\": 1, \"dame\": 2, \"preparar\": 2, \"comida\": 3, \"recomiendame\": 1, \"pueda\": 1, \"comer\": 2, \"tengo\": 1, \"ganas\": 1, \"qu\\u00e9\": 14, \"sql\": 6, \"significa\": 7, \"definir\": 1, \"c\\u00f3mo\": 2, \"representa\": 1, \"tipos\": 4, \"existen\": 4, \"datos\": 3, \"bases\": 7, \"modelos\": 1, \"clases\": 1, \"\\u00bfcu\\u00e1les\": 1, \"cu\\u00e1les\": 1, \"tabla\": 4, \"sirve\": 3, \"table\": 1, \"select\": 4, \"funciona\": 5, \"consultas\": 1, \"where\": 4, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 5, \"comando\": 2, \"update\": 5, \"delete\": 3, \"elimino\": 2, \"registros\": 1, \"amigos\": 4, \"unos\": 1, \"saldre\": 4, \"tomar\": 1, \"a\": 3, \"concierto\": 1}", "index_docs": "{\"43\": 3, \"95\": 1, \"97\": 1, \"96\": 1, \"98\": 1, \"61\": 2, \"99\": 1, \"62\": 2, \"22\": 5, \"2\": 39, \"30\": 4, \"100\": 1, \"8\": 8, \"101\": 1, \"102\": 1, \"31\": 4, \"44\": 3, \"103\": 1, \"23\": 5, \"63\": 2, \"105\": 1, \"104\": 1, \"11\": 7, \"106\": 1, \"17\": 6, \"107\": 1, \"108\": 1, \"64\": 2, \"3\": 18, \"12\": 7, \"65\": 2, \"109\": 1, \"111\": 1, \"110\": 1, \"112\": 1, \"113\": 1, \"45\": 3, \"114\": 1, \"115\": 1, \"116\": 1, \"117\": 1, \"118\": 1, \"66\": 2, \"46\": 3, \"67\": 2, \"68\": 2, \"119\": 1, \"120\": 1, \"121\": 1, \"122\": 1, \"123\": 1, \"124\": 1, \"125\": 1, \"126\": 1, \"127\": 1, \"128\": 1, \"129\": 1, \"130\": 1, \"131\": 1, \"132\": 1, \"133\": 1, \"47\": 3, \"134\": 1, \"24\": 5, \"32\": 4, \"4\": 21, \"9\": 7, \"69\": 2, \"136\": 1, \"135\": 1, \"70\": 2, \"137\": 1, \"138\": 1, \"18\": 6, \"139\": 1, \"10\": 8, \"140\": 1, \"25\": 5, \"33\": 4, \"5\": 16, \"19\": 6, \"141\": 1, \"142\": 1, \"71\": 2, \"143\": 1, \"13\": 7, \"7\": 12, \"144\": 1, \"48\": 3, \"145\": 1, \"146\": 1, \"147\": 1, \"148\": 1, \"14\": 7, \"149\": 1, \"150\": 1, \"72\": 2, \"73\": 2, \"151\": 1, \"152\": 1, \"75\": 2, \"74\": 2, \"153\": 1, \"156\": 1, \"154\": 1, \"155\": 1, \"157\": 1, \"49\": 3, \"76\": 2, \"158\": 1, \"160\": 1, \"77\": 2, \"159\": 1, \"161\": 1, \"78\": 2, \"162\": 1, \"34\": 4, \"163\": 1, \"165\": 1, \"26\": 5, \"164\": 1, \"167\": 1, \"166\": 1, \"50\": 3, \"168\": 1, \"170\": 1, \"79\": 2, \"169\": 1, \"80\": 2, \"172\": 1, \"51\": 3, \"171\": 1, \"20\": 6, \"174\": 1, \"173\": 1, \"179\": 1, \"175\": 1, \"178\": 1, \"176\": 1, \"177\": 1, \"52\": 3, \"180\": 1, \"81\": 2, \"82\": 2, \"181\": 1, \"83\": 2, \"182\": 1, \"53\": 3, \"84\": 2, \"86\": 2, \"54\": 3, \"183\": 1, \"85\": 2, \"35\": 4, \"87\": 2, \"184\": 1, \"185\": 1, \"187\": 1, \"186\": 1, \"55\": 3, \"188\": 1, \"189\": 1, \"190\": 1, \"88\": 2, \"89\": 2, \"56\": 3, \"191\": 1, \"192\": 1, \"90\": 2, \"193\": 1, \"194\": 1, \"6\": 14, \"21\": 6, \"15\": 7, \"195\": 1, \"91\": 2, \"196\": 1, \"36\": 4, \"37\": 4, \"57\": 3, \"16\": 7, \"197\": 1, \"198\": 1, \"199\": 1, \"200\": 1, \"38\": 4, \"58\": 3, \"201\": 1, \"39\": 4, \"27\": 5, \"202\": 1, \"40\": 4, \"203\": 1, \"92\": 2, \"204\": 1, \"205\": 1, \"28\": 5, \"93\": 2, \"29\": 5, \"59\": 3, \"94\": 2, \"206\": 1, \"42\": 4, \"207\": 1, \"41\": 4, \"208\": 1, \"60\": 3, \"209\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"que\", \"3\": \"de\", \"4\": \"es\", \"5\": \"una\", \"6\": \"qu\\u00e9\", \"7\": \"un\", \"8\": \"\\u00bfqu\\u00e9\", \"9\": \"en\", \"10\": \"como\", \"11\": \"bien\", \"12\": \"gracias\", \"13\": \"para\", \"14\": \"los\", \"15\": \"significa\", \"16\": \"bases\", \"17\": \"me\", \"18\": \"el\", \"19\": \"hace\", \"20\": \"pelicula\", \"21\": \"sql\", \"22\": \"\\u00bfc\\u00f3mo\", \"23\": \"todo\", \"24\": \"programacion\", \"25\": \"con\", \"26\": \"son\", \"27\": \"funciona\", \"28\": \"insert\", \"29\": \"update\", \"30\": \"tal\", \"31\": \"tu\", \"32\": \"la\", \"33\": \"variable\", \"34\": \"oop\", \"35\": \"podria\", \"36\": \"tipos\", \"37\": \"existen\", \"38\": \"tabla\", \"39\": \"select\", \"40\": \"where\", \"41\": \"saldre\", \"42\": \"amigos\", \"43\": \"hola\", \"44\": \"te\", \"45\": \"por\", \"46\": \"hasta\", \"47\": \"se\", \"48\": \"if\", \"49\": \"funcion\", \"50\": \"popular\", \"51\": \"hacer\", \"52\": \"chiste\", \"53\": \"algo\", \"54\": \"alguna\", \"55\": \"dialogo\", \"56\": \"comida\", \"57\": \"datos\", \"58\": \"sirve\", \"59\": \"delete\", \"60\": \"a\", \"61\": \"buenas\", \"62\": \"est\\u00e1s\", \"63\": \"va\", \"64\": \"hay\", \"65\": \"muy\", \"66\": \"luego\", \"67\": \"nos\", \"68\": \"vemos\", \"69\": \"define\", \"70\": \"terminos\", \"71\": \"valor\", \"72\": \"ciclo\", \"73\": \"ciclos\", \"74\": \"importancia\", \"75\": \"tienen\", \"76\": \"metodo\", \"77\": \"y\", \"78\": \"las\", \"79\": \"mas\", \"80\": \"cual\", \"81\": \"dime\", \"82\": \"tienes\", \"83\": \"algun\", \"84\": \"di\", \"85\": \"actividad\", \"86\": \"hoy\", \"87\": \"realizar\", \"88\": \"dame\", \"89\": \"preparar\", \"90\": \"comer\", \"91\": \"c\\u00f3mo\", \"92\": \"eres\", \"93\": \"comando\", \"94\": \"elimino\", \"95\": \"hey\", \"96\": \"buenos\", \"97\": \"d\\u00edas\", \"98\": \"tardes\", \"99\": \"noches\", \"100\": \"saludos\", \"101\": \"hi\", \"102\": \"d\\u00eda\", \"103\": \"encuentras\", \"104\": \"has\", \"105\": \"hecho\", \"106\": \"\\u00bftodo\", \"107\": \"cuentas\", \"108\": \"nuevo\", \"109\": \"excelente\", \"110\": \"\\u00bfy\", \"111\": \"t\\u00fa\", \"112\": \"perfecto\", \"113\": \"bastante\", \"114\": \"preguntar\", \"115\": \"no\", \"116\": \"quejo\", \"117\": \"genial\", \"118\": \"adi\\u00f3s\", \"119\": \"chao\", \"120\": \"pronto\", \"121\": \"voy\", \"122\": \"bye\", \"123\": \"ma\\u00f1ana\", \"124\": \"despido\", \"125\": \"muchas\", \"126\": \"lo\", \"127\": \"agradezco\", \"128\": \"mil\", \"129\": \"amable\", \"130\": \"aprecio\", \"131\": \"ayuda\", \"132\": \"thanks\", \"133\": \"tiempo\", \"134\": \"agradece\", \"135\": \"creacion\", \"136\": \"software\", \"137\": \"describe\", \"138\": \"tecnicos\", \"139\": \"relaciona\", \"140\": \"hardware\", \"141\": \"puede\", \"142\": \"cambiar\", \"143\": \"utiliza\", \"144\": \"condicional\", \"145\": \"tipo\", \"146\": \"instruccion\", \"147\": \"hacen\", \"148\": \"condicionales\", \"149\": \"toman\", \"150\": \"desiciones\", \"151\": \"ayudan\", \"152\": \"aplicacion\", \"153\": \"programa\", \"154\": \"condiciones\", \"155\": \"debe\", \"156\": \"cumplir\", \"157\": \"ejecutarse\", \"158\": \"devuelve\", \"159\": \"diferencia\", \"160\": \"entre\", \"161\": \"funciones\", \"162\": \"metodos\", \"163\": \"cuales\", \"164\": \"caracteristicas\", \"165\": \"del\", \"166\": \"recomendable\", \"167\": \"usar\", \"168\": \"tan\", \"169\": \"genero\", \"170\": \"peliculas\", \"171\": \"costo\", \"172\": \"promedio\", \"173\": \"accion\", \"174\": \"recomendarias\", \"175\": \"cu\\u00e1l\", \"176\": \"pel\\u00edcula\", \"177\": \"m\\u00e1s\", \"178\": \"este\", \"179\": \"a\\u00f1o\", \"180\": \"cuentame\", \"181\": \"bueno\", \"182\": \"gracioso\", \"183\": \"recomiendas\", \"184\": \"actividades\", \"185\": \"mi\", \"186\": \"dia\", \"187\": \"divertido\", \"188\": \"podrias\", \"189\": \"darme\", \"190\": \"frase\", \"191\": \"recomiendame\", \"192\": \"pueda\", \"193\": \"tengo\", \"194\": \"ganas\", \"195\": \"definir\", \"196\": \"representa\", \"197\": \"modelos\", \"198\": \"clases\", \"199\": \"\\u00bfcu\\u00e1les\", \"200\": \"cu\\u00e1les\", \"201\": \"table\", \"202\": \"consultas\", \"203\": \"filtros\", \"204\": \"quien\", \"205\": \"haces\", \"206\": \"registros\", \"207\": \"unos\", \"208\": \"tomar\", \"209\": \"concierto\"}", "word_index": "{\"<OOV>\": 1, \"que\": 2, \"de\": 3, \"es\": 4, \"una\": 5, \"qu\\u00e9\": 6, \"un\": 7, \"\\u00bfqu\\u00e9\": 8, \"en\": 9, \"como\": 10, \"bien\": 11, \"gracias\": 12, \"para\": 13, \"los\": 14, \"significa\": 15, \"bases\": 16, \"me\": 17, \"el\": 18, \"hace\": 19, \"pelicula\": 20, \"sql\": 21, \"\\u00bfc\\u00f3mo\": 22, \"todo\": 23, \"programacion\": 24, \"con\": 25, \"son\": 26, \"funciona\": 27, \"insert\": 28, \"update\": 29, \"tal\": 30, \"tu\": 31, \"la\": 32, \"variable\": 33, \"oop\": 34, \"podria\": 35, \"tipos\": 36, \"existen\": 37, \"tabla\": 38, \"select\": 39, \"where\": 40, \"saldre\": 41, \"amigos\": 42, \"hola\": 43, \"te\": 44, \"por\": 45, \"hasta\": 46, \"se\": 47, \"if\": 48, \"funcion\": 49, \"popular\": 50, \"hacer\": 51, \"chiste\": 52, \"algo\": 53, \"alguna\": 54, \"dialogo\": 55, \"comida\": 56, \"datos\": 57, \"sirve\": 58, \"delete\": 59, \"a\": 60, \"buenas\": 61, \"est\\u00e1s\": 62, \"va\": 63, \"hay\": 64, \"muy\": 65, \"luego\": 66, \"nos\": 67, \"vemos\": 68, \"define\": 69, \"terminos\": 70, \"valor\": 71, \"ciclo\": 72, \"ciclos\": 73, \"importancia\": 74, \"tienen\": 75, \"metodo\": 76, \"y\": 77, \"las\": 78, \"mas\": 79, \"cual\": 80, \"dime\": 81, \"tienes\": 82, \"algun\": 83, \"di\": 84, \"actividad\": 85, \"hoy\": 86, \"realizar\": 87, \"dame\": 88, \"preparar\": 89, \"comer\": 90, \"c\\u00f3mo\": 91, \"eres\": 92, \"comando\": 93, \"elimino\": 94, \"hey\": 95, \"buenos\": 96, \"d\\u00edas\": 97, \"tardes\": 98, \"noches\": 99, \"saludos\": 100, \"hi\": 101, \"d\\u00eda\": 102, \"encuentras\": 103, \"has\": 104, \"hecho\": 105, \"\\u00bftodo\": 106, \"cuentas\": 107, \"nuevo\": 108, \"excelente\": 109, \"\\u00bfy\": 110, \"t\\u00fa\": 111, \"perfecto\": 112, \"bastante\": 113, \"preguntar\": 114, \"no\": 115, \"quejo\": 116, \"genial\": 117, \"adi\\u00f3s\": 118, \"chao\": 119, \"pronto\": 120, \"voy\": 121, \"bye\": 122, \"ma\\u00f1ana\": 123, \"despido\": 124, \"muchas\": 125, \"lo\": 126, \"agradezco\": 127, \"mil\": 128, \"amable\": 129, \"aprecio\": 130, \"ayuda\": 131, \"thanks\": 132, \"tiempo\": 133, \"agradece\": 134, \"creacion\": 135, \"software\": 136, \"describe\": 137, \"tecnicos\": 138, \"relaciona\": 139, \"hardware\": 140, \"puede\": 141, \"cambiar\": 142, \"utiliza\": 143, \"condicional\": 144, \"tipo\": 145, \"instruccion\": 146, \"hacen\": 147, \"condicionales\": 148, \"toman\": 149, \"desiciones\": 150, \"ayudan\": 151, \"aplicacion\": 152, \"programa\": 153, \"condiciones\": 154, \"debe\": 155, \"cumplir\": 156, \"ejecutarse\": 157, \"devuelve\": 158, \"diferencia\": 159, \"entre\": 160, \"funciones\": 161, \"metodos\": 162, \"cuales\": 163, \"caracteristicas\": 164, \"del\": 165, \"recomendable\": 166, \"usar\": 167, \"tan\": 168, \"genero\": 169, \"peliculas\": 170, \"costo\": 171, \"promedio\": 172, \"accion\": 173, \"recomendarias\": 174, \"cu\\u00e1l\": 175, \"pel\\u00edcula\": 176, \"m\\u00e1s\": 177, \"este\": 178, \"a\\u00f1o\": 179, \"cuentame\": 180, \"bueno\": 181, \"gracioso\": 182, \"recomiendas\": 183, \"actividades\": 184, \"mi\": 185, \"dia\": 186, \"divertido\": 187, \"podrias\": 188, \"darme\": 189, \"frase\": 190, \"recomiendame\": 191, \"pueda\": 192, \"tengo\": 193, \"ganas\": 194, \"definir\": 195, \"representa\": 196, \"modelos\": 197, \"clases\": 198, \"\\u00bfcu\\u00e1les\": 199, \"cu\\u00e1les\": 200, \"table\": 201, \"consultas\": 202, \"filtros\": 203, \"quien\": 204, \"haces\": 205, \"registros\": 206, \"unos\": 207, \"tomar\": 208, \"concierto\": 209}"}}