{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 150, "word_counts": "{\"hola\": 6, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 15, \"est\\u00e1s\": 1, \"hey\": 1, \"saludos\": 1, \"\\u00a1qu\\u00e9\": 2, \"gusto\": 1, \"verte\": 1, \"\\u00bfhay\": 1, \"alguien\": 2, \"ah\\u00ed\": 1, \"\\u00a1hola\": 3, \"te\": 6, \"va\": 5, \"\\u00bfpodemos\": 1, \"hablar\": 1, \"de\": 5, \"nuevo\": 3, \"bueno\": 1, \"encontrarte\": 1, \"espero\": 1, \"no\": 14, \"interrumpir\": 1, \"\\u00a1buen\": 1, \"d\\u00eda\": 3, \"soy\": 1, \"aqu\\u00ed\": 1, \"\\u00bfalguien\": 1, \"disponible\": 1, \"necesito\": 5, \"ayuda\": 4, \"\\u00bftienes\": 1, \"un\": 6, \"momento\": 1, \"\\u00bfest\\u00e1\": 1, \"para\": 1, \"ayudar\": 2, \"\\u00bfqu\\u00e9\": 20, \"tal\": 3, \"todo\": 5, \"hay\": 2, \"has\": 3, \"estado\": 2, \"\\u00bftodo\": 1, \"bien\": 3, \"me\": 16, \"cuentas\": 1, \"ha\": 2, \"ido\": 1, \"tu\": 7, \"la\": 6, \"vida\": 1, \"est\\u00e1\": 1, \"haces\": 1, \"\\u00bfen\": 1, \"qu\\u00e9\": 2, \"andas\": 1, \"haciendo\": 1, \"\\u00bfocupado\": 1, \"adi\\u00f3s\": 1, \"hasta\": 5, \"luego\": 3, \"nos\": 2, \"vemos\": 2, \"pronto\": 1, \"tengo\": 4, \"que\": 1, \"ir\": 1, \"debo\": 4, \"irme\": 1, \"pr\\u00f3xima\": 1, \"bye\": 1, \"sido\": 1, \"placer\": 1, \"despido\": 1, \"gracias\": 8, \"por\": 6, \"desconectarme\": 1, \"continuamos\": 1, \"despu\\u00e9s\": 1, \"hablamos\": 1, \"m\\u00e1s\": 4, \"tarde\": 2, \"voy\": 1, \"ahora\": 1, \"ma\\u00f1ana\": 1, \"salir\": 1, \"volver\\u00e9\": 1, \"dejo\": 1, \"muchas\": 1, \"lo\": 2, \"agradezco\": 2, \"aprecio\": 2, \"mil\": 1, \"eres\": 1, \"muy\": 3, \"amable\": 1, \"mucho\": 2, \"esto\": 5, \"s\\u00e9\": 3, \"c\\u00f3mo\": 2, \"agradecerte\": 1, \"una\": 6, \"excelente\": 1, \"tiempo\": 1, \"explicarme\": 2, \"ayudado\": 1, \"paciencia\": 1, \"estoy\": 9, \"feliz\": 1, \"siento\": 8, \"triste\": 1, \"preocupado\": 1, \"ansioso\": 1, \"emocionado\": 1, \"hoy\": 1, \"es\": 10, \"gran\": 1, \"agotado\": 1, \"genial\": 1, \"estresado\": 1, \"puedo\": 2, \"perdido\": 1, \"motivaci\\u00f3n\": 1, \"confundido\": 1, \"solo\": 1, \"animado\": 1, \"frustrado\": 1, \"cansado\": 1, \"optimista\": 1, \"\\u00bfpuedes\": 1, \"ayudarme\": 1, \"\\u00bfme\": 3, \"podr\\u00edas\": 1, \"duda\": 1, \"\\u00bfpodr\\u00edas\": 2, \"entiendo\": 1, \"funciona\": 7, \"orientaci\\u00f3n\": 1, \"das\": 1, \"mano\": 1, \"atascado\": 1, \"hacer\": 2, \"guiarme\": 1, \"consejo\": 2, \"ayudas\": 1, \"con\": 1, \"d\\u00f3nde\": 1, \"empezar\": 1, \"opinas\": 1, \"sobre\": 1, \"piensas\": 1, \"\\u00bfcu\\u00e1l\": 4, \"opini\\u00f3n\": 1, \"recomiendas\": 1, \"mejor\": 1, \"ves\": 2, \"prefieres\": 1, \"sugieres\": 1, \"dame\": 1, \"punto\": 1, \"vista\": 1, \"alternativas\": 1, \"diferencia\": 1, \"conviene\": 1, \"t\\u00fa\": 1, \"deber\\u00eda\": 1, \"python\": 1, \"expl\\u00edcame\": 1, \"javascript\": 1, \"api\": 1, \"uso\": 1, \"git\": 1, \"explica\": 4, \"poo\": 1, \"sql\": 1, \"docker\": 1, \"machine\": 1, \"learning\": 1, \"blockchain\": 1, \"internet\": 1, \"cloud\": 1, \"computing\": 1, \"big\": 1, \"data\": 1, \"devops\": 1, \"red\": 1, \"ciberseguridad\": 1, \"mi\": 1, \"c\\u00f3digo\": 1, \"error\": 2, \"compila\": 1, \"da\": 1, \"en\": 2, \"l\\u00ednea\": 1, \"\\u00bfpor\": 1, \"falla\": 2, \"encuentro\": 1, \"el\": 3, \"bug\": 1, \"sale\": 1, \"excepci\\u00f3n\": 1, \"se\": 2, \"conecta\": 1, \"a\": 1, \"base\": 1, \"datos\": 1, \"servidor\": 1, \"responde\": 1, \"aplicaci\\u00f3n\": 1, \"cuelga\": 1, \"deployear\": 1, \"test\": 1, \"producci\\u00f3n\": 1, \"memory\": 1, \"leak\": 1, \"performance\": 1, \"lenta\": 1}", "word_docs": "{\"hola\": 6, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 15, \"est\\u00e1s\": 1, \"hey\": 1, \"saludos\": 1, \"\\u00a1qu\\u00e9\": 2, \"verte\": 1, \"gusto\": 1, \"\\u00bfhay\": 1, \"ah\\u00ed\": 1, \"alguien\": 2, \"\\u00a1hola\": 3, \"va\": 5, \"te\": 6, \"\\u00bfpodemos\": 1, \"hablar\": 1, \"de\": 5, \"nuevo\": 3, \"bueno\": 1, \"encontrarte\": 1, \"no\": 14, \"espero\": 1, \"interrumpir\": 1, \"d\\u00eda\": 3, \"\\u00a1buen\": 1, \"aqu\\u00ed\": 1, \"soy\": 1, \"disponible\": 1, \"\\u00bfalguien\": 1, \"necesito\": 5, \"ayuda\": 4, \"momento\": 1, \"\\u00bftienes\": 1, \"un\": 6, \"ayudar\": 2, \"\\u00bfest\\u00e1\": 1, \"para\": 1, \"\\u00bfqu\\u00e9\": 20, \"tal\": 3, \"todo\": 5, \"hay\": 2, \"has\": 3, \"estado\": 2, \"bien\": 3, \"\\u00bftodo\": 1, \"me\": 16, \"cuentas\": 1, \"ha\": 2, \"ido\": 1, \"tu\": 7, \"la\": 6, \"vida\": 1, \"est\\u00e1\": 1, \"haces\": 1, \"andas\": 1, \"\\u00bfen\": 1, \"qu\\u00e9\": 2, \"haciendo\": 1, \"\\u00bfocupado\": 1, \"adi\\u00f3s\": 1, \"luego\": 3, \"hasta\": 5, \"vemos\": 2, \"nos\": 2, \"pronto\": 1, \"que\": 1, \"tengo\": 4, \"ir\": 1, \"irme\": 1, \"debo\": 4, \"pr\\u00f3xima\": 1, \"bye\": 1, \"sido\": 1, \"placer\": 1, \"despido\": 1, \"gracias\": 8, \"por\": 6, \"desconectarme\": 1, \"continuamos\": 1, \"despu\\u00e9s\": 1, \"hablamos\": 1, \"m\\u00e1s\": 4, \"tarde\": 2, \"ahora\": 1, \"voy\": 1, \"ma\\u00f1ana\": 1, \"salir\": 1, \"volver\\u00e9\": 1, \"dejo\": 1, \"muchas\": 1, \"agradezco\": 2, \"lo\": 2, \"aprecio\": 2, \"mil\": 1, \"muy\": 3, \"eres\": 1, \"amable\": 1, \"mucho\": 2, \"esto\": 5, \"s\\u00e9\": 3, \"agradecerte\": 1, \"c\\u00f3mo\": 2, \"una\": 6, \"excelente\": 1, \"tiempo\": 1, \"explicarme\": 2, \"ayudado\": 1, \"paciencia\": 1, \"feliz\": 1, \"estoy\": 9, \"siento\": 8, \"triste\": 1, \"preocupado\": 1, \"ansioso\": 1, \"emocionado\": 1, \"es\": 10, \"gran\": 1, \"hoy\": 1, \"agotado\": 1, \"genial\": 1, \"estresado\": 1, \"puedo\": 2, \"perdido\": 1, \"motivaci\\u00f3n\": 1, \"confundido\": 1, \"solo\": 1, \"animado\": 1, \"frustrado\": 1, \"cansado\": 1, \"optimista\": 1, \"ayudarme\": 1, \"\\u00bfpuedes\": 1, \"podr\\u00edas\": 1, \"\\u00bfme\": 3, \"duda\": 1, \"\\u00bfpodr\\u00edas\": 2, \"entiendo\": 1, \"funciona\": 7, \"orientaci\\u00f3n\": 1, \"mano\": 1, \"das\": 1, \"atascado\": 1, \"hacer\": 2, \"guiarme\": 1, \"consejo\": 2, \"con\": 1, \"ayudas\": 1, \"empezar\": 1, \"d\\u00f3nde\": 1, \"opinas\": 1, \"sobre\": 1, \"piensas\": 1, \"\\u00bfcu\\u00e1l\": 4, \"opini\\u00f3n\": 1, \"recomiendas\": 1, \"mejor\": 1, \"ves\": 2, \"prefieres\": 1, \"sugieres\": 1, \"vista\": 1, \"dame\": 1, \"punto\": 1, \"alternativas\": 1, \"diferencia\": 1, \"conviene\": 1, \"t\\u00fa\": 1, \"deber\\u00eda\": 1, \"python\": 1, \"expl\\u00edcame\": 1, \"javascript\": 1, \"api\": 1, \"uso\": 1, \"git\": 1, \"explica\": 4, \"poo\": 1, \"sql\": 1, \"docker\": 1, \"learning\": 1, \"machine\": 1, \"blockchain\": 1, \"internet\": 1, \"computing\": 1, \"cloud\": 1, \"big\": 1, \"data\": 1, \"devops\": 1, \"red\": 1, \"ciberseguridad\": 1, \"c\\u00f3digo\": 1, \"mi\": 1, \"error\": 2, \"compila\": 1, \"da\": 1, \"l\\u00ednea\": 1, \"en\": 2, \"falla\": 2, \"\\u00bfpor\": 1, \"bug\": 1, \"encuentro\": 1, \"el\": 3, \"sale\": 1, \"excepci\\u00f3n\": 1, \"datos\": 1, \"se\": 2, \"conecta\": 1, \"a\": 1, \"base\": 1, \"servidor\": 1, \"responde\": 1, \"cuelga\": 1, \"aplicaci\\u00f3n\": 1, \"deployear\": 1, \"test\": 1, \"producci\\u00f3n\": 1, \"memory\": 1, \"leak\": 1, \"lenta\": 1, \"performance\": 1}", "index_docs": "{\"12\": 6, \"67\": 1, \"68\": 1, \"41\": 2, \"69\": 1, \"70\": 1, \"4\": 15, \"71\": 1, \"72\": 1, \"73\": 1, \"42\": 2, \"75\": 1, \"74\": 1, \"76\": 1, \"77\": 1, \"43\": 2, \"30\": 3, \"18\": 5, \"13\": 6, \"78\": 1, \"79\": 1, \"19\": 5, \"31\": 3, \"80\": 1, \"81\": 1, \"5\": 14, \"82\": 1, \"83\": 1, \"32\": 3, \"84\": 1, \"86\": 1, \"85\": 1, \"88\": 1, \"87\": 1, \"20\": 5, \"24\": 4, \"90\": 1, \"89\": 1, \"14\": 6, \"44\": 2, \"91\": 1, \"92\": 1, \"2\": 20, \"33\": 3, \"21\": 5, \"45\": 2, \"34\": 3, \"46\": 2, \"35\": 3, \"93\": 1, \"3\": 16, \"94\": 1, \"47\": 2, \"95\": 1, \"10\": 7, \"15\": 6, \"96\": 1, \"97\": 1, \"98\": 1, \"100\": 1, \"99\": 1, \"48\": 2, \"101\": 1, \"102\": 1, \"103\": 1, \"36\": 3, \"22\": 5, \"50\": 2, \"49\": 2, \"104\": 1, \"105\": 1, \"25\": 4, \"106\": 1, \"107\": 1, \"26\": 4, \"108\": 1, \"109\": 1, \"110\": 1, \"111\": 1, \"112\": 1, \"8\": 8, \"16\": 6, \"113\": 1, \"114\": 1, \"115\": 1, \"116\": 1, \"27\": 4, \"51\": 2, \"118\": 1, \"117\": 1, \"119\": 1, \"120\": 1, \"121\": 1, \"122\": 1, \"123\": 1, \"53\": 2, \"52\": 2, \"54\": 2, \"124\": 1, \"37\": 3, \"125\": 1, \"126\": 1, \"55\": 2, \"23\": 5, \"38\": 3, \"127\": 1, \"56\": 2, \"17\": 6, \"128\": 1, \"129\": 1, \"57\": 2, \"130\": 1, \"131\": 1, \"132\": 1, \"7\": 9, \"9\": 8, \"133\": 1, \"134\": 1, \"135\": 1, \"136\": 1, \"6\": 10, \"138\": 1, \"137\": 1, \"139\": 1, \"140\": 1, \"141\": 1, \"58\": 2, \"142\": 1, \"143\": 1, \"144\": 1, \"145\": 1, \"146\": 1, \"147\": 1, \"148\": 1, \"149\": 1, \"151\": 1, \"150\": 1, \"152\": 1, \"39\": 3, \"153\": 1, \"59\": 2, \"154\": 1, \"11\": 7, \"155\": 1, \"157\": 1, \"156\": 1, \"158\": 1, \"60\": 2, \"159\": 1, \"61\": 2, \"161\": 1, \"160\": 1, \"163\": 1, \"162\": 1, \"164\": 1, \"165\": 1, \"166\": 1, \"28\": 4, \"167\": 1, \"168\": 1, \"169\": 1, \"62\": 2, \"170\": 1, \"171\": 1, \"174\": 1, \"172\": 1, \"173\": 1, \"175\": 1, \"176\": 1, \"177\": 1, \"178\": 1, \"179\": 1, \"180\": 1, \"181\": 1, \"182\": 1, \"183\": 1, \"184\": 1, \"185\": 1, \"29\": 4, \"186\": 1, \"187\": 1, \"188\": 1, \"190\": 1, \"189\": 1, \"191\": 1, \"192\": 1, \"194\": 1, \"193\": 1, \"195\": 1, \"196\": 1, \"197\": 1, \"198\": 1, \"199\": 1, \"201\": 1, \"200\": 1, \"63\": 2, \"202\": 1, \"203\": 1, \"204\": 1, \"64\": 2, \"65\": 2, \"205\": 1, \"207\": 1, \"206\": 1, \"40\": 3, \"208\": 1, \"209\": 1, \"213\": 1, \"66\": 2, \"210\": 1, \"211\": 1, \"212\": 1, \"214\": 1, \"215\": 1, \"217\": 1, \"216\": 1, \"218\": 1, \"219\": 1, \"220\": 1, \"221\": 1, \"222\": 1, \"224\": 1, \"223\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"\\u00bfqu\\u00e9\", \"3\": \"me\", \"4\": \"\\u00bfc\\u00f3mo\", \"5\": \"no\", \"6\": \"es\", \"7\": \"estoy\", \"8\": \"gracias\", \"9\": \"siento\", \"10\": \"tu\", \"11\": \"funciona\", \"12\": \"hola\", \"13\": \"te\", \"14\": \"un\", \"15\": \"la\", \"16\": \"por\", \"17\": \"una\", \"18\": \"va\", \"19\": \"de\", \"20\": \"necesito\", \"21\": \"todo\", \"22\": \"hasta\", \"23\": \"esto\", \"24\": \"ayuda\", \"25\": \"tengo\", \"26\": \"debo\", \"27\": \"m\\u00e1s\", \"28\": \"\\u00bfcu\\u00e1l\", \"29\": \"explica\", \"30\": \"\\u00a1hola\", \"31\": \"nuevo\", \"32\": \"d\\u00eda\", \"33\": \"tal\", \"34\": \"has\", \"35\": \"bien\", \"36\": \"luego\", \"37\": \"muy\", \"38\": \"s\\u00e9\", \"39\": \"\\u00bfme\", \"40\": \"el\", \"41\": \"buenas\", \"42\": \"\\u00a1qu\\u00e9\", \"43\": \"alguien\", \"44\": \"ayudar\", \"45\": \"hay\", \"46\": \"estado\", \"47\": \"ha\", \"48\": \"qu\\u00e9\", \"49\": \"nos\", \"50\": \"vemos\", \"51\": \"tarde\", \"52\": \"lo\", \"53\": \"agradezco\", \"54\": \"aprecio\", \"55\": \"mucho\", \"56\": \"c\\u00f3mo\", \"57\": \"explicarme\", \"58\": \"puedo\", \"59\": \"\\u00bfpodr\\u00edas\", \"60\": \"hacer\", \"61\": \"consejo\", \"62\": \"ves\", \"63\": \"error\", \"64\": \"en\", \"65\": \"falla\", \"66\": \"se\", \"67\": \"buenos\", \"68\": \"d\\u00edas\", \"69\": \"tardes\", \"70\": \"noches\", \"71\": \"est\\u00e1s\", \"72\": \"hey\", \"73\": \"saludos\", \"74\": \"gusto\", \"75\": \"verte\", \"76\": \"\\u00bfhay\", \"77\": \"ah\\u00ed\", \"78\": \"\\u00bfpodemos\", \"79\": \"hablar\", \"80\": \"bueno\", \"81\": \"encontrarte\", \"82\": \"espero\", \"83\": \"interrumpir\", \"84\": \"\\u00a1buen\", \"85\": \"soy\", \"86\": \"aqu\\u00ed\", \"87\": \"\\u00bfalguien\", \"88\": \"disponible\", \"89\": \"\\u00bftienes\", \"90\": \"momento\", \"91\": \"\\u00bfest\\u00e1\", \"92\": \"para\", \"93\": \"\\u00bftodo\", \"94\": \"cuentas\", \"95\": \"ido\", \"96\": \"vida\", \"97\": \"est\\u00e1\", \"98\": \"haces\", \"99\": \"\\u00bfen\", \"100\": \"andas\", \"101\": \"haciendo\", \"102\": \"\\u00bfocupado\", \"103\": \"adi\\u00f3s\", \"104\": \"pronto\", \"105\": \"que\", \"106\": \"ir\", \"107\": \"irme\", \"108\": \"pr\\u00f3xima\", \"109\": \"bye\", \"110\": \"sido\", \"111\": \"placer\", \"112\": \"despido\", \"113\": \"desconectarme\", \"114\": \"continuamos\", \"115\": \"despu\\u00e9s\", \"116\": \"hablamos\", \"117\": \"voy\", \"118\": \"ahora\", \"119\": \"ma\\u00f1ana\", \"120\": \"salir\", \"121\": \"volver\\u00e9\", \"122\": \"dejo\", \"123\": \"muchas\", \"124\": \"mil\", \"125\": \"eres\", \"126\": \"amable\", \"127\": \"agradecerte\", \"128\": \"excelente\", \"129\": \"tiempo\", \"130\": \"ayudado\", \"131\": \"paciencia\", \"132\": \"feliz\", \"133\": \"triste\", \"134\": \"preocupado\", \"135\": \"ansioso\", \"136\": \"emocionado\", \"137\": \"hoy\", \"138\": \"gran\", \"139\": \"agotado\", \"140\": \"genial\", \"141\": \"estresado\", \"142\": \"perdido\", \"143\": \"motivaci\\u00f3n\", \"144\": \"confundido\", \"145\": \"solo\", \"146\": \"animado\", \"147\": \"frustrado\", \"148\": \"cansado\", \"149\": \"optimista\", \"150\": \"\\u00bfpuedes\", \"151\": \"ayudarme\", \"152\": \"podr\\u00edas\", \"153\": \"duda\", \"154\": \"entiendo\", \"155\": \"orientaci\\u00f3n\", \"156\": \"das\", \"157\": \"mano\", \"158\": \"atascado\", \"159\": \"guiarme\", \"160\": \"ayudas\", \"161\": \"con\", \"162\": \"d\\u00f3nde\", \"163\": \"empezar\", \"164\": \"opinas\", \"165\": \"sobre\", \"166\": \"piensas\", \"167\": \"opini\\u00f3n\", \"168\": \"recomiendas\", \"169\": \"mejor\", \"170\": \"prefieres\", \"171\": \"sugieres\", \"172\": \"dame\", \"173\": \"punto\", \"174\": \"vista\", \"175\": \"alternativas\", \"176\": \"diferencia\", \"177\": \"conviene\", \"178\": \"t\\u00fa\", \"179\": \"deber\\u00eda\", \"180\": \"python\", \"181\": \"expl\\u00edcame\", \"182\": \"javascript\", \"183\": \"api\", \"184\": \"uso\", \"185\": \"git\", \"186\": \"poo\", \"187\": \"sql\", \"188\": \"docker\", \"189\": \"machine\", \"190\": \"learning\", \"191\": \"blockchain\", \"192\": \"internet\", \"193\": \"cloud\", \"194\": \"computing\", \"195\": \"big\", \"196\": \"data\", \"197\": \"devops\", \"198\": \"red\", \"199\": \"ciberseguridad\", \"200\": \"mi\", \"201\": \"c\\u00f3digo\", \"202\": \"compila\", \"203\": \"da\", \"204\": \"l\\u00ednea\", \"205\": \"\\u00bfpor\", \"206\": \"encuentro\", \"207\": \"bug\", \"208\": \"sale\", \"209\": \"excepci\\u00f3n\", \"210\": \"conecta\", \"211\": \"a\", \"212\": \"base\", \"213\": \"datos\", \"214\": \"servidor\", \"215\": \"responde\", \"216\": \"aplicaci\\u00f3n\", \"217\": \"cuelga\", \"218\": \"deployear\", \"219\": \"test\", \"220\": \"producci\\u00f3n\", \"221\": \"memory\", \"222\": \"leak\", \"223\": \"performance\", \"224\": \"lenta\"}", "word_index": "{\"<OOV>\": 1, \"\\u00bfqu\\u00e9\": 2, \"me\": 3, \"\\u00bfc\\u00f3mo\": 4, \"no\": 5, \"es\": 6, \"estoy\": 7, \"gracias\": 8, \"siento\": 9, \"tu\": 10, \"funciona\": 11, \"hola\": 12, \"te\": 13, \"un\": 14, \"la\": 15, \"por\": 16, \"una\": 17, \"va\": 18, \"de\": 19, \"necesito\": 20, \"todo\": 21, \"hasta\": 22, \"esto\": 23, \"ayuda\": 24, \"tengo\": 25, \"debo\": 26, \"m\\u00e1s\": 27, \"\\u00bfcu\\u00e1l\": 28, \"explica\": 29, \"\\u00a1hola\": 30, \"nuevo\": 31, \"d\\u00eda\": 32, \"tal\": 33, \"has\": 34, \"bien\": 35, \"luego\": 36, \"muy\": 37, \"s\\u00e9\": 38, \"\\u00bfme\": 39, \"el\": 40, \"buenas\": 41, \"\\u00a1qu\\u00e9\": 42, \"alguien\": 43, \"ayudar\": 44, \"hay\": 45, \"estado\": 46, \"ha\": 47, \"qu\\u00e9\": 48, \"nos\": 49, \"vemos\": 50, \"tarde\": 51, \"lo\": 52, \"agradezco\": 53, \"aprecio\": 54, \"mucho\": 55, \"c\\u00f3mo\": 56, \"explicarme\": 57, \"puedo\": 58, \"\\u00bfpodr\\u00edas\": 59, \"hacer\": 60, \"consejo\": 61, \"ves\": 62, \"error\": 63, \"en\": 64, \"falla\": 65, \"se\": 66, \"buenos\": 67, \"d\\u00edas\": 68, \"tardes\": 69, \"noches\": 70, \"est\\u00e1s\": 71, \"hey\": 72, \"saludos\": 73, \"gusto\": 74, \"verte\": 75, \"\\u00bfhay\": 76, \"ah\\u00ed\": 77, \"\\u00bfpodemos\": 78, \"hablar\": 79, \"bueno\": 80, \"encontrarte\": 81, \"espero\": 82, \"interrumpir\": 83, \"\\u00a1buen\": 84, \"soy\": 85, \"aqu\\u00ed\": 86, \"\\u00bfalguien\": 87, \"disponible\": 88, \"\\u00bftienes\": 89, \"momento\": 90, \"\\u00bfest\\u00e1\": 91, \"para\": 92, \"\\u00bftodo\": 93, \"cuentas\": 94, \"ido\": 95, \"vida\": 96, \"est\\u00e1\": 97, \"haces\": 98, \"\\u00bfen\": 99, \"andas\": 100, \"haciendo\": 101, \"\\u00bfocupado\": 102, \"adi\\u00f3s\": 103, \"pronto\": 104, \"que\": 105, \"ir\": 106, \"irme\": 107, \"pr\\u00f3xima\": 108, \"bye\": 109, \"sido\": 110, \"placer\": 111, \"despido\": 112, \"desconectarme\": 113, \"continuamos\": 114, \"despu\\u00e9s\": 115, \"hablamos\": 116, \"voy\": 117, \"ahora\": 118, \"ma\\u00f1ana\": 119, \"salir\": 120, \"volver\\u00e9\": 121, \"dejo\": 122, \"muchas\": 123, \"mil\": 124, \"eres\": 125, \"amable\": 126, \"agradecerte\": 127, \"excelente\": 128, \"tiempo\": 129, \"ayudado\": 130, \"paciencia\": 131, \"feliz\": 132, \"triste\": 133, \"preocupado\": 134, \"ansioso\": 135, \"emocionado\": 136, \"hoy\": 137, \"gran\": 138, \"agotado\": 139, \"genial\": 140, \"estresado\": 141, \"perdido\": 142, \"motivaci\\u00f3n\": 143, \"confundido\": 144, \"solo\": 145, \"animado\": 146, \"frustrado\": 147, \"cansado\": 148, \"optimista\": 149, \"\\u00bfpuedes\": 150, \"ayudarme\": 151, \"podr\\u00edas\": 152, \"duda\": 153, \"entiendo\": 154, \"orientaci\\u00f3n\": 155, \"das\": 156, \"mano\": 157, \"atascado\": 158, \"guiarme\": 159, \"ayudas\": 160, \"con\": 161, \"d\\u00f3nde\": 162, \"empezar\": 163, \"opinas\": 164, \"sobre\": 165, \"piensas\": 166, \"opini\\u00f3n\": 167, \"recomiendas\": 168, \"mejor\": 169, \"prefieres\": 170, \"sugieres\": 171, \"dame\": 172, \"punto\": 173, \"vista\": 174, \"alternativas\": 175, \"diferencia\": 176, \"conviene\": 177, \"t\\u00fa\": 178, \"deber\\u00eda\": 179, \"python\": 180, \"expl\\u00edcame\": 181, \"javascript\": 182, \"api\": 183, \"uso\": 184, \"git\": 185, \"poo\": 186, \"sql\": 187, \"docker\": 188, \"machine\": 189, \"learning\": 190, \"blockchain\": 191, \"internet\": 192, \"cloud\": 193, \"computing\": 194, \"big\": 195, \"data\": 196, \"devops\": 197, \"red\": 198, \"ciberseguridad\": 199, \"mi\": 200, \"c\\u00f3digo\": 201, \"compila\": 202, \"da\": 203, \"l\\u00ednea\": 204, \"\\u00bfpor\": 205, \"encuentro\": 206, \"bug\": 207, \"sale\": 208, \"excepci\\u00f3n\": 209, \"conecta\": 210, \"a\": 211, \"base\": 212, \"datos\": 213, \"servidor\": 214, \"responde\": 215, \"aplicaci\\u00f3n\": 216, \"cuelga\": 217, \"deployear\": 218, \"test\": 219, \"producci\\u00f3n\": 220, \"memory\": 221, \"leak\": 222, \"performance\": 223, \"lenta\": 224}"}}