{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 406, "word_counts": "{\"hola\": 3, \"hey\": 2, \"buenos\": 1, \"dias\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfcomo\": 13, \"estas\": 2, \"que\": 81, \"tal\": 4, \"saludos\": 1, \"\\u00bfque\": 20, \"hi\": 2, \"tu\": 5, \"dia\": 2, \"te\": 3, \"encuentras\": 1, \"todo\": 5, \"va\": 2, \"has\": 1, \"hecho\": 1, \"\\u00bftodo\": 1, \"bien\": 7, \"me\": 15, \"cuentas\": 1, \"hay\": 4, \"de\": 47, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"\\u00bfy\": 1, \"perfecto\": 1, \"bastante\": 1, \"por\": 5, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adios\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 2, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 6, \"tiempo\": 1, \"se\": 11, \"agradece\": 1, \"es\": 40, \"la\": 16, \"programacion\": 41, \"define\": 20, \"en\": 57, \"terminos\": 2, \"creacion\": 1, \"software\": 2, \"describe\": 2, \"tecnicos\": 1, \"como\": 14, \"relaciona\": 1, \"con\": 5, \"el\": 18, \"hardware\": 2, \"una\": 24, \"variable\": 8, \"hace\": 6, \"valor\": 2, \"puede\": 1, \"cambiar\": 1, \"para\": 11, \"utiliza\": 2, \"un\": 23, \"condicional\": 1, \"if\": 5, \"tipo\": 1, \"instruccion\": 1, \"hacen\": 1, \"los\": 9, \"condicionales\": 1, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"ayudan\": 1, \"ciclos\": 2, \"aplicacion\": 1, \"importancia\": 2, \"tienen\": 2, \"programa\": 4, \"condiciones\": 1, \"debe\": 1, \"cumplir\": 1, \"ejecutarse\": 1, \"funcion\": 4, \"metodo\": 2, \"devuelve\": 1, \"diferencia\": 1, \"entre\": 1, \"y\": 2, \"las\": 13, \"funciones\": 11, \"metodos\": 1, \"dame\": 4, \"definicion\": 3, \"oop\": 9, \"cuales\": 2, \"son\": 11, \"caracteristicas\": 1, \"del\": 1, \"recomendable\": 1, \"usar\": 1, \"tan\": 1, \"popular\": 4, \"genero\": 1, \"peliculas\": 1, \"mas\": 3, \"cual\": 6, \"costo\": 1, \"promedio\": 1, \"hacer\": 4, \"pelicula\": 7, \"accion\": 1, \"recomendarias\": 1, \"este\": 1, \"a\\u00f1o\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"tienes\": 2, \"algun\": 2, \"bueno\": 1, \"di\": 2, \"algo\": 3, \"gracioso\": 1, \"recomiendas\": 1, \"alguna\": 3, \"actividad\": 2, \"hoy\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 4, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 3, \"darme\": 1, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"ganas\": 1, \"comer\": 2, \"sql\": 12, \"significa\": 11, \"definir\": 2, \"representa\": 4, \"tipos\": 6, \"bases\": 7, \"datos\": 3, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"\\u00bfcuales\": 3, \"tabla\": 4, \"sirve\": 4, \"table\": 6, \"select\": 8, \"funciona\": 7, \"consultas\": 1, \"where\": 8, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 10, \"comando\": 2, \"update\": 10, \"delete\": 8, \"elimino\": 2, \"registros\": 1, \"saldre\": 4, \"unos\": 1, \"amigos\": 4, \"a\": 40, \"tomar\": 1, \"concierto\": 1, \"hello\": 3, \"good\": 5, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"how\": 31, \"are\": 20, \"you\": 25, \"what's\": 2, \"up\": 3, \"greetings\": 1, \"what\": 93, \"is\": 48, \"does\": 34, \"mean\": 11, \"to\": 11, \"represent\": 4, \"do\": 28, \"types\": 4, \"of\": 23, \"databases\": 5, \"exist\": 6, \"kinds\": 1, \"database\": 1, \"models\": 1, \"classes\": 1, \"the\": 20, \"in\": 49, \"used\": 8, \"for\": 9, \"work\": 9, \"queries\": 1, \"filters\": 1, \"who\": 1, \"your\": 4, \"function\": 4, \"command\": 2, \"i\": 21, \"data\": 1, \"records\": 1, \"will\": 4, \"go\": 4, \"out\": 3, \"with\": 4, \"some\": 1, \"friends\": 4, \"drinks\": 1, \"concert\": 1, \"eat\": 1, \"day\": 2, \"going\": 2, \"feeling\": 1, \"everything\": 3, \"have\": 6, \"been\": 1, \"fine\": 3, \"great\": 2, \"very\": 3, \"and\": 3, \"asking\": 1, \"goodbye\": 1, \"see\": 4, \"later\": 1, \"soon\": 1, \"tomorrow\": 1, \"thank\": 2, \"much\": 2, \"appreciate\": 2, \"it\": 2, \"many\": 1, \"you're\": 1, \"kind\": 1, \"help\": 2, \"time\": 1, \"appreciated\": 1, \"programming\": 42, \"can\": 9, \"give\": 6, \"definition\": 4, \"technical\": 1, \"terms\": 2, \"related\": 1, \"creation\": 1, \"an\": 10, \"type\": 1, \"instruction\": 1, \"conditionals\": 1, \"ifs\": 1, \"make\": 3, \"decisions\": 1, \"loops\": 6, \"application\": 2, \"one\": 1, \"difference\": 1, \"between\": 1, \"method\": 1, \"important\": 1, \"functions\": 11, \"methods\": 1, \"characteristics\": 1, \"recommended\": 1, \"use\": 1, \"tell\": 2, \"joke\": 3, \"say\": 3, \"something\": 2, \"funny\": 1, \"recommend\": 2, \"any\": 2, \"activity\": 2, \"today\": 3, \"could\": 6, \"activities\": 1, \"my\": 4, \"more\": 1, \"fun\": 1, \"movie\": 4, \"quote\": 2, \"quotes\": 1, \"line\": 1, \"from\": 1, \"food\": 3, \"prepare\": 1, \"feel\": 1, \"like\": 1, \"eating\": 1, \"clase\": 4, \"explica\": 7, \"class\": 4, \"explain\": 9, \"purpose\": 5, \"objeto\": 5, \"explicarme\": 1, \"object\": 12, \"defined\": 2, \"encapsulamiento\": 4, \"encapsulation\": 4, \"python\": 60, \"\\u00bfpuedes\": 1, \"explicar\": 1, \"conceptos\": 1, \"basicos\": 1, \"basics\": 1, \"\\u00bfpara\": 1, \"\\u00bfcual\": 3, \"uso\": 1, \"aplicaciones\": 1, \"tiene\": 5, \"\\u00bfen\": 1, \"usa\": 1, \"proposito\": 4, \"uses\": 1, \"applications\": 1, \"instalo\": 1, \"computadora\": 2, \"puedo\": 2, \"instalar\": 3, \"pc\": 2, \"pasos\": 1, \"debo\": 2, \"seguir\": 1, \"instala\": 1, \"manera\": 1, \"equipo\": 1, \"install\": 4, \"on\": 4, \"computer\": 2, \"steps\": 1, \"should\": 2, \"follow\": 1, \"installed\": 1, \"way\": 2, \"device\": 1, \"ejecuto\": 1, \"ejecutar\": 2, \"correr\": 1, \"corre\": 1, \"script\": 2, \"forma\": 1, \"codigo\": 1, \"run\": 3, \"program\": 3, \"execute\": 2, \"code\": 1, \"instrucciones\": 5, \"control\": 10, \"flujo\": 4, \"estructuras\": 2, \"ofrece\": 2, \"funcionan\": 2, \"flow\": 4, \"instructions\": 2, \"statements\": 3, \"structures\": 2, \"provide\": 1, \"bucles\": 4, \"repeticion\": 1, \"loop\": 2, \"offer\": 1, \"repetition\": 1, \"herencia\": 5, \"contexto\": 1, \"concepto\": 4, \"inheritance\": 5, \"context\": 1, \"concept\": 4, \"serve\": 1, \"abstraccion\": 5, \"orientada\": 7, \"objetos\": 7, \"abstraction\": 5, \"oriented\": 7, \"polimorfismo\": 5, \"polymorphism\": 5, \"getter\": 10, \"utilizan\": 2, \"why\": 2, \"setter\": 10}", "word_docs": "{\"hola\": 3, \"hey\": 2, \"dias\": 1, \"buenos\": 1, \"tardes\": 1, \"buenas\": 2, \"noches\": 1, \"estas\": 2, \"\\u00bfcomo\": 13, \"que\": 81, \"tal\": 4, \"saludos\": 1, \"\\u00bfque\": 20, \"hi\": 2, \"tu\": 5, \"dia\": 2, \"te\": 3, \"encuentras\": 1, \"todo\": 5, \"va\": 2, \"hecho\": 1, \"has\": 1, \"\\u00bftodo\": 1, \"bien\": 7, \"cuentas\": 1, \"me\": 15, \"de\": 40, \"nuevo\": 1, \"hay\": 4, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"\\u00bfy\": 1, \"perfecto\": 1, \"bastante\": 1, \"por\": 5, \"preguntar\": 1, \"quejo\": 1, \"no\": 1, \"genial\": 1, \"adios\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 2, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"agradezco\": 1, \"lo\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 6, \"tiempo\": 1, \"agradece\": 1, \"se\": 11, \"es\": 40, \"programacion\": 41, \"la\": 16, \"creacion\": 1, \"terminos\": 2, \"software\": 2, \"en\": 56, \"define\": 20, \"describe\": 2, \"tecnicos\": 1, \"el\": 18, \"relaciona\": 1, \"con\": 5, \"como\": 14, \"hardware\": 2, \"una\": 23, \"variable\": 8, \"hace\": 6, \"puede\": 1, \"valor\": 2, \"cambiar\": 1, \"utiliza\": 2, \"para\": 11, \"un\": 22, \"if\": 5, \"condicional\": 1, \"instruccion\": 1, \"tipo\": 1, \"condicionales\": 1, \"los\": 9, \"hacen\": 1, \"desiciones\": 1, \"toman\": 1, \"ciclo\": 2, \"ayudan\": 1, \"ciclos\": 2, \"aplicacion\": 1, \"importancia\": 2, \"tienen\": 2, \"programa\": 4, \"debe\": 1, \"ejecutarse\": 1, \"cumplir\": 1, \"condiciones\": 1, \"funcion\": 4, \"metodo\": 2, \"devuelve\": 1, \"y\": 2, \"diferencia\": 1, \"entre\": 1, \"las\": 13, \"funciones\": 11, \"metodos\": 1, \"dame\": 4, \"definicion\": 3, \"oop\": 9, \"cuales\": 2, \"son\": 11, \"caracteristicas\": 1, \"del\": 1, \"usar\": 1, \"recomendable\": 1, \"tan\": 1, \"popular\": 4, \"peliculas\": 1, \"mas\": 3, \"genero\": 1, \"hacer\": 4, \"promedio\": 1, \"cual\": 6, \"pelicula\": 7, \"costo\": 1, \"recomendarias\": 1, \"accion\": 1, \"a\\u00f1o\": 1, \"este\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"algun\": 2, \"bueno\": 1, \"tienes\": 2, \"algo\": 3, \"gracioso\": 1, \"di\": 2, \"alguna\": 3, \"actividad\": 2, \"hoy\": 2, \"recomiendas\": 1, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 4, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 3, \"darme\": 1, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"comer\": 2, \"ganas\": 1, \"sql\": 12, \"significa\": 11, \"definir\": 2, \"representa\": 4, \"existen\": 4, \"tipos\": 6, \"datos\": 3, \"bases\": 7, \"modelos\": 1, \"clases\": 1, \"\\u00bfcuales\": 3, \"tabla\": 4, \"sirve\": 4, \"table\": 6, \"select\": 8, \"funciona\": 7, \"consultas\": 1, \"where\": 8, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 10, \"comando\": 2, \"update\": 10, \"delete\": 8, \"elimino\": 2, \"registros\": 1, \"unos\": 1, \"amigos\": 4, \"saldre\": 4, \"tomar\": 1, \"a\": 38, \"concierto\": 1, \"hello\": 3, \"good\": 5, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"how\": 31, \"you\": 25, \"are\": 20, \"what's\": 2, \"up\": 3, \"greetings\": 1, \"what\": 93, \"is\": 48, \"does\": 34, \"mean\": 11, \"to\": 11, \"represent\": 4, \"do\": 24, \"exist\": 6, \"of\": 23, \"databases\": 5, \"types\": 4, \"kinds\": 1, \"database\": 1, \"models\": 1, \"classes\": 1, \"the\": 20, \"in\": 49, \"for\": 9, \"used\": 8, \"work\": 9, \"queries\": 1, \"filters\": 1, \"who\": 1, \"your\": 4, \"function\": 4, \"command\": 2, \"i\": 21, \"data\": 1, \"records\": 1, \"with\": 4, \"some\": 1, \"will\": 4, \"go\": 4, \"out\": 3, \"friends\": 4, \"drinks\": 1, \"concert\": 1, \"eat\": 1, \"going\": 2, \"day\": 2, \"feeling\": 1, \"everything\": 3, \"been\": 1, \"have\": 6, \"fine\": 3, \"great\": 2, \"very\": 3, \"and\": 3, \"asking\": 1, \"goodbye\": 1, \"see\": 4, \"later\": 1, \"soon\": 1, \"tomorrow\": 1, \"thank\": 2, \"much\": 2, \"appreciate\": 2, \"it\": 2, \"many\": 1, \"you're\": 1, \"kind\": 1, \"help\": 2, \"time\": 1, \"appreciated\": 1, \"programming\": 42, \"give\": 6, \"definition\": 4, \"can\": 9, \"technical\": 1, \"terms\": 2, \"related\": 1, \"creation\": 1, \"an\": 10, \"type\": 1, \"instruction\": 1, \"conditionals\": 1, \"ifs\": 1, \"decisions\": 1, \"make\": 3, \"loops\": 6, \"application\": 2, \"one\": 1, \"between\": 1, \"method\": 1, \"difference\": 1, \"functions\": 11, \"methods\": 1, \"important\": 1, \"characteristics\": 1, \"use\": 1, \"recommended\": 1, \"joke\": 3, \"tell\": 2, \"say\": 3, \"something\": 2, \"funny\": 1, \"any\": 2, \"recommend\": 2, \"today\": 3, \"activity\": 2, \"could\": 6, \"activities\": 1, \"more\": 1, \"fun\": 1, \"my\": 4, \"quote\": 2, \"movie\": 4, \"quotes\": 1, \"from\": 1, \"line\": 1, \"food\": 3, \"prepare\": 1, \"feel\": 1, \"eating\": 1, \"like\": 1, \"clase\": 4, \"explica\": 7, \"class\": 4, \"explain\": 9, \"purpose\": 5, \"objeto\": 5, \"explicarme\": 1, \"object\": 12, \"defined\": 2, \"encapsulamiento\": 4, \"encapsulation\": 4, \"python\": 60, \"\\u00bfpuedes\": 1, \"explicar\": 1, \"basicos\": 1, \"conceptos\": 1, \"basics\": 1, \"\\u00bfpara\": 1, \"uso\": 1, \"\\u00bfcual\": 3, \"tiene\": 5, \"aplicaciones\": 1, \"\\u00bfen\": 1, \"usa\": 1, \"proposito\": 4, \"uses\": 1, \"applications\": 1, \"computadora\": 2, \"instalo\": 1, \"pc\": 2, \"puedo\": 2, \"instalar\": 3, \"debo\": 2, \"pasos\": 1, \"seguir\": 1, \"instala\": 1, \"equipo\": 1, \"manera\": 1, \"on\": 4, \"computer\": 2, \"install\": 4, \"steps\": 1, \"follow\": 1, \"should\": 2, \"installed\": 1, \"way\": 2, \"device\": 1, \"ejecuto\": 1, \"ejecutar\": 2, \"correr\": 1, \"script\": 2, \"corre\": 1, \"forma\": 1, \"codigo\": 1, \"program\": 3, \"run\": 3, \"execute\": 2, \"code\": 1, \"flujo\": 4, \"control\": 10, \"instrucciones\": 5, \"estructuras\": 2, \"ofrece\": 2, \"funcionan\": 2, \"flow\": 4, \"instructions\": 2, \"statements\": 3, \"provide\": 1, \"structures\": 2, \"bucles\": 4, \"repeticion\": 1, \"offer\": 1, \"loop\": 2, \"repetition\": 1, \"herencia\": 5, \"contexto\": 1, \"concepto\": 4, \"inheritance\": 5, \"context\": 1, \"concept\": 4, \"serve\": 1, \"abstraccion\": 5, \"orientada\": 7, \"objetos\": 7, \"abstraction\": 5, \"oriented\": 7, \"polimorfismo\": 5, \"polymorphism\": 5, \"getter\": 10, \"utilizan\": 2, \"why\": 2, \"setter\": 10}", "index_docs": "{\"133\": 3, \"163\": 2, \"238\": 1, \"237\": 1, \"239\": 1, \"164\": 2, \"240\": 1, \"165\": 2, \"29\": 13, \"3\": 81, \"94\": 4, \"241\": 1, \"21\": 20, \"166\": 2, \"77\": 5, \"167\": 2, \"134\": 3, \"242\": 1, \"78\": 5, \"168\": 2, \"244\": 1, \"243\": 1, \"245\": 1, \"58\": 7, \"246\": 1, \"27\": 15, \"8\": 40, \"247\": 1, \"95\": 4, \"59\": 7, \"169\": 2, \"248\": 1, \"249\": 1, \"250\": 1, \"251\": 1, \"79\": 5, \"252\": 1, \"254\": 1, \"253\": 1, \"255\": 1, \"256\": 1, \"135\": 3, \"170\": 2, \"171\": 2, \"172\": 2, \"257\": 1, \"258\": 1, \"259\": 1, \"173\": 2, \"260\": 1, \"261\": 1, \"262\": 1, \"264\": 1, \"263\": 1, \"265\": 1, \"266\": 1, \"267\": 1, \"268\": 1, \"67\": 6, \"269\": 1, \"270\": 1, \"33\": 11, \"11\": 40, \"10\": 41, \"26\": 16, \"271\": 1, \"174\": 2, \"175\": 2, \"5\": 56, \"22\": 20, \"176\": 2, \"272\": 1, \"25\": 18, \"273\": 1, \"80\": 5, \"28\": 14, \"177\": 2, \"17\": 23, \"53\": 8, \"68\": 6, \"274\": 1, \"178\": 2, \"275\": 1, \"179\": 2, \"34\": 11, \"18\": 22, \"81\": 5, \"276\": 1, \"278\": 1, \"277\": 1, \"280\": 1, \"47\": 9, \"279\": 1, \"282\": 1, \"281\": 1, \"180\": 2, \"283\": 1, \"181\": 2, \"284\": 1, \"182\": 2, \"183\": 2, \"96\": 4, \"286\": 1, \"288\": 1, \"287\": 1, \"285\": 1, \"97\": 4, \"184\": 2, \"289\": 1, \"185\": 2, \"290\": 1, \"291\": 1, \"30\": 13, \"35\": 11, \"292\": 1, \"98\": 4, \"136\": 3, \"48\": 9, \"186\": 2, \"36\": 11, \"293\": 1, \"294\": 1, \"296\": 1, \"295\": 1, \"297\": 1, \"99\": 4, \"299\": 1, \"137\": 3, \"298\": 1, \"100\": 4, \"301\": 1, \"69\": 6, \"60\": 7, \"300\": 1, \"303\": 1, \"302\": 1, \"305\": 1, \"304\": 1, \"306\": 1, \"138\": 3, \"187\": 2, \"189\": 2, \"307\": 1, \"188\": 2, \"139\": 3, \"308\": 1, \"190\": 2, \"140\": 3, \"191\": 2, \"192\": 2, \"309\": 1, \"101\": 4, \"193\": 2, \"310\": 1, \"102\": 4, \"311\": 1, \"141\": 3, \"142\": 3, \"312\": 1, \"313\": 1, \"143\": 3, \"194\": 2, \"314\": 1, \"315\": 1, \"316\": 1, \"195\": 2, \"317\": 1, \"31\": 12, \"37\": 11, \"196\": 2, \"103\": 4, \"104\": 4, \"70\": 6, \"144\": 3, \"61\": 7, \"318\": 1, \"319\": 1, \"145\": 3, \"105\": 4, \"106\": 4, \"71\": 6, \"54\": 8, \"62\": 7, \"320\": 1, \"55\": 8, \"321\": 1, \"197\": 2, \"322\": 1, \"323\": 1, \"41\": 10, \"198\": 2, \"42\": 10, \"56\": 8, \"199\": 2, \"324\": 1, \"325\": 1, \"108\": 4, \"107\": 4, \"326\": 1, \"12\": 38, \"327\": 1, \"146\": 3, \"82\": 5, \"328\": 1, \"329\": 1, \"330\": 1, \"14\": 31, \"16\": 25, \"23\": 20, \"200\": 2, \"147\": 3, \"331\": 1, \"2\": 93, \"7\": 48, \"13\": 34, \"38\": 11, \"39\": 11, \"109\": 4, \"15\": 24, \"72\": 6, \"19\": 23, \"83\": 5, \"110\": 4, \"332\": 1, \"333\": 1, \"334\": 1, \"335\": 1, \"24\": 20, \"6\": 49, \"49\": 9, \"57\": 8, \"50\": 9, \"336\": 1, \"337\": 1, \"338\": 1, \"111\": 4, \"112\": 4, \"201\": 2, \"20\": 21, \"339\": 1, \"340\": 1, \"115\": 4, \"341\": 1, \"113\": 4, \"114\": 4, \"148\": 3, \"116\": 4, \"342\": 1, \"343\": 1, \"344\": 1, \"203\": 2, \"202\": 2, \"345\": 1, \"149\": 3, \"346\": 1, \"73\": 6, \"150\": 3, \"204\": 2, \"151\": 3, \"152\": 3, \"347\": 1, \"348\": 1, \"117\": 4, \"349\": 1, \"350\": 1, \"351\": 1, \"205\": 2, \"206\": 2, \"207\": 2, \"208\": 2, \"352\": 1, \"353\": 1, \"354\": 1, \"209\": 2, \"355\": 1, \"356\": 1, \"9\": 42, \"74\": 6, \"118\": 4, \"51\": 9, \"357\": 1, \"210\": 2, \"358\": 1, \"359\": 1, \"43\": 10, \"360\": 1, \"361\": 1, \"362\": 1, \"363\": 1, \"364\": 1, \"153\": 3, \"75\": 6, \"211\": 2, \"365\": 1, \"367\": 1, \"368\": 1, \"366\": 1, \"40\": 11, \"370\": 1, \"369\": 1, \"371\": 1, \"373\": 1, \"372\": 1, \"154\": 3, \"212\": 2, \"155\": 3, \"213\": 2, \"374\": 1, \"215\": 2, \"214\": 2, \"156\": 3, \"216\": 2, \"76\": 6, \"375\": 1, \"376\": 1, \"377\": 1, \"119\": 4, \"217\": 2, \"120\": 4, \"378\": 1, \"380\": 1, \"379\": 1, \"157\": 3, \"381\": 1, \"382\": 1, \"384\": 1, \"383\": 1, \"121\": 4, \"63\": 7, \"122\": 4, \"52\": 9, \"84\": 5, \"85\": 5, \"385\": 1, \"32\": 12, \"218\": 2, \"123\": 4, \"124\": 4, \"4\": 60, \"386\": 1, \"387\": 1, \"389\": 1, \"388\": 1, \"390\": 1, \"391\": 1, \"392\": 1, \"158\": 3, \"86\": 5, \"393\": 1, \"394\": 1, \"395\": 1, \"125\": 4, \"396\": 1, \"397\": 1, \"219\": 2, \"398\": 1, \"221\": 2, \"220\": 2, \"159\": 3, \"222\": 2, \"399\": 1, \"400\": 1, \"401\": 1, \"403\": 1, \"402\": 1, \"127\": 4, \"223\": 2, \"126\": 4, \"404\": 1, \"405\": 1, \"224\": 2, \"406\": 1, \"225\": 2, \"407\": 1, \"408\": 1, \"226\": 2, \"409\": 1, \"227\": 2, \"410\": 1, \"411\": 1, \"412\": 1, \"161\": 3, \"160\": 3, \"228\": 2, \"413\": 1, \"128\": 4, \"44\": 10, \"87\": 5, \"229\": 2, \"230\": 2, \"231\": 2, \"129\": 4, \"232\": 2, \"162\": 3, \"414\": 1, \"233\": 2, \"130\": 4, \"415\": 1, \"416\": 1, \"234\": 2, \"417\": 1, \"88\": 5, \"418\": 1, \"131\": 4, \"89\": 5, \"419\": 1, \"132\": 4, \"420\": 1, \"90\": 5, \"64\": 7, \"65\": 7, \"91\": 5, \"66\": 7, \"92\": 5, \"93\": 5, \"45\": 10, \"235\": 2, \"236\": 2, \"46\": 10}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"what\", \"3\": \"que\", \"4\": \"python\", \"5\": \"en\", \"6\": \"in\", \"7\": \"is\", \"8\": \"de\", \"9\": \"programming\", \"10\": \"programacion\", \"11\": \"es\", \"12\": \"a\", \"13\": \"does\", \"14\": \"how\", \"15\": \"do\", \"16\": \"you\", \"17\": \"una\", \"18\": \"un\", \"19\": \"of\", \"20\": \"i\", \"21\": \"\\u00bfque\", \"22\": \"define\", \"23\": \"are\", \"24\": \"the\", \"25\": \"el\", \"26\": \"la\", \"27\": \"me\", \"28\": \"como\", \"29\": \"\\u00bfcomo\", \"30\": \"las\", \"31\": \"sql\", \"32\": \"object\", \"33\": \"se\", \"34\": \"para\", \"35\": \"funciones\", \"36\": \"son\", \"37\": \"significa\", \"38\": \"mean\", \"39\": \"to\", \"40\": \"functions\", \"41\": \"insert\", \"42\": \"update\", \"43\": \"an\", \"44\": \"control\", \"45\": \"getter\", \"46\": \"setter\", \"47\": \"los\", \"48\": \"oop\", \"49\": \"for\", \"50\": \"work\", \"51\": \"can\", \"52\": \"explain\", \"53\": \"variable\", \"54\": \"select\", \"55\": \"where\", \"56\": \"delete\", \"57\": \"used\", \"58\": \"bien\", \"59\": \"gracias\", \"60\": \"pelicula\", \"61\": \"bases\", \"62\": \"funciona\", \"63\": \"explica\", \"64\": \"orientada\", \"65\": \"objetos\", \"66\": \"oriented\", \"67\": \"thanks\", \"68\": \"hace\", \"69\": \"cual\", \"70\": \"tipos\", \"71\": \"table\", \"72\": \"exist\", \"73\": \"have\", \"74\": \"give\", \"75\": \"loops\", \"76\": \"could\", \"77\": \"tu\", \"78\": \"todo\", \"79\": \"por\", \"80\": \"con\", \"81\": \"if\", \"82\": \"good\", \"83\": \"databases\", \"84\": \"purpose\", \"85\": \"objeto\", \"86\": \"tiene\", \"87\": \"instrucciones\", \"88\": \"herencia\", \"89\": \"inheritance\", \"90\": \"abstraccion\", \"91\": \"abstraction\", \"92\": \"polimorfismo\", \"93\": \"polymorphism\", \"94\": \"tal\", \"95\": \"hay\", \"96\": \"programa\", \"97\": \"funcion\", \"98\": \"dame\", \"99\": \"popular\", \"100\": \"hacer\", \"101\": \"podria\", \"102\": \"mi\", \"103\": \"representa\", \"104\": \"existen\", \"105\": \"tabla\", \"106\": \"sirve\", \"107\": \"saldre\", \"108\": \"amigos\", \"109\": \"represent\", \"110\": \"types\", \"111\": \"your\", \"112\": \"function\", \"113\": \"will\", \"114\": \"go\", \"115\": \"with\", \"116\": \"friends\", \"117\": \"see\", \"118\": \"definition\", \"119\": \"my\", \"120\": \"movie\", \"121\": \"clase\", \"122\": \"class\", \"123\": \"encapsulamiento\", \"124\": \"encapsulation\", \"125\": \"proposito\", \"126\": \"install\", \"127\": \"on\", \"128\": \"flujo\", \"129\": \"flow\", \"130\": \"bucles\", \"131\": \"concepto\", \"132\": \"concept\", \"133\": \"hola\", \"134\": \"te\", \"135\": \"hasta\", \"136\": \"definicion\", \"137\": \"mas\", \"138\": \"chiste\", \"139\": \"algo\", \"140\": \"alguna\", \"141\": \"dialogo\", \"142\": \"podrias\", \"143\": \"comida\", \"144\": \"datos\", \"145\": \"\\u00bfcuales\", \"146\": \"hello\", \"147\": \"up\", \"148\": \"out\", \"149\": \"everything\", \"150\": \"fine\", \"151\": \"very\", \"152\": \"and\", \"153\": \"make\", \"154\": \"joke\", \"155\": \"say\", \"156\": \"today\", \"157\": \"food\", \"158\": \"\\u00bfcual\", \"159\": \"instalar\", \"160\": \"run\", \"161\": \"program\", \"162\": \"statements\", \"163\": \"hey\", \"164\": \"buenas\", \"165\": \"estas\", \"166\": \"hi\", \"167\": \"dia\", \"168\": \"va\", \"169\": \"muy\", \"170\": \"luego\", \"171\": \"nos\", \"172\": \"vemos\", \"173\": \"bye\", \"174\": \"terminos\", \"175\": \"software\", \"176\": \"describe\", \"177\": \"hardware\", \"178\": \"valor\", \"179\": \"utiliza\", \"180\": \"ciclo\", \"181\": \"ciclos\", \"182\": \"importancia\", \"183\": \"tienen\", \"184\": \"metodo\", \"185\": \"y\", \"186\": \"cuales\", \"187\": \"dime\", \"188\": \"tienes\", \"189\": \"algun\", \"190\": \"di\", \"191\": \"actividad\", \"192\": \"hoy\", \"193\": \"realizar\", \"194\": \"preparar\", \"195\": \"comer\", \"196\": \"definir\", \"197\": \"eres\", \"198\": \"comando\", \"199\": \"elimino\", \"200\": \"what's\", \"201\": \"command\", \"202\": \"day\", \"203\": \"going\", \"204\": \"great\", \"205\": \"thank\", \"206\": \"much\", \"207\": \"appreciate\", \"208\": \"it\", \"209\": \"help\", \"210\": \"terms\", \"211\": \"application\", \"212\": \"tell\", \"213\": \"something\", \"214\": \"recommend\", \"215\": \"any\", \"216\": \"activity\", \"217\": \"quote\", \"218\": \"defined\", \"219\": \"computadora\", \"220\": \"puedo\", \"221\": \"pc\", \"222\": \"debo\", \"223\": \"computer\", \"224\": \"should\", \"225\": \"way\", \"226\": \"ejecutar\", \"227\": \"script\", \"228\": \"execute\", \"229\": \"estructuras\", \"230\": \"ofrece\", \"231\": \"funcionan\", \"232\": \"instructions\", \"233\": \"structures\", \"234\": \"loop\", \"235\": \"utilizan\", \"236\": \"why\", \"237\": \"buenos\", \"238\": \"dias\", \"239\": \"tardes\", \"240\": \"noches\", \"241\": \"saludos\", \"242\": \"encuentras\", \"243\": \"has\", \"244\": \"hecho\", \"245\": \"\\u00bftodo\", \"246\": \"cuentas\", \"247\": \"nuevo\", \"248\": \"excelente\", \"249\": \"\\u00bfy\", \"250\": \"perfecto\", \"251\": \"bastante\", \"252\": \"preguntar\", \"253\": \"no\", \"254\": \"quejo\", \"255\": \"genial\", \"256\": \"adios\", \"257\": \"chao\", \"258\": \"pronto\", \"259\": \"voy\", \"260\": \"ma\\u00f1ana\", \"261\": \"despido\", \"262\": \"muchas\", \"263\": \"lo\", \"264\": \"agradezco\", \"265\": \"mil\", \"266\": \"amable\", \"267\": \"aprecio\", \"268\": \"ayuda\", \"269\": \"tiempo\", \"270\": \"agradece\", \"271\": \"creacion\", \"272\": \"tecnicos\", \"273\": \"relaciona\", \"274\": \"puede\", \"275\": \"cambiar\", \"276\": \"condicional\", \"277\": \"tipo\", \"278\": \"instruccion\", \"279\": \"hacen\", \"280\": \"condicionales\", \"281\": \"toman\", \"282\": \"desiciones\", \"283\": \"ayudan\", \"284\": \"aplicacion\", \"285\": \"condiciones\", \"286\": \"debe\", \"287\": \"cumplir\", \"288\": \"ejecutarse\", \"289\": \"devuelve\", \"290\": \"diferencia\", \"291\": \"entre\", \"292\": \"metodos\", \"293\": \"caracteristicas\", \"294\": \"del\", \"295\": \"recomendable\", \"296\": \"usar\", \"297\": \"tan\", \"298\": \"genero\", \"299\": \"peliculas\", \"300\": \"costo\", \"301\": \"promedio\", \"302\": \"accion\", \"303\": \"recomendarias\", \"304\": \"este\", \"305\": \"a\\u00f1o\", \"306\": \"cuentame\", \"307\": \"bueno\", \"308\": \"gracioso\", \"309\": \"recomiendas\", \"310\": \"actividades\", \"311\": \"divertido\", \"312\": \"darme\", \"313\": \"frase\", \"314\": \"recomiendame\", \"315\": \"pueda\", \"316\": \"tengo\", \"317\": \"ganas\", \"318\": \"modelos\", \"319\": \"clases\", \"320\": \"consultas\", \"321\": \"filtros\", \"322\": \"quien\", \"323\": \"haces\", \"324\": \"registros\", \"325\": \"unos\", \"326\": \"tomar\", \"327\": \"concierto\", \"328\": \"morning\", \"329\": \"afternoon\", \"330\": \"evening\", \"331\": \"greetings\", \"332\": \"kinds\", \"333\": \"database\", \"334\": \"models\", \"335\": \"classes\", \"336\": \"queries\", \"337\": \"filters\", \"338\": \"who\", \"339\": \"data\", \"340\": \"records\", \"341\": \"some\", \"342\": \"drinks\", \"343\": \"concert\", \"344\": \"eat\", \"345\": \"feeling\", \"346\": \"been\", \"347\": \"asking\", \"348\": \"goodbye\", \"349\": \"later\", \"350\": \"soon\", \"351\": \"tomorrow\", \"352\": \"many\", \"353\": \"you're\", \"354\": \"kind\", \"355\": \"time\", \"356\": \"appreciated\", \"357\": \"technical\", \"358\": \"related\", \"359\": \"creation\", \"360\": \"type\", \"361\": \"instruction\", \"362\": \"conditionals\", \"363\": \"ifs\", \"364\": \"decisions\", \"365\": \"one\", \"366\": \"difference\", \"367\": \"between\", \"368\": \"method\", \"369\": \"important\", \"370\": \"methods\", \"371\": \"characteristics\", \"372\": \"recommended\", \"373\": \"use\", \"374\": \"funny\", \"375\": \"activities\", \"376\": \"more\", \"377\": \"fun\", \"378\": \"quotes\", \"379\": \"line\", \"380\": \"from\", \"381\": \"prepare\", \"382\": \"feel\", \"383\": \"like\", \"384\": \"eating\", \"385\": \"explicarme\", \"386\": \"\\u00bfpuedes\", \"387\": \"explicar\", \"388\": \"conceptos\", \"389\": \"basicos\", \"390\": \"basics\", \"391\": \"\\u00bfpara\", \"392\": \"uso\", \"393\": \"aplicaciones\", \"394\": \"\\u00bfen\", \"395\": \"usa\", \"396\": \"uses\", \"397\": \"applications\", \"398\": \"instalo\", \"399\": \"pasos\", \"400\": \"seguir\", \"401\": \"instala\", \"402\": \"manera\", \"403\": \"equipo\", \"404\": \"steps\", \"405\": \"follow\", \"406\": \"installed\", \"407\": \"device\", \"408\": \"ejecuto\", \"409\": \"correr\", \"410\": \"corre\", \"411\": \"forma\", \"412\": \"codigo\", \"413\": \"code\", \"414\": \"provide\", \"415\": \"repeticion\", \"416\": \"offer\", \"417\": \"repetition\", \"418\": \"contexto\", \"419\": \"context\", \"420\": \"serve\"}", "word_index": "{\"<OOV>\": 1, \"what\": 2, \"que\": 3, \"python\": 4, \"en\": 5, \"in\": 6, \"is\": 7, \"de\": 8, \"programming\": 9, \"programacion\": 10, \"es\": 11, \"a\": 12, \"does\": 13, \"how\": 14, \"do\": 15, \"you\": 16, \"una\": 17, \"un\": 18, \"of\": 19, \"i\": 20, \"\\u00bfque\": 21, \"define\": 22, \"are\": 23, \"the\": 24, \"el\": 25, \"la\": 26, \"me\": 27, \"como\": 28, \"\\u00bfcomo\": 29, \"las\": 30, \"sql\": 31, \"object\": 32, \"se\": 33, \"para\": 34, \"funciones\": 35, \"son\": 36, \"significa\": 37, \"mean\": 38, \"to\": 39, \"functions\": 40, \"insert\": 41, \"update\": 42, \"an\": 43, \"control\": 44, \"getter\": 45, \"setter\": 46, \"los\": 47, \"oop\": 48, \"for\": 49, \"work\": 50, \"can\": 51, \"explain\": 52, \"variable\": 53, \"select\": 54, \"where\": 55, \"delete\": 56, \"used\": 57, \"bien\": 58, \"gracias\": 59, \"pelicula\": 60, \"bases\": 61, \"funciona\": 62, \"explica\": 63, \"orientada\": 64, \"objetos\": 65, \"oriented\": 66, \"thanks\": 67, \"hace\": 68, \"cual\": 69, \"tipos\": 70, \"table\": 71, \"exist\": 72, \"have\": 73, \"give\": 74, \"loops\": 75, \"could\": 76, \"tu\": 77, \"todo\": 78, \"por\": 79, \"con\": 80, \"if\": 81, \"good\": 82, \"databases\": 83, \"purpose\": 84, \"objeto\": 85, \"tiene\": 86, \"instrucciones\": 87, \"herencia\": 88, \"inheritance\": 89, \"abstraccion\": 90, \"abstraction\": 91, \"polimorfismo\": 92, \"polymorphism\": 93, \"tal\": 94, \"hay\": 95, \"programa\": 96, \"funcion\": 97, \"dame\": 98, \"popular\": 99, \"hacer\": 100, \"podria\": 101, \"mi\": 102, \"representa\": 103, \"existen\": 104, \"tabla\": 105, \"sirve\": 106, \"saldre\": 107, \"amigos\": 108, \"represent\": 109, \"types\": 110, \"your\": 111, \"function\": 112, \"will\": 113, \"go\": 114, \"with\": 115, \"friends\": 116, \"see\": 117, \"definition\": 118, \"my\": 119, \"movie\": 120, \"clase\": 121, \"class\": 122, \"encapsulamiento\": 123, \"encapsulation\": 124, \"proposito\": 125, \"install\": 126, \"on\": 127, \"flujo\": 128, \"flow\": 129, \"bucles\": 130, \"concepto\": 131, \"concept\": 132, \"hola\": 133, \"te\": 134, \"hasta\": 135, \"definicion\": 136, \"mas\": 137, \"chiste\": 138, \"algo\": 139, \"alguna\": 140, \"dialogo\": 141, \"podrias\": 142, \"comida\": 143, \"datos\": 144, \"\\u00bfcuales\": 145, \"hello\": 146, \"up\": 147, \"out\": 148, \"everything\": 149, \"fine\": 150, \"very\": 151, \"and\": 152, \"make\": 153, \"joke\": 154, \"say\": 155, \"today\": 156, \"food\": 157, \"\\u00bfcual\": 158, \"instalar\": 159, \"run\": 160, \"program\": 161, \"statements\": 162, \"hey\": 163, \"buenas\": 164, \"estas\": 165, \"hi\": 166, \"dia\": 167, \"va\": 168, \"muy\": 169, \"luego\": 170, \"nos\": 171, \"vemos\": 172, \"bye\": 173, \"terminos\": 174, \"software\": 175, \"describe\": 176, \"hardware\": 177, \"valor\": 178, \"utiliza\": 179, \"ciclo\": 180, \"ciclos\": 181, \"importancia\": 182, \"tienen\": 183, \"metodo\": 184, \"y\": 185, \"cuales\": 186, \"dime\": 187, \"tienes\": 188, \"algun\": 189, \"di\": 190, \"actividad\": 191, \"hoy\": 192, \"realizar\": 193, \"preparar\": 194, \"comer\": 195, \"definir\": 196, \"eres\": 197, \"comando\": 198, \"elimino\": 199, \"what's\": 200, \"command\": 201, \"day\": 202, \"going\": 203, \"great\": 204, \"thank\": 205, \"much\": 206, \"appreciate\": 207, \"it\": 208, \"help\": 209, \"terms\": 210, \"application\": 211, \"tell\": 212, \"something\": 213, \"recommend\": 214, \"any\": 215, \"activity\": 216, \"quote\": 217, \"defined\": 218, \"computadora\": 219, \"puedo\": 220, \"pc\": 221, \"debo\": 222, \"computer\": 223, \"should\": 224, \"way\": 225, \"ejecutar\": 226, \"script\": 227, \"execute\": 228, \"estructuras\": 229, \"ofrece\": 230, \"funcionan\": 231, \"instructions\": 232, \"structures\": 233, \"loop\": 234, \"utilizan\": 235, \"why\": 236, \"buenos\": 237, \"dias\": 238, \"tardes\": 239, \"noches\": 240, \"saludos\": 241, \"encuentras\": 242, \"has\": 243, \"hecho\": 244, \"\\u00bftodo\": 245, \"cuentas\": 246, \"nuevo\": 247, \"excelente\": 248, \"\\u00bfy\": 249, \"perfecto\": 250, \"bastante\": 251, \"preguntar\": 252, \"no\": 253, \"quejo\": 254, \"genial\": 255, \"adios\": 256, \"chao\": 257, \"pronto\": 258, \"voy\": 259, \"ma\\u00f1ana\": 260, \"despido\": 261, \"muchas\": 262, \"lo\": 263, \"agradezco\": 264, \"mil\": 265, \"amable\": 266, \"aprecio\": 267, \"ayuda\": 268, \"tiempo\": 269, \"agradece\": 270, \"creacion\": 271, \"tecnicos\": 272, \"relaciona\": 273, \"puede\": 274, \"cambiar\": 275, \"condicional\": 276, \"tipo\": 277, \"instruccion\": 278, \"hacen\": 279, \"condicionales\": 280, \"toman\": 281, \"desiciones\": 282, \"ayudan\": 283, \"aplicacion\": 284, \"condiciones\": 285, \"debe\": 286, \"cumplir\": 287, \"ejecutarse\": 288, \"devuelve\": 289, \"diferencia\": 290, \"entre\": 291, \"metodos\": 292, \"caracteristicas\": 293, \"del\": 294, \"recomendable\": 295, \"usar\": 296, \"tan\": 297, \"genero\": 298, \"peliculas\": 299, \"costo\": 300, \"promedio\": 301, \"accion\": 302, \"recomendarias\": 303, \"este\": 304, \"a\\u00f1o\": 305, \"cuentame\": 306, \"bueno\": 307, \"gracioso\": 308, \"recomiendas\": 309, \"actividades\": 310, \"divertido\": 311, \"darme\": 312, \"frase\": 313, \"recomiendame\": 314, \"pueda\": 315, \"tengo\": 316, \"ganas\": 317, \"modelos\": 318, \"clases\": 319, \"consultas\": 320, \"filtros\": 321, \"quien\": 322, \"haces\": 323, \"registros\": 324, \"unos\": 325, \"tomar\": 326, \"concierto\": 327, \"morning\": 328, \"afternoon\": 329, \"evening\": 330, \"greetings\": 331, \"kinds\": 332, \"database\": 333, \"models\": 334, \"classes\": 335, \"queries\": 336, \"filters\": 337, \"who\": 338, \"data\": 339, \"records\": 340, \"some\": 341, \"drinks\": 342, \"concert\": 343, \"eat\": 344, \"feeling\": 345, \"been\": 346, \"asking\": 347, \"goodbye\": 348, \"later\": 349, \"soon\": 350, \"tomorrow\": 351, \"many\": 352, \"you're\": 353, \"kind\": 354, \"time\": 355, \"appreciated\": 356, \"technical\": 357, \"related\": 358, \"creation\": 359, \"type\": 360, \"instruction\": 361, \"conditionals\": 362, \"ifs\": 363, \"decisions\": 364, \"one\": 365, \"difference\": 366, \"between\": 367, \"method\": 368, \"important\": 369, \"methods\": 370, \"characteristics\": 371, \"recommended\": 372, \"use\": 373, \"funny\": 374, \"activities\": 375, \"more\": 376, \"fun\": 377, \"quotes\": 378, \"line\": 379, \"from\": 380, \"prepare\": 381, \"feel\": 382, \"like\": 383, \"eating\": 384, \"explicarme\": 385, \"\\u00bfpuedes\": 386, \"explicar\": 387, \"conceptos\": 388, \"basicos\": 389, \"basics\": 390, \"\\u00bfpara\": 391, \"uso\": 392, \"aplicaciones\": 393, \"\\u00bfen\": 394, \"usa\": 395, \"uses\": 396, \"applications\": 397, \"instalo\": 398, \"pasos\": 399, \"seguir\": 400, \"instala\": 401, \"manera\": 402, \"equipo\": 403, \"steps\": 404, \"follow\": 405, \"installed\": 406, \"device\": 407, \"ejecuto\": 408, \"correr\": 409, \"corre\": 410, \"forma\": 411, \"codigo\": 412, \"code\": 413, \"provide\": 414, \"repeticion\": 415, \"offer\": 416, \"repetition\": 417, \"contexto\": 418, \"context\": 419, \"serve\": 420}"}}