{"class_name": "Tokenizer", "config": {"num_words": 2000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 406, "word_counts": "{\"hola\": 3, \"hey\": 2, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 13, \"est\\u00e1s\": 2, \"que\": 64, \"tal\": 4, \"saludos\": 1, \"\\u00bfqu\\u00e9\": 20, \"hi\": 2, \"tu\": 4, \"d\\u00eda\": 1, \"te\": 3, \"encuentras\": 1, \"todo\": 5, \"va\": 2, \"has\": 1, \"hecho\": 1, \"\\u00bftodo\": 1, \"bien\": 7, \"me\": 15, \"cuentas\": 1, \"hay\": 4, \"de\": 47, \"nuevo\": 1, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"\\u00bfy\": 1, \"t\\u00fa\": 1, \"perfecto\": 1, \"bastante\": 1, \"por\": 5, \"preguntar\": 1, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adi\\u00f3s\": 1, \"hasta\": 3, \"luego\": 2, \"nos\": 2, \"vemos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 2, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"aprecio\": 1, \"ayuda\": 1, \"thanks\": 6, \"tiempo\": 1, \"se\": 11, \"agradece\": 1, \"es\": 40, \"la\": 16, \"programacion\": 41, \"define\": 20, \"en\": 57, \"terminos\": 2, \"creacion\": 1, \"software\": 2, \"describe\": 2, \"tecnicos\": 1, \"como\": 12, \"relaciona\": 1, \"con\": 5, \"el\": 18, \"hardware\": 2, \"una\": 24, \"variable\": 8, \"hace\": 6, \"valor\": 2, \"puede\": 1, \"cambiar\": 1, \"para\": 11, \"utiliza\": 2, \"un\": 23, \"condicional\": 1, \"if\": 5, \"tipo\": 1, \"instruccion\": 1, \"hacen\": 1, \"los\": 9, \"condicionales\": 1, \"toman\": 1, \"desiciones\": 1, \"ciclo\": 2, \"ayudan\": 1, \"ciclos\": 2, \"aplicacion\": 1, \"importancia\": 2, \"tienen\": 2, \"programa\": 4, \"condiciones\": 1, \"debe\": 1, \"cumplir\": 1, \"ejecutarse\": 1, \"funcion\": 4, \"metodo\": 2, \"devuelve\": 1, \"diferencia\": 1, \"entre\": 1, \"y\": 2, \"las\": 13, \"funciones\": 11, \"metodos\": 1, \"dame\": 4, \"definicion\": 3, \"oop\": 9, \"cuales\": 1, \"son\": 11, \"caracteristicas\": 1, \"del\": 1, \"recomendable\": 1, \"usar\": 1, \"tan\": 1, \"popular\": 4, \"genero\": 1, \"peliculas\": 1, \"mas\": 2, \"cual\": 5, \"costo\": 1, \"promedio\": 1, \"hacer\": 4, \"pelicula\": 6, \"accion\": 1, \"recomendarias\": 1, \"cu\\u00e1l\": 1, \"pel\\u00edcula\": 1, \"m\\u00e1s\": 1, \"este\": 1, \"a\\u00f1o\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"tienes\": 2, \"algun\": 2, \"bueno\": 1, \"di\": 2, \"algo\": 3, \"gracioso\": 1, \"recomiendas\": 1, \"alguna\": 3, \"actividad\": 2, \"hoy\": 2, \"podria\": 4, \"realizar\": 2, \"actividades\": 1, \"mi\": 4, \"dia\": 1, \"divertido\": 1, \"dialogo\": 3, \"podrias\": 3, \"darme\": 1, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"tengo\": 1, \"ganas\": 1, \"comer\": 2, \"qu\\u00e9\": 17, \"sql\": 12, \"significa\": 11, \"c\\u00f3mo\": 2, \"definir\": 2, \"representa\": 4, \"tipos\": 6, \"bases\": 7, \"datos\": 3, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"\\u00bfcu\\u00e1les\": 3, \"cu\\u00e1les\": 1, \"tabla\": 4, \"sirve\": 4, \"table\": 6, \"select\": 8, \"funciona\": 7, \"consultas\": 1, \"where\": 8, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 10, \"comando\": 2, \"update\": 10, \"delete\": 8, \"elimino\": 2, \"registros\": 1, \"saldre\": 4, \"unos\": 1, \"amigos\": 4, \"a\": 40, \"tomar\": 1, \"concierto\": 1, \"hello\": 3, \"good\": 5, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"how\": 31, \"are\": 20, \"you\": 25, \"what's\": 2, \"up\": 3, \"greetings\": 1, \"what\": 93, \"is\": 48, \"does\": 34, \"mean\": 11, \"to\": 11, \"represent\": 4, \"do\": 28, \"types\": 4, \"of\": 23, \"databases\": 5, \"exist\": 6, \"kinds\": 1, \"database\": 1, \"models\": 1, \"classes\": 1, \"the\": 20, \"in\": 49, \"used\": 8, \"for\": 9, \"work\": 9, \"queries\": 1, \"filters\": 1, \"who\": 1, \"your\": 4, \"function\": 4, \"command\": 2, \"i\": 21, \"data\": 1, \"records\": 1, \"will\": 4, \"go\": 4, \"out\": 3, \"with\": 4, \"some\": 1, \"friends\": 4, \"drinks\": 1, \"concert\": 1, \"eat\": 1, \"day\": 2, \"going\": 2, \"feeling\": 1, \"everything\": 3, \"have\": 6, \"been\": 1, \"fine\": 3, \"great\": 2, \"very\": 3, \"and\": 3, \"asking\": 1, \"goodbye\": 1, \"see\": 4, \"later\": 1, \"soon\": 1, \"tomorrow\": 1, \"thank\": 2, \"much\": 2, \"appreciate\": 2, \"it\": 2, \"many\": 1, \"you're\": 1, \"kind\": 1, \"help\": 2, \"time\": 1, \"appreciated\": 1, \"programming\": 42, \"can\": 9, \"give\": 6, \"definition\": 4, \"technical\": 1, \"terms\": 2, \"related\": 1, \"creation\": 1, \"an\": 10, \"type\": 1, \"instruction\": 1, \"conditionals\": 1, \"ifs\": 1, \"make\": 3, \"decisions\": 1, \"loops\": 6, \"application\": 2, \"one\": 1, \"difference\": 1, \"between\": 1, \"method\": 1, \"important\": 1, \"functions\": 11, \"methods\": 1, \"characteristics\": 1, \"recommended\": 1, \"use\": 1, \"tell\": 2, \"joke\": 3, \"say\": 3, \"something\": 2, \"funny\": 1, \"recommend\": 2, \"any\": 2, \"activity\": 2, \"today\": 3, \"could\": 6, \"activities\": 1, \"my\": 4, \"more\": 1, \"fun\": 1, \"movie\": 4, \"quote\": 2, \"quotes\": 1, \"line\": 1, \"from\": 1, \"food\": 3, \"prepare\": 1, \"feel\": 1, \"like\": 1, \"eating\": 1, \"clase\": 4, \"explica\": 7, \"class\": 4, \"explain\": 9, \"purpose\": 5, \"objeto\": 5, \"explicarme\": 1, \"object\": 12, \"defined\": 2, \"encapsulamiento\": 4, \"encapsulation\": 4, \"python\": 60, \"\\u00bfpuedes\": 1, \"explicar\": 1, \"conceptos\": 1, \"b\\u00e1sicos\": 1, \"basics\": 1, \"\\u00bfpara\": 1, \"\\u00bfcu\\u00e1l\": 3, \"uso\": 1, \"aplicaciones\": 1, \"tiene\": 5, \"\\u00bfen\": 1, \"usa\": 1, \"prop\\u00f3sito\": 1, \"uses\": 1, \"applications\": 1, \"instalo\": 1, \"computadora\": 2, \"puedo\": 2, \"instalar\": 3, \"pc\": 2, \"pasos\": 1, \"debo\": 2, \"seguir\": 1, \"instala\": 1, \"manera\": 1, \"equipo\": 1, \"install\": 4, \"on\": 4, \"computer\": 2, \"steps\": 1, \"should\": 2, \"follow\": 1, \"installed\": 1, \"way\": 2, \"device\": 1, \"ejecuto\": 1, \"ejecutar\": 2, \"correr\": 1, \"corre\": 1, \"script\": 2, \"forma\": 1, \"c\\u00f3digo\": 1, \"run\": 3, \"program\": 3, \"execute\": 2, \"code\": 1, \"instrucciones\": 5, \"control\": 10, \"flujo\": 4, \"estructuras\": 2, \"ofrece\": 2, \"funcionan\": 2, \"flow\": 4, \"instructions\": 2, \"statements\": 3, \"structures\": 2, \"provide\": 1, \"bucles\": 4, \"repetici\\u00f3n\": 1, \"loop\": 2, \"offer\": 1, \"repetition\": 1, \"herencia\": 5, \"contexto\": 1, \"concepto\": 4, \"proposito\": 3, \"inheritance\": 5, \"context\": 1, \"concept\": 4, \"serve\": 1, \"abstraccion\": 5, \"orientada\": 7, \"objetos\": 7, \"abstraction\": 5, \"oriented\": 7, \"polimorfismo\": 5, \"polymorphism\": 5, \"getter\": 10, \"utilizan\": 2, \"why\": 2, \"setter\": 10}", "word_docs": "{\"hola\": 3, \"hey\": 2, \"buenos\": 1, \"d\\u00edas\": 1, \"buenas\": 2, \"tardes\": 1, \"noches\": 1, \"\\u00bfc\\u00f3mo\": 13, \"est\\u00e1s\": 2, \"tal\": 4, \"que\": 64, \"saludos\": 1, \"\\u00bfqu\\u00e9\": 20, \"hi\": 2, \"d\\u00eda\": 1, \"tu\": 4, \"encuentras\": 1, \"te\": 3, \"todo\": 5, \"va\": 2, \"hecho\": 1, \"has\": 1, \"bien\": 7, \"\\u00bftodo\": 1, \"cuentas\": 1, \"me\": 15, \"nuevo\": 1, \"de\": 40, \"hay\": 4, \"gracias\": 7, \"muy\": 2, \"excelente\": 1, \"t\\u00fa\": 1, \"\\u00bfy\": 1, \"perfecto\": 1, \"bastante\": 1, \"preguntar\": 1, \"por\": 5, \"no\": 1, \"quejo\": 1, \"genial\": 1, \"adi\\u00f3s\": 1, \"hasta\": 3, \"luego\": 2, \"vemos\": 2, \"nos\": 2, \"chao\": 1, \"pronto\": 1, \"voy\": 1, \"bye\": 2, \"ma\\u00f1ana\": 1, \"despido\": 1, \"muchas\": 1, \"lo\": 1, \"agradezco\": 1, \"mil\": 1, \"amable\": 1, \"ayuda\": 1, \"aprecio\": 1, \"thanks\": 6, \"tiempo\": 1, \"se\": 11, \"agradece\": 1, \"programacion\": 41, \"la\": 16, \"es\": 40, \"creacion\": 1, \"software\": 2, \"define\": 20, \"en\": 56, \"terminos\": 2, \"describe\": 2, \"tecnicos\": 1, \"como\": 12, \"relaciona\": 1, \"hardware\": 2, \"el\": 18, \"con\": 5, \"una\": 23, \"variable\": 8, \"hace\": 6, \"puede\": 1, \"cambiar\": 1, \"valor\": 2, \"utiliza\": 2, \"para\": 11, \"un\": 22, \"condicional\": 1, \"if\": 5, \"tipo\": 1, \"instruccion\": 1, \"condicionales\": 1, \"hacen\": 1, \"los\": 9, \"desiciones\": 1, \"toman\": 1, \"ciclo\": 2, \"aplicacion\": 1, \"ciclos\": 2, \"ayudan\": 1, \"tienen\": 2, \"programa\": 4, \"importancia\": 2, \"condiciones\": 1, \"debe\": 1, \"cumplir\": 1, \"ejecutarse\": 1, \"funcion\": 4, \"metodo\": 2, \"devuelve\": 1, \"y\": 2, \"diferencia\": 1, \"entre\": 1, \"metodos\": 1, \"las\": 13, \"funciones\": 11, \"dame\": 4, \"definicion\": 3, \"oop\": 9, \"cuales\": 1, \"son\": 11, \"del\": 1, \"caracteristicas\": 1, \"recomendable\": 1, \"usar\": 1, \"popular\": 4, \"tan\": 1, \"genero\": 1, \"peliculas\": 1, \"mas\": 2, \"hacer\": 4, \"pelicula\": 6, \"cual\": 5, \"costo\": 1, \"promedio\": 1, \"recomendarias\": 1, \"accion\": 1, \"cu\\u00e1l\": 1, \"a\\u00f1o\": 1, \"pel\\u00edcula\": 1, \"m\\u00e1s\": 1, \"este\": 1, \"cuentame\": 1, \"chiste\": 3, \"dime\": 2, \"bueno\": 1, \"algun\": 2, \"tienes\": 2, \"algo\": 3, \"di\": 2, \"gracioso\": 1, \"recomiendas\": 1, \"actividad\": 2, \"alguna\": 3, \"hoy\": 2, \"realizar\": 2, \"podria\": 4, \"actividades\": 1, \"divertido\": 1, \"dia\": 1, \"mi\": 4, \"dialogo\": 3, \"darme\": 1, \"podrias\": 3, \"frase\": 1, \"comida\": 3, \"preparar\": 2, \"recomiendame\": 1, \"pueda\": 1, \"ganas\": 1, \"tengo\": 1, \"comer\": 2, \"qu\\u00e9\": 17, \"sql\": 12, \"significa\": 11, \"definir\": 2, \"c\\u00f3mo\": 2, \"representa\": 4, \"tipos\": 6, \"datos\": 3, \"bases\": 7, \"existen\": 4, \"modelos\": 1, \"clases\": 1, \"\\u00bfcu\\u00e1les\": 3, \"cu\\u00e1les\": 1, \"tabla\": 4, \"sirve\": 4, \"table\": 6, \"select\": 8, \"funciona\": 7, \"consultas\": 1, \"where\": 8, \"filtros\": 1, \"eres\": 2, \"quien\": 1, \"haces\": 1, \"insert\": 10, \"comando\": 2, \"update\": 10, \"delete\": 8, \"elimino\": 2, \"registros\": 1, \"unos\": 1, \"saldre\": 4, \"amigos\": 4, \"tomar\": 1, \"a\": 38, \"concierto\": 1, \"hello\": 3, \"good\": 5, \"morning\": 1, \"afternoon\": 1, \"evening\": 1, \"are\": 20, \"how\": 31, \"you\": 25, \"up\": 3, \"what's\": 2, \"greetings\": 1, \"what\": 93, \"is\": 48, \"does\": 34, \"mean\": 11, \"to\": 11, \"represent\": 4, \"do\": 24, \"databases\": 5, \"of\": 23, \"exist\": 6, \"types\": 4, \"kinds\": 1, \"models\": 1, \"database\": 1, \"classes\": 1, \"the\": 20, \"in\": 49, \"used\": 8, \"for\": 9, \"work\": 9, \"queries\": 1, \"filters\": 1, \"who\": 1, \"your\": 4, \"function\": 4, \"command\": 2, \"data\": 1, \"i\": 21, \"records\": 1, \"with\": 4, \"friends\": 4, \"go\": 4, \"will\": 4, \"some\": 1, \"out\": 3, \"drinks\": 1, \"concert\": 1, \"eat\": 1, \"going\": 2, \"day\": 2, \"feeling\": 1, \"everything\": 3, \"have\": 6, \"been\": 1, \"fine\": 3, \"great\": 2, \"very\": 3, \"and\": 3, \"asking\": 1, \"goodbye\": 1, \"later\": 1, \"see\": 4, \"soon\": 1, \"tomorrow\": 1, \"much\": 2, \"thank\": 2, \"it\": 2, \"appreciate\": 2, \"many\": 1, \"you're\": 1, \"kind\": 1, \"help\": 2, \"time\": 1, \"appreciated\": 1, \"programming\": 42, \"can\": 9, \"definition\": 4, \"give\": 6, \"terms\": 2, \"technical\": 1, \"related\": 1, \"creation\": 1, \"an\": 10, \"instruction\": 1, \"type\": 1, \"conditionals\": 1, \"make\": 3, \"decisions\": 1, \"ifs\": 1, \"loops\": 6, \"application\": 2, \"one\": 1, \"method\": 1, \"difference\": 1, \"between\": 1, \"important\": 1, \"methods\": 1, \"functions\": 11, \"characteristics\": 1, \"use\": 1, \"recommended\": 1, \"joke\": 3, \"tell\": 2, \"say\": 3, \"funny\": 1, \"something\": 2, \"activity\": 2, \"recommend\": 2, \"any\": 2, \"today\": 3, \"could\": 6, \"activities\": 1, \"my\": 4, \"more\": 1, \"fun\": 1, \"movie\": 4, \"quote\": 2, \"quotes\": 1, \"from\": 1, \"line\": 1, \"food\": 3, \"prepare\": 1, \"feel\": 1, \"like\": 1, \"eating\": 1, \"clase\": 4, \"explica\": 7, \"class\": 4, \"explain\": 9, \"purpose\": 5, \"objeto\": 5, \"explicarme\": 1, \"object\": 12, \"defined\": 2, \"encapsulamiento\": 4, \"encapsulation\": 4, \"python\": 60, \"explicar\": 1, \"\\u00bfpuedes\": 1, \"conceptos\": 1, \"b\\u00e1sicos\": 1, \"basics\": 1, \"\\u00bfpara\": 1, \"uso\": 1, \"\\u00bfcu\\u00e1l\": 3, \"aplicaciones\": 1, \"tiene\": 5, \"\\u00bfen\": 1, \"usa\": 1, \"prop\\u00f3sito\": 1, \"uses\": 1, \"applications\": 1, \"instalo\": 1, \"computadora\": 2, \"puedo\": 2, \"pc\": 2, \"instalar\": 3, \"debo\": 2, \"seguir\": 1, \"pasos\": 1, \"instala\": 1, \"manera\": 1, \"equipo\": 1, \"on\": 4, \"install\": 4, \"computer\": 2, \"steps\": 1, \"follow\": 1, \"should\": 2, \"installed\": 1, \"device\": 1, \"way\": 2, \"ejecuto\": 1, \"ejecutar\": 2, \"correr\": 1, \"corre\": 1, \"script\": 2, \"forma\": 1, \"c\\u00f3digo\": 1, \"run\": 3, \"program\": 3, \"execute\": 2, \"code\": 1, \"instrucciones\": 5, \"flujo\": 4, \"control\": 10, \"ofrece\": 2, \"estructuras\": 2, \"funcionan\": 2, \"flow\": 4, \"instructions\": 2, \"statements\": 3, \"provide\": 1, \"structures\": 2, \"bucles\": 4, \"repetici\\u00f3n\": 1, \"offer\": 1, \"loop\": 2, \"repetition\": 1, \"herencia\": 5, \"contexto\": 1, \"concepto\": 4, \"proposito\": 3, \"inheritance\": 5, \"context\": 1, \"concept\": 4, \"serve\": 1, \"abstraccion\": 5, \"objetos\": 7, \"orientada\": 7, \"abstraction\": 5, \"oriented\": 7, \"polimorfismo\": 5, \"polymorphism\": 5, \"getter\": 10, \"utilizan\": 2, \"why\": 2, \"setter\": 10}", "index_docs": "{\"133\": 3, \"163\": 2, \"237\": 1, \"238\": 1, \"164\": 2, \"239\": 1, \"240\": 1, \"29\": 13, \"165\": 2, \"94\": 4, \"3\": 64, \"241\": 1, \"21\": 20, \"166\": 2, \"242\": 1, \"95\": 4, \"243\": 1, \"134\": 3, \"77\": 5, \"167\": 2, \"245\": 1, \"244\": 1, \"59\": 7, \"246\": 1, \"247\": 1, \"28\": 15, \"248\": 1, \"8\": 40, \"96\": 4, \"60\": 7, \"168\": 2, \"249\": 1, \"251\": 1, \"250\": 1, \"252\": 1, \"253\": 1, \"254\": 1, \"78\": 5, \"255\": 1, \"256\": 1, \"257\": 1, \"258\": 1, \"135\": 3, \"169\": 2, \"171\": 2, \"170\": 2, \"259\": 1, \"260\": 1, \"261\": 1, \"172\": 2, \"262\": 1, \"263\": 1, \"264\": 1, \"265\": 1, \"266\": 1, \"267\": 1, \"268\": 1, \"270\": 1, \"269\": 1, \"67\": 6, \"271\": 1, \"34\": 11, \"272\": 1, \"10\": 41, \"27\": 16, \"11\": 40, \"273\": 1, \"174\": 2, \"22\": 20, \"5\": 56, \"173\": 2, \"175\": 2, \"274\": 1, \"31\": 12, \"275\": 1, \"176\": 2, \"25\": 18, \"79\": 5, \"17\": 23, \"54\": 8, \"68\": 6, \"276\": 1, \"277\": 1, \"177\": 2, \"178\": 2, \"35\": 11, \"18\": 22, \"278\": 1, \"80\": 5, \"279\": 1, \"280\": 1, \"282\": 1, \"281\": 1, \"48\": 9, \"284\": 1, \"283\": 1, \"179\": 2, \"286\": 1, \"180\": 2, \"285\": 1, \"182\": 2, \"97\": 4, \"181\": 2, \"287\": 1, \"288\": 1, \"289\": 1, \"290\": 1, \"98\": 4, \"183\": 2, \"291\": 1, \"184\": 2, \"292\": 1, \"293\": 1, \"294\": 1, \"30\": 13, \"36\": 11, \"99\": 4, \"136\": 3, \"49\": 9, \"295\": 1, \"37\": 11, \"297\": 1, \"296\": 1, \"298\": 1, \"299\": 1, \"100\": 4, \"300\": 1, \"301\": 1, \"302\": 1, \"185\": 2, \"101\": 4, \"69\": 6, \"81\": 5, \"303\": 1, \"304\": 1, \"306\": 1, \"305\": 1, \"307\": 1, \"311\": 1, \"308\": 1, \"309\": 1, \"310\": 1, \"312\": 1, \"137\": 3, \"186\": 2, \"313\": 1, \"188\": 2, \"187\": 2, \"138\": 3, \"189\": 2, \"314\": 1, \"315\": 1, \"190\": 2, \"139\": 3, \"191\": 2, \"192\": 2, \"102\": 4, \"316\": 1, \"318\": 1, \"317\": 1, \"103\": 4, \"140\": 3, \"319\": 1, \"141\": 3, \"320\": 1, \"142\": 3, \"193\": 2, \"321\": 1, \"322\": 1, \"324\": 1, \"323\": 1, \"194\": 2, \"26\": 17, \"32\": 12, \"38\": 11, \"196\": 2, \"195\": 2, \"104\": 4, \"70\": 6, \"143\": 3, \"61\": 7, \"105\": 4, \"325\": 1, \"326\": 1, \"144\": 3, \"327\": 1, \"106\": 4, \"107\": 4, \"71\": 6, \"55\": 8, \"62\": 7, \"328\": 1, \"56\": 8, \"329\": 1, \"197\": 2, \"330\": 1, \"331\": 1, \"42\": 10, \"198\": 2, \"43\": 10, \"57\": 8, \"199\": 2, \"332\": 1, \"333\": 1, \"108\": 4, \"109\": 4, \"334\": 1, \"12\": 38, \"335\": 1, \"145\": 3, \"82\": 5, \"336\": 1, \"337\": 1, \"338\": 1, \"23\": 20, \"14\": 31, \"16\": 25, \"146\": 3, \"200\": 2, \"339\": 1, \"2\": 93, \"7\": 48, \"13\": 34, \"39\": 11, \"40\": 11, \"110\": 4, \"15\": 24, \"83\": 5, \"19\": 23, \"72\": 6, \"111\": 4, \"340\": 1, \"342\": 1, \"341\": 1, \"343\": 1, \"24\": 20, \"6\": 49, \"58\": 8, \"50\": 9, \"51\": 9, \"344\": 1, \"345\": 1, \"346\": 1, \"112\": 4, \"113\": 4, \"201\": 2, \"347\": 1, \"20\": 21, \"348\": 1, \"116\": 4, \"117\": 4, \"115\": 4, \"114\": 4, \"349\": 1, \"147\": 3, \"350\": 1, \"351\": 1, \"352\": 1, \"203\": 2, \"202\": 2, \"353\": 1, \"148\": 3, \"73\": 6, \"354\": 1, \"149\": 3, \"204\": 2, \"150\": 3, \"151\": 3, \"355\": 1, \"356\": 1, \"357\": 1, \"118\": 4, \"358\": 1, \"359\": 1, \"206\": 2, \"205\": 2, \"208\": 2, \"207\": 2, \"360\": 1, \"361\": 1, \"362\": 1, \"209\": 2, \"363\": 1, \"364\": 1, \"9\": 42, \"52\": 9, \"119\": 4, \"74\": 6, \"210\": 2, \"365\": 1, \"366\": 1, \"367\": 1, \"44\": 10, \"369\": 1, \"368\": 1, \"370\": 1, \"152\": 3, \"372\": 1, \"371\": 1, \"75\": 6, \"211\": 2, \"373\": 1, \"376\": 1, \"374\": 1, \"375\": 1, \"377\": 1, \"378\": 1, \"41\": 11, \"379\": 1, \"381\": 1, \"380\": 1, \"153\": 3, \"212\": 2, \"154\": 3, \"382\": 1, \"213\": 2, \"216\": 2, \"214\": 2, \"215\": 2, \"155\": 3, \"76\": 6, \"383\": 1, \"120\": 4, \"384\": 1, \"385\": 1, \"121\": 4, \"217\": 2, \"386\": 1, \"388\": 1, \"387\": 1, \"156\": 3, \"389\": 1, \"390\": 1, \"391\": 1, \"392\": 1, \"122\": 4, \"63\": 7, \"123\": 4, \"53\": 9, \"84\": 5, \"85\": 5, \"393\": 1, \"33\": 12, \"218\": 2, \"124\": 4, \"125\": 4, \"4\": 60, \"395\": 1, \"394\": 1, \"396\": 1, \"397\": 1, \"398\": 1, \"399\": 1, \"400\": 1, \"157\": 3, \"401\": 1, \"86\": 5, \"402\": 1, \"403\": 1, \"404\": 1, \"405\": 1, \"406\": 1, \"407\": 1, \"219\": 2, \"220\": 2, \"221\": 2, \"158\": 3, \"222\": 2, \"409\": 1, \"408\": 1, \"410\": 1, \"411\": 1, \"412\": 1, \"127\": 4, \"126\": 4, \"223\": 2, \"413\": 1, \"414\": 1, \"224\": 2, \"415\": 1, \"416\": 1, \"225\": 2, \"417\": 1, \"226\": 2, \"418\": 1, \"419\": 1, \"227\": 2, \"420\": 1, \"421\": 1, \"159\": 3, \"160\": 3, \"228\": 2, \"422\": 1, \"87\": 5, \"128\": 4, \"45\": 10, \"230\": 2, \"229\": 2, \"231\": 2, \"129\": 4, \"232\": 2, \"161\": 3, \"423\": 1, \"233\": 2, \"130\": 4, \"424\": 1, \"425\": 1, \"234\": 2, \"426\": 1, \"88\": 5, \"427\": 1, \"131\": 4, \"162\": 3, \"89\": 5, \"428\": 1, \"132\": 4, \"429\": 1, \"90\": 5, \"65\": 7, \"64\": 7, \"91\": 5, \"66\": 7, \"92\": 5, \"93\": 5, \"46\": 10, \"235\": 2, \"236\": 2, \"47\": 10}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"what\", \"3\": \"que\", \"4\": \"python\", \"5\": \"en\", \"6\": \"in\", \"7\": \"is\", \"8\": \"de\", \"9\": \"programming\", \"10\": \"programacion\", \"11\": \"es\", \"12\": \"a\", \"13\": \"does\", \"14\": \"how\", \"15\": \"do\", \"16\": \"you\", \"17\": \"una\", \"18\": \"un\", \"19\": \"of\", \"20\": \"i\", \"21\": \"\\u00bfqu\\u00e9\", \"22\": \"define\", \"23\": \"are\", \"24\": \"the\", \"25\": \"el\", \"26\": \"qu\\u00e9\", \"27\": \"la\", \"28\": \"me\", \"29\": \"\\u00bfc\\u00f3mo\", \"30\": \"las\", \"31\": \"como\", \"32\": \"sql\", \"33\": \"object\", \"34\": \"se\", \"35\": \"para\", \"36\": \"funciones\", \"37\": \"son\", \"38\": \"significa\", \"39\": \"mean\", \"40\": \"to\", \"41\": \"functions\", \"42\": \"insert\", \"43\": \"update\", \"44\": \"an\", \"45\": \"control\", \"46\": \"getter\", \"47\": \"setter\", \"48\": \"los\", \"49\": \"oop\", \"50\": \"for\", \"51\": \"work\", \"52\": \"can\", \"53\": \"explain\", \"54\": \"variable\", \"55\": \"select\", \"56\": \"where\", \"57\": \"delete\", \"58\": \"used\", \"59\": \"bien\", \"60\": \"gracias\", \"61\": \"bases\", \"62\": \"funciona\", \"63\": \"explica\", \"64\": \"orientada\", \"65\": \"objetos\", \"66\": \"oriented\", \"67\": \"thanks\", \"68\": \"hace\", \"69\": \"pelicula\", \"70\": \"tipos\", \"71\": \"table\", \"72\": \"exist\", \"73\": \"have\", \"74\": \"give\", \"75\": \"loops\", \"76\": \"could\", \"77\": \"todo\", \"78\": \"por\", \"79\": \"con\", \"80\": \"if\", \"81\": \"cual\", \"82\": \"good\", \"83\": \"databases\", \"84\": \"purpose\", \"85\": \"objeto\", \"86\": \"tiene\", \"87\": \"instrucciones\", \"88\": \"herencia\", \"89\": \"inheritance\", \"90\": \"abstraccion\", \"91\": \"abstraction\", \"92\": \"polimorfismo\", \"93\": \"polymorphism\", \"94\": \"tal\", \"95\": \"tu\", \"96\": \"hay\", \"97\": \"programa\", \"98\": \"funcion\", \"99\": \"dame\", \"100\": \"popular\", \"101\": \"hacer\", \"102\": \"podria\", \"103\": \"mi\", \"104\": \"representa\", \"105\": \"existen\", \"106\": \"tabla\", \"107\": \"sirve\", \"108\": \"saldre\", \"109\": \"amigos\", \"110\": \"represent\", \"111\": \"types\", \"112\": \"your\", \"113\": \"function\", \"114\": \"will\", \"115\": \"go\", \"116\": \"with\", \"117\": \"friends\", \"118\": \"see\", \"119\": \"definition\", \"120\": \"my\", \"121\": \"movie\", \"122\": \"clase\", \"123\": \"class\", \"124\": \"encapsulamiento\", \"125\": \"encapsulation\", \"126\": \"install\", \"127\": \"on\", \"128\": \"flujo\", \"129\": \"flow\", \"130\": \"bucles\", \"131\": \"concepto\", \"132\": \"concept\", \"133\": \"hola\", \"134\": \"te\", \"135\": \"hasta\", \"136\": \"definicion\", \"137\": \"chiste\", \"138\": \"algo\", \"139\": \"alguna\", \"140\": \"dialogo\", \"141\": \"podrias\", \"142\": \"comida\", \"143\": \"datos\", \"144\": \"\\u00bfcu\\u00e1les\", \"145\": \"hello\", \"146\": \"up\", \"147\": \"out\", \"148\": \"everything\", \"149\": \"fine\", \"150\": \"very\", \"151\": \"and\", \"152\": \"make\", \"153\": \"joke\", \"154\": \"say\", \"155\": \"today\", \"156\": \"food\", \"157\": \"\\u00bfcu\\u00e1l\", \"158\": \"instalar\", \"159\": \"run\", \"160\": \"program\", \"161\": \"statements\", \"162\": \"proposito\", \"163\": \"hey\", \"164\": \"buenas\", \"165\": \"est\\u00e1s\", \"166\": \"hi\", \"167\": \"va\", \"168\": \"muy\", \"169\": \"luego\", \"170\": \"nos\", \"171\": \"vemos\", \"172\": \"bye\", \"173\": \"terminos\", \"174\": \"software\", \"175\": \"describe\", \"176\": \"hardware\", \"177\": \"valor\", \"178\": \"utiliza\", \"179\": \"ciclo\", \"180\": \"ciclos\", \"181\": \"importancia\", \"182\": \"tienen\", \"183\": \"metodo\", \"184\": \"y\", \"185\": \"mas\", \"186\": \"dime\", \"187\": \"tienes\", \"188\": \"algun\", \"189\": \"di\", \"190\": \"actividad\", \"191\": \"hoy\", \"192\": \"realizar\", \"193\": \"preparar\", \"194\": \"comer\", \"195\": \"c\\u00f3mo\", \"196\": \"definir\", \"197\": \"eres\", \"198\": \"comando\", \"199\": \"elimino\", \"200\": \"what's\", \"201\": \"command\", \"202\": \"day\", \"203\": \"going\", \"204\": \"great\", \"205\": \"thank\", \"206\": \"much\", \"207\": \"appreciate\", \"208\": \"it\", \"209\": \"help\", \"210\": \"terms\", \"211\": \"application\", \"212\": \"tell\", \"213\": \"something\", \"214\": \"recommend\", \"215\": \"any\", \"216\": \"activity\", \"217\": \"quote\", \"218\": \"defined\", \"219\": \"computadora\", \"220\": \"puedo\", \"221\": \"pc\", \"222\": \"debo\", \"223\": \"computer\", \"224\": \"should\", \"225\": \"way\", \"226\": \"ejecutar\", \"227\": \"script\", \"228\": \"execute\", \"229\": \"estructuras\", \"230\": \"ofrece\", \"231\": \"funcionan\", \"232\": \"instructions\", \"233\": \"structures\", \"234\": \"loop\", \"235\": \"utilizan\", \"236\": \"why\", \"237\": \"buenos\", \"238\": \"d\\u00edas\", \"239\": \"tardes\", \"240\": \"noches\", \"241\": \"saludos\", \"242\": \"d\\u00eda\", \"243\": \"encuentras\", \"244\": \"has\", \"245\": \"hecho\", \"246\": \"\\u00bftodo\", \"247\": \"cuentas\", \"248\": \"nuevo\", \"249\": \"excelente\", \"250\": \"\\u00bfy\", \"251\": \"t\\u00fa\", \"252\": \"perfecto\", \"253\": \"bastante\", \"254\": \"preguntar\", \"255\": \"no\", \"256\": \"quejo\", \"257\": \"genial\", \"258\": \"adi\\u00f3s\", \"259\": \"chao\", \"260\": \"pronto\", \"261\": \"voy\", \"262\": \"ma\\u00f1ana\", \"263\": \"despido\", \"264\": \"muchas\", \"265\": \"lo\", \"266\": \"agradezco\", \"267\": \"mil\", \"268\": \"amable\", \"269\": \"aprecio\", \"270\": \"ayuda\", \"271\": \"tiempo\", \"272\": \"agradece\", \"273\": \"creacion\", \"274\": \"tecnicos\", \"275\": \"relaciona\", \"276\": \"puede\", \"277\": \"cambiar\", \"278\": \"condicional\", \"279\": \"tipo\", \"280\": \"instruccion\", \"281\": \"hacen\", \"282\": \"condicionales\", \"283\": \"toman\", \"284\": \"desiciones\", \"285\": \"ayudan\", \"286\": \"aplicacion\", \"287\": \"condiciones\", \"288\": \"debe\", \"289\": \"cumplir\", \"290\": \"ejecutarse\", \"291\": \"devuelve\", \"292\": \"diferencia\", \"293\": \"entre\", \"294\": \"metodos\", \"295\": \"cuales\", \"296\": \"caracteristicas\", \"297\": \"del\", \"298\": \"recomendable\", \"299\": \"usar\", \"300\": \"tan\", \"301\": \"genero\", \"302\": \"peliculas\", \"303\": \"costo\", \"304\": \"promedio\", \"305\": \"accion\", \"306\": \"recomendarias\", \"307\": \"cu\\u00e1l\", \"308\": \"pel\\u00edcula\", \"309\": \"m\\u00e1s\", \"310\": \"este\", \"311\": \"a\\u00f1o\", \"312\": \"cuentame\", \"313\": \"bueno\", \"314\": \"gracioso\", \"315\": \"recomiendas\", \"316\": \"actividades\", \"317\": \"dia\", \"318\": \"divertido\", \"319\": \"darme\", \"320\": \"frase\", \"321\": \"recomiendame\", \"322\": \"pueda\", \"323\": \"tengo\", \"324\": \"ganas\", \"325\": \"modelos\", \"326\": \"clases\", \"327\": \"cu\\u00e1les\", \"328\": \"consultas\", \"329\": \"filtros\", \"330\": \"quien\", \"331\": \"haces\", \"332\": \"registros\", \"333\": \"unos\", \"334\": \"tomar\", \"335\": \"concierto\", \"336\": \"morning\", \"337\": \"afternoon\", \"338\": \"evening\", \"339\": \"greetings\", \"340\": \"kinds\", \"341\": \"database\", \"342\": \"models\", \"343\": \"classes\", \"344\": \"queries\", \"345\": \"filters\", \"346\": \"who\", \"347\": \"data\", \"348\": \"records\", \"349\": \"some\", \"350\": \"drinks\", \"351\": \"concert\", \"352\": \"eat\", \"353\": \"feeling\", \"354\": \"been\", \"355\": \"asking\", \"356\": \"goodbye\", \"357\": \"later\", \"358\": \"soon\", \"359\": \"tomorrow\", \"360\": \"many\", \"361\": \"you're\", \"362\": \"kind\", \"363\": \"time\", \"364\": \"appreciated\", \"365\": \"technical\", \"366\": \"related\", \"367\": \"creation\", \"368\": \"type\", \"369\": \"instruction\", \"370\": \"conditionals\", \"371\": \"ifs\", \"372\": \"decisions\", \"373\": \"one\", \"374\": \"difference\", \"375\": \"between\", \"376\": \"method\", \"377\": \"important\", \"378\": \"methods\", \"379\": \"characteristics\", \"380\": \"recommended\", \"381\": \"use\", \"382\": \"funny\", \"383\": \"activities\", \"384\": \"more\", \"385\": \"fun\", \"386\": \"quotes\", \"387\": \"line\", \"388\": \"from\", \"389\": \"prepare\", \"390\": \"feel\", \"391\": \"like\", \"392\": \"eating\", \"393\": \"explicarme\", \"394\": \"\\u00bfpuedes\", \"395\": \"explicar\", \"396\": \"conceptos\", \"397\": \"b\\u00e1sicos\", \"398\": \"basics\", \"399\": \"\\u00bfpara\", \"400\": \"uso\", \"401\": \"aplicaciones\", \"402\": \"\\u00bfen\", \"403\": \"usa\", \"404\": \"prop\\u00f3sito\", \"405\": \"uses\", \"406\": \"applications\", \"407\": \"instalo\", \"408\": \"pasos\", \"409\": \"seguir\", \"410\": \"instala\", \"411\": \"manera\", \"412\": \"equipo\", \"413\": \"steps\", \"414\": \"follow\", \"415\": \"installed\", \"416\": \"device\", \"417\": \"ejecuto\", \"418\": \"correr\", \"419\": \"corre\", \"420\": \"forma\", \"421\": \"c\\u00f3digo\", \"422\": \"code\", \"423\": \"provide\", \"424\": \"repetici\\u00f3n\", \"425\": \"offer\", \"426\": \"repetition\", \"427\": \"contexto\", \"428\": \"context\", \"429\": \"serve\"}", "word_index": "{\"<OOV>\": 1, \"what\": 2, \"que\": 3, \"python\": 4, \"en\": 5, \"in\": 6, \"is\": 7, \"de\": 8, \"programming\": 9, \"programacion\": 10, \"es\": 11, \"a\": 12, \"does\": 13, \"how\": 14, \"do\": 15, \"you\": 16, \"una\": 17, \"un\": 18, \"of\": 19, \"i\": 20, \"\\u00bfqu\\u00e9\": 21, \"define\": 22, \"are\": 23, \"the\": 24, \"el\": 25, \"qu\\u00e9\": 26, \"la\": 27, \"me\": 28, \"\\u00bfc\\u00f3mo\": 29, \"las\": 30, \"como\": 31, \"sql\": 32, \"object\": 33, \"se\": 34, \"para\": 35, \"funciones\": 36, \"son\": 37, \"significa\": 38, \"mean\": 39, \"to\": 40, \"functions\": 41, \"insert\": 42, \"update\": 43, \"an\": 44, \"control\": 45, \"getter\": 46, \"setter\": 47, \"los\": 48, \"oop\": 49, \"for\": 50, \"work\": 51, \"can\": 52, \"explain\": 53, \"variable\": 54, \"select\": 55, \"where\": 56, \"delete\": 57, \"used\": 58, \"bien\": 59, \"gracias\": 60, \"bases\": 61, \"funciona\": 62, \"explica\": 63, \"orientada\": 64, \"objetos\": 65, \"oriented\": 66, \"thanks\": 67, \"hace\": 68, \"pelicula\": 69, \"tipos\": 70, \"table\": 71, \"exist\": 72, \"have\": 73, \"give\": 74, \"loops\": 75, \"could\": 76, \"todo\": 77, \"por\": 78, \"con\": 79, \"if\": 80, \"cual\": 81, \"good\": 82, \"databases\": 83, \"purpose\": 84, \"objeto\": 85, \"tiene\": 86, \"instrucciones\": 87, \"herencia\": 88, \"inheritance\": 89, \"abstraccion\": 90, \"abstraction\": 91, \"polimorfismo\": 92, \"polymorphism\": 93, \"tal\": 94, \"tu\": 95, \"hay\": 96, \"programa\": 97, \"funcion\": 98, \"dame\": 99, \"popular\": 100, \"hacer\": 101, \"podria\": 102, \"mi\": 103, \"representa\": 104, \"existen\": 105, \"tabla\": 106, \"sirve\": 107, \"saldre\": 108, \"amigos\": 109, \"represent\": 110, \"types\": 111, \"your\": 112, \"function\": 113, \"will\": 114, \"go\": 115, \"with\": 116, \"friends\": 117, \"see\": 118, \"definition\": 119, \"my\": 120, \"movie\": 121, \"clase\": 122, \"class\": 123, \"encapsulamiento\": 124, \"encapsulation\": 125, \"install\": 126, \"on\": 127, \"flujo\": 128, \"flow\": 129, \"bucles\": 130, \"concepto\": 131, \"concept\": 132, \"hola\": 133, \"te\": 134, \"hasta\": 135, \"definicion\": 136, \"chiste\": 137, \"algo\": 138, \"alguna\": 139, \"dialogo\": 140, \"podrias\": 141, \"comida\": 142, \"datos\": 143, \"\\u00bfcu\\u00e1les\": 144, \"hello\": 145, \"up\": 146, \"out\": 147, \"everything\": 148, \"fine\": 149, \"very\": 150, \"and\": 151, \"make\": 152, \"joke\": 153, \"say\": 154, \"today\": 155, \"food\": 156, \"\\u00bfcu\\u00e1l\": 157, \"instalar\": 158, \"run\": 159, \"program\": 160, \"statements\": 161, \"proposito\": 162, \"hey\": 163, \"buenas\": 164, \"est\\u00e1s\": 165, \"hi\": 166, \"va\": 167, \"muy\": 168, \"luego\": 169, \"nos\": 170, \"vemos\": 171, \"bye\": 172, \"terminos\": 173, \"software\": 174, \"describe\": 175, \"hardware\": 176, \"valor\": 177, \"utiliza\": 178, \"ciclo\": 179, \"ciclos\": 180, \"importancia\": 181, \"tienen\": 182, \"metodo\": 183, \"y\": 184, \"mas\": 185, \"dime\": 186, \"tienes\": 187, \"algun\": 188, \"di\": 189, \"actividad\": 190, \"hoy\": 191, \"realizar\": 192, \"preparar\": 193, \"comer\": 194, \"c\\u00f3mo\": 195, \"definir\": 196, \"eres\": 197, \"comando\": 198, \"elimino\": 199, \"what's\": 200, \"command\": 201, \"day\": 202, \"going\": 203, \"great\": 204, \"thank\": 205, \"much\": 206, \"appreciate\": 207, \"it\": 208, \"help\": 209, \"terms\": 210, \"application\": 211, \"tell\": 212, \"something\": 213, \"recommend\": 214, \"any\": 215, \"activity\": 216, \"quote\": 217, \"defined\": 218, \"computadora\": 219, \"puedo\": 220, \"pc\": 221, \"debo\": 222, \"computer\": 223, \"should\": 224, \"way\": 225, \"ejecutar\": 226, \"script\": 227, \"execute\": 228, \"estructuras\": 229, \"ofrece\": 230, \"funcionan\": 231, \"instructions\": 232, \"structures\": 233, \"loop\": 234, \"utilizan\": 235, \"why\": 236, \"buenos\": 237, \"d\\u00edas\": 238, \"tardes\": 239, \"noches\": 240, \"saludos\": 241, \"d\\u00eda\": 242, \"encuentras\": 243, \"has\": 244, \"hecho\": 245, \"\\u00bftodo\": 246, \"cuentas\": 247, \"nuevo\": 248, \"excelente\": 249, \"\\u00bfy\": 250, \"t\\u00fa\": 251, \"perfecto\": 252, \"bastante\": 253, \"preguntar\": 254, \"no\": 255, \"quejo\": 256, \"genial\": 257, \"adi\\u00f3s\": 258, \"chao\": 259, \"pronto\": 260, \"voy\": 261, \"ma\\u00f1ana\": 262, \"despido\": 263, \"muchas\": 264, \"lo\": 265, \"agradezco\": 266, \"mil\": 267, \"amable\": 268, \"aprecio\": 269, \"ayuda\": 270, \"tiempo\": 271, \"agradece\": 272, \"creacion\": 273, \"tecnicos\": 274, \"relaciona\": 275, \"puede\": 276, \"cambiar\": 277, \"condicional\": 278, \"tipo\": 279, \"instruccion\": 280, \"hacen\": 281, \"condicionales\": 282, \"toman\": 283, \"desiciones\": 284, \"ayudan\": 285, \"aplicacion\": 286, \"condiciones\": 287, \"debe\": 288, \"cumplir\": 289, \"ejecutarse\": 290, \"devuelve\": 291, \"diferencia\": 292, \"entre\": 293, \"metodos\": 294, \"cuales\": 295, \"caracteristicas\": 296, \"del\": 297, \"recomendable\": 298, \"usar\": 299, \"tan\": 300, \"genero\": 301, \"peliculas\": 302, \"costo\": 303, \"promedio\": 304, \"accion\": 305, \"recomendarias\": 306, \"cu\\u00e1l\": 307, \"pel\\u00edcula\": 308, \"m\\u00e1s\": 309, \"este\": 310, \"a\\u00f1o\": 311, \"cuentame\": 312, \"bueno\": 313, \"gracioso\": 314, \"recomiendas\": 315, \"actividades\": 316, \"dia\": 317, \"divertido\": 318, \"darme\": 319, \"frase\": 320, \"recomiendame\": 321, \"pueda\": 322, \"tengo\": 323, \"ganas\": 324, \"modelos\": 325, \"clases\": 326, \"cu\\u00e1les\": 327, \"consultas\": 328, \"filtros\": 329, \"quien\": 330, \"haces\": 331, \"registros\": 332, \"unos\": 333, \"tomar\": 334, \"concierto\": 335, \"morning\": 336, \"afternoon\": 337, \"evening\": 338, \"greetings\": 339, \"kinds\": 340, \"database\": 341, \"models\": 342, \"classes\": 343, \"queries\": 344, \"filters\": 345, \"who\": 346, \"data\": 347, \"records\": 348, \"some\": 349, \"drinks\": 350, \"concert\": 351, \"eat\": 352, \"feeling\": 353, \"been\": 354, \"asking\": 355, \"goodbye\": 356, \"later\": 357, \"soon\": 358, \"tomorrow\": 359, \"many\": 360, \"you're\": 361, \"kind\": 362, \"time\": 363, \"appreciated\": 364, \"technical\": 365, \"related\": 366, \"creation\": 367, \"type\": 368, \"instruction\": 369, \"conditionals\": 370, \"ifs\": 371, \"decisions\": 372, \"one\": 373, \"difference\": 374, \"between\": 375, \"method\": 376, \"important\": 377, \"methods\": 378, \"characteristics\": 379, \"recommended\": 380, \"use\": 381, \"funny\": 382, \"activities\": 383, \"more\": 384, \"fun\": 385, \"quotes\": 386, \"line\": 387, \"from\": 388, \"prepare\": 389, \"feel\": 390, \"like\": 391, \"eating\": 392, \"explicarme\": 393, \"\\u00bfpuedes\": 394, \"explicar\": 395, \"conceptos\": 396, \"b\\u00e1sicos\": 397, \"basics\": 398, \"\\u00bfpara\": 399, \"uso\": 400, \"aplicaciones\": 401, \"\\u00bfen\": 402, \"usa\": 403, \"prop\\u00f3sito\": 404, \"uses\": 405, \"applications\": 406, \"instalo\": 407, \"pasos\": 408, \"seguir\": 409, \"instala\": 410, \"manera\": 411, \"equipo\": 412, \"steps\": 413, \"follow\": 414, \"installed\": 415, \"device\": 416, \"ejecuto\": 417, \"correr\": 418, \"corre\": 419, \"forma\": 420, \"c\\u00f3digo\": 421, \"code\": 422, \"provide\": 423, \"repetici\\u00f3n\": 424, \"offer\": 425, \"repetition\": 426, \"contexto\": 427, \"context\": 428, \"serve\": 429}"}}